Члены Ассамблеи Уэльса не хотят «походить на маппетов»
Среди некоторых членов Национальной ассамблеи зреет недовольство предложением принять для их наименования аббревиатуру MWP (от англ. Member of the Welsh Parliament — член Парламента Уэльса).
Проблематичное решение связано с планами изменить название Ассамблеи на Парламент Уэльса.
Членов Ассамблеи из разных политических партий беспокоят возможные шутки с этой аббревиатурой.
Один из лейбористов, выражая мнение своей партии, высказал обеспокоенность по поводу того, что новая аббревиатура «рифмуется Twp и Pwp».
Для наших читателей не из Уэльса: на валлийском twp означает «тупица», а pwp — «какашка».
По словам члена Ассамблеи из Партии Уэльса, его организация в целом «осталась недовольна» и предложила другие варианты.
Представители консервативной партии «не возражают» против новой аббревиатуры, но при этом отмечают, что MWP близко по написанию к слову Muppet (маппет).
В этом контексте буква w в валлийском языке произносится примерно как буква u в йоркширском диалекте английского.
Комитет Ассамблеи, в настоящее время разрабатывающий проект закона о смене названия, выступил со следующим заявлением: «Окончательное решение о том, как будут именоваться Члены ассамблеи, разумеется, останется за ними».
Законом об управлении Уэльсом от 2017 года Национальная ассамблея Уэльса уполномочена менять свое название.
В июне Комитетом были опубликованы результаты опроса общественного мнения по поводу предложенных вариантов, согласно которым вариант «Парламент Уэльса» вместо «Ассамблеи» нашел широкую поддержку среди местного населения.
Что же касается наименования членов Ассамблеи, Комитет высказал предпочтение в пользу варианта «Члены Парламента Уэльса» (Welsh Parliament Members, или WMP), в то время как вариант MWP получил наибольшую поддержку общественности.
Судя по всему, члены Ассамблеи предлагают другие варианты, но Председательствующему члену, Элину Джонсу, будет непросто найти устраивающее всех решение. Напомним, что проект закона об изменениях должен быть представлен уже через несколько недель.
Законы о реформах будут включать и другие модификации рабочего процесса Ассамблеи, в том числе новые правила о дисквалификации членов Ассамблеи и устройстве системы Комитета.
Члены Ассамблеи проголосуют за окончательный вариант своего наименования в ходе дебатов по законопроекту.
Македонцы проголосуют в референдуме о смене названии их страны
В воскресенье жители Македонии проголосуют о переименовании страны в «Республику Северная Македония».
Всенародное голосование призвано разрешить многолетний спор с соседней Грецией, в которой есть своя провинция Македония.
Правительство Греции давно настаивало на том, что наименование «Республика Македония» предполагает территориальные претензии на греческую провинцию, и неоднократно высказывалось против вступления своего северного соседа в Евросоюз и НАТО.
Президент Македонии Георге Иванов, противник референдума о смене названия, заявил, что не собирается признавать его результаты.
Однако сторонники референдума, в том числе премьер-министр Зоран Заев, отмечают, что изменение названия страны — это всего-навсего цена вступления в ЕС и НАТО.
Кризис в гарлемских приходах: навсегда замолкли колокола Св. Мартина
«Старожилы района, с которыми я общался, говорили, что раньше на каждом углу было по бару и по церкви», — рассказывает Адамс.
«А сейчас не осталось ни того ни другого».
Исчезновение баров еще можно понять:
«Формат общения изменился».
«Бар перестал быть своего рода гостиной всего района, куда приходили регулярно».
Но что касается церквей, беспокоит то, что средств, полученных от продажи активов, хватит ненадолго, как бы на то ни уповали их лидеры. «Рано или поздно они останутся ни с чем».
На месте церкви, добавил он, появится многоквартирный дом, чьи жильцы вряд ли будут поддерживать сохранившиеся в районе приходы.
«Большинство покупателей этих квартир будут белыми, — считает Адамс. — А это приблизит день, когда такие церкви окончательно закроются, потому что новые соседи никогда не станут их прихожанами».
Обе церкви были построены белыми конгрегациями еще до того, как Гарлем стал черным районом: Метрополитен Комьюнити в 1870 г., а церковь Св. Мартина — на 10 лет позже.
Первые прихожане методистской церкви покинули приход в 30-е годы прошлого века.
Их здание было выкуплено черным приходом, располагавшимся по соседству.
Когда церковь Св. Мартина перешла в руки черной общины, ее возглавил преподобный Джон Говард Джонсон, организовавший бойкот магазинов на 125-й улице, главной торговой артерии Гарлема, где отказывались принимать на работу или повышать по службе черных.
В 1939 году в результате пожара здание получило значительные повреждения, и в ходе восстановительных работ прихожане отца Джонсона заказали установку карильона.
Преподобный Давид Джонсон, сын отца Джонсона, сменивший его во главе церкви Св. Мартина, с гордостью называл карильон «колоколами для бедных».
Но эксперт, опробовавшая карильон в июле, назвала его иначе: «культурное наследие» и «уникальный исторический инструмент».
Эксперт из Университета Мичигана Тиффани Нг также отметила, что именно карильон из церкви Св. Мартина был первым в мире инструментом своего рода, на котором играл черный музыкант, Дионисио А. Линд. 18 лет назад его пригласили играть на более крупном карильоне в Риверсайдской церкви.
По словам Мерриуэзера, в церкви Св. Мартина до сих пор не нашли ему замену.
Последние несколько месяцев вокруг церкви Св. Мартина сложилась сложная ситуация с архитекторами и подрядчиками, некоторые из которых были приглашены светскими лидерами церкви, другие — епархией Епископальной церкви.
Собрание прихожан, руководящий орган прихода, в которых входят светские лидеры, в июле обратилось в епархию, выразив беспокойство тем, что епархия «попытается переложить стоимость работ» на собрание прихожан, хотя последние не имели отношения к выбору архитекторов и подрядчиков, направленных епархией.
Некоторые прихожане выразили недовольство отсутствием прозрачности со стороны епархии.
В Калифорнии акула ранила 13-летнего ныряльщика, промышлявшего добычей лобстеров
По сообщениям официальных источников, в субботу, первый день сезона охоты на лобстеров, в Калифорнии 13-летний ныряльщик подвергся нападению акулы и получил телесные повреждения.
Нападение произошло около 7 утра неподалеку от пляжа Бикон Бич в Энсинитасе.
Как рассказал Чед Хаммел в интервью станции KSWB-TV (Сан-Диего), в субботу утром он нырял с друзьями и примерно через полчаса услышал крики мальчика о помощи. Вместе с друзьями они подплыли на лодке к месту нападения и вытащили подростка из воды.
По словам Хаммела, сначала он решил, что мальчик громко радовался поимке лобстера, но быстро «понял, что он кричал „Меня укусили!
Меня укусили!“»
Подплыв к ныряльщику, Хаммел заметил, что «у него была полностью разорвана кожа вокруг ключицы».
«Я закричал, чтобы все выбирались из воды: „Здесь акула!“», — рассказывает Хаммел.
Мальчика вертолетом доставили в Детскую больницу Рэди (Сан-Диего); его состояние оценивается как критическое.
Вид акулы, напавшей на подростка, неизвестен.
Спасатель капитан Ларри Гайлз в ходе брифинга прессы сообщил, что несколько недель назад в этом месте была замечена акула, но ее не отнесли к опасным видам.
Гайлз также добавил, что жертва нападения получила травмы в области верхней части туловища.
Представители власти перекрыли зону от пляжа Понто в Касабладе до пляжа Свами в Энсинитасе на 48 часов, чтобы провести расследование и обеспечить безопасность населения.
Гайлз заметил, что в этой местности существует 135 видов акул, но большинство из них не считаются опасными.
Сейнсбери планирует покорить парфюмерно-косметический рынок Великобритании
Сейнсбери собирается установить отделы косметики и парфюмерии в магазинах Бутс, Супердраг и Дебенхэмс с консультантами-косметологами, по модели люксовых универмагов.
Парфюмерно-косметический рынок Великобритании оценивается в 2,8 млрд фунтов стерлингов и продолжает расширяться, тогда как в сфере моды и товаров для дома продажи падают. Для захвата значительной доли этого желанного рынка в качестве эксперимента в 11 магазинах по всей стране будут представлены просторные отделы косметики и парфюмерии, и в случае успеха в следующем году их следует ожидать во многих других магазинах.
Владельцы супермаркетов ищут чем заполнить полки, ранее отводившиеся под телевизоры, микроволновые печи, товары для дома, и инвестиции в парфюмерно-косметический рынок представляются хорошим решением.
По словам представителей Сейнсбери, планируется увеличить вдвое ассортимент косметических товаров до 3 тыс. наименований; в том числе впервые будут предложены такие марки, как Revlon, Essie, Tweezerman и Dr. PawPaw.
Существующий ассортимент от L'Oreal, Maybelline и Burt's Bees будет представлен в большем масштабе, в специально выделенных местах, по типу организации товаров в магазинах Бутс.
Кроме того, будет реорганизована фирменная линейка продуктов «Бутик-косметика» с переходом на продукты для веганов, чтобы удовлетворить запросы молодых покупательниц.
В двух магазинах Сейнсбери будут представлены киоски парфюмерного производители Fragrance Shop: первый из них уже открылся в Кройдоне на юге Лондона на прошлой неделе, а открытие второго ожидается в Селли Оук, Бирмингем, в этом году.
Интернет-торговля и тенденция покупать небольшой объем продуктов на каждый день в маленьких лавках недалеко от дома привели к тому, что супермаркеты вынуждены привлекать покупателей другими способами.
Майк Куп, президент Сейнсбери, говорит, что аутлеты постепенно превратятся в универмаги, а сеть его супермаркетов сражается за покупателей в конкурентной борьбе с дешевыми магазинами, такими как Алди и Лидл, предлагая больше услуг и непродовольственных товаров.
В сотнях супермаркетов Сейнсбери размещаются аутлеты Аргос, а в некоторых из них теперь можно найти магазины Хабитатс с тех пор, как сеть приобрела обе марки два года назад. Это привело к росту продаж продовольственных товаров и выручки за счет этих приобретений.
Предыдущие попытки супермаркета дать новую жизнь своим косметическому и аптечному отделам не увенчались успехом.
В начале 2000-х годов было организовано совместное предприятие Сейнсбери и Бутс, но в дальнейшем между участниками возникли разногласия в вопросе раздела дохода от продаж аптечных товаров в супермаркетах.
Новая стратегия была выработана после продажи фармацевтического бизнеса Сейнсбери (всего 281 магазин) компании Селесио, владельцу сети Ллойдс Фармаси, за 125 млн фунтов стерлингов тремя годами ранее.
Ожидается, что Ллойдс окажет поддержку в реализации плана, добавив широкую линейку люксовых средств по уходу за кожей La Roche-Posay и Vichy в четырех магазинах.
Говорит Пол Миллс-Хикс, коммерческий директор Сейнсбери: «Мы полностью преобразили внешний вид и атмосферу наших отделов парфюмерии и косметики, чтобы создать более благоприятную среду для наших покупателей.
Мы также пригласили специально обученных консультантов, которые всегда будут готовы помочь советом.
Наш ассортимент марок на любой вкус, приятный дизайн и удобное расположение магазинов привлекут множество посетителей в поисках косметики и парфюмерии. Это будет совершенно новая концепция похода по магазинам».
Питер Джонс «гневно» отреагировал на выход Холли Уиллоуби из сделки на 11 млн фунтов стерлингов
Звезда шоу «Логово дракона» Питер Джонс «разгневан» выходом телеведущей Холли Уиллоуби из сделки на 11 млн фунтов стерлингов, которую она предполагала заключить с лайфстайл-брендом Питера, но вместо этого предпочла новые контракты с «Маркс и Спенсер» и ITV
У Уиллоуби нет времени на их совместную марку домашней одежды и аксессуаров Truly.
Бизнес этой пары сравнивали с маркой Goop актрисы Гвинет Пэлтроу.
37-летняя ведущая программы «Этим утром» объявила о своем решении в Инстаграме.
Решение Холли Уиллоуби оставить их прибыльный лайфстайл-бренд, чтобы сосредоточиться на новых контрактах с «Маркс и Спенсер» и ITV, привело в ярость Питера Джонса, звезду «Логова дракона».
Как сообщают наши источники, Джонс был «разгневан», когда любимица телезрителей в ходе напряженного совещания, состоявшегося во вторник в штаб-квартире его бизнес-империи в Марлоу, Бакингемшир, призналась, что после заключения новых контрактов стоимостью до 1,5 млн у нее не останется достаточно времени на их общую марку домашней одежды и аксессуаров Truly.
Их марку сравнивали с детищем актрисы Гвинет Пэлтроу маркой Goop, и ожидалось, что ее продажи вдвое увеличат состояние Уиллоуби, оцениваемое в 11 млн фунтов стерлингов.
37-летняя ведущая объявила о своем уходе в Инстаграме, сам же Джонс покинул Великобританию на частном самолете в направлении одной из своих вилл.
Как сообщает один из источников, «марка Truly была главным приоритетом Холли.
Это было долгосрочное вложение, которое обеспечило бы ей беззаботное существование на следующие пару десятков лет.
Ее решение привело в ступор всех участников сделки.
Все были ошеломлены произошедшим во вторник, ведь до запуска марки оставались считанные недели.
В штаб-квартире в Марлоу остался целый склад, заполненный товарами, готовыми к продаже».
Эксперты полагают, что уход ведущей «Этим утром», одной из самых популярных звезд Великобритании, может обойтись фирме в миллионы фунтов стерлингов из-за значительных вложений в товары: от подушек и свечей до одежды, а также потенциальной задержки запуска линии.
Кроме того, речь идет о разрыве давних дружеских отношений.
Воспитывающие троих детей Уиллоуби и ее муж Дэн Болдуин дружили с Джонсом и его женой Тарой Кэпп вот уже 10 лет.
Уиллоуби создала марку Truly вместе с Тарой Кэпп в 2016 году, а муж Тары, 52-летний Питер Джонс, возглавил правление компании в марте.
Обе пары часто проводят отпуск вместе, и, кроме того, Джонсу принадлежит 40% акций фирмы по телепроизводству Дэна Болдуина.
Уиллоуби станет послом марки M&S и заменит Энтони Макпартлина в роли ведущей передачи ITV «Я — знаменитость».
Источник из близкого окружения Джонса сказал вчера вечером: «Мы не можем давать комментарии о его коммерческих делах».
Сложные переговоры, «а потом мы полюбили друг друга»
Он пошутил о критике, с которой на него обрушатся СМИ из-за «недостойного президента» комментария и положительной оценки лидера Северной Кореи.
Почему Президент Трамп отказался от стольких претензий?
Сказал Трамп, подражая голосу ведущего новостей.
«Ни от чего я не отказывался».
Он отметил, что Ким Чен Ын заинтересован в повторной встрече, после того как Трамп назвал их первый саммит, состоявшийся в Сингапуре в июне, значительным шагом на пути к сокращению запасов ядерного оружия в Северной Корее.
Но переговоры о денуклеаризации зашли в тупик.
Через три месяца после июньского саммита в Сингапуре высокопоставленный северокорейский дипломат Ли Ён Хо выступил перед мировыми лидерами на заседании Генеральной Ассамблеи ООН в субботу с заявлением о том, что Северная Корея до сих пор ждет «соответствующих ответных действий» от США после первоначальных мер КНДР по разоружению.
Вместо этого США, отметил дипломат, продолжает использовать санкции как рычаг давления.
В ходе собрания своих сторонников Президент Трамп высказал гораздо более оптимистичную оценку.
«С Северной Кореей дела обстоят замечательно», — сказал он. —
«Мы были на грани войны с Северной Кореей.
Могли погибнуть миллионы людей.
А сейчас у нас прекрасные отношения».
По словам Трампа, его усилия по налаживанию отношений с Ким Чен Ыном принесли свои плоды: был положен конец ракетным испытаниям, были освобождены заложники и остававшиеся на территории КНДР американские военнослужащие также возвратились на родину.
Говоря о своих отношениях с Ким Чен Ыном, Трамп подчеркнул, что в его необычном подходе к дипломатии нет ничего странного.
«Вести себя подобающе президенту так просто, но тогда вместо 10 тысяч человек на улице, которые рвутся в этот полностью забитый зал, здесь было бы всего 200 человек», — сказал Трамп, указывая на толпу, собравшуюся перед ним.
Цунами и землетрясение в Индонезии: зафиксированы катастрофические разрушения, жертвы исчисляются сотнями
В первые дни после землетрясения, обрушившегося на Ломбок, иностранным НГО сказали, что в их помощи нет нужды.
Несмотря на то что более 10 процентов населения Ломбока лишилось крыши над головой, правительство не сочло необходимым объявить о национальном стихийном бедствии, что является обязательным условиям для получения международной помощи.
«Во многих случаях, к сожалению, они явно дали понять, что в международной поддержке не нуждаются, поэтому было непросто», — рассказывает Селина Самбунг.
Организация «Спасем детей» готовит команду к отправке в Палу, но мы пока не знаем, сможет ли иностранная группа работать на месте.
По заявлению г-на Сутопо, официального представителя Национального управления по ликвидации последствий стихийных бедствий, руководство Индонезии проводит оценку ситуации в Палу, чтобы определить целесообразность привлечения международных организаций.
Учитывая постоянную сейсмическую нестабильность в Индонезии, страна по-прежнему ужасающе плохо подготовлена к стихийным бедствиям.
Хотя в Ачехе были построены укрытия от цунами, их редко можно встретить на других береговых линиях.
Несмотря на предупреждение об угрозе цунами, в Палу не была включена сирена для оповещения населения, что, вероятнее всего, привело к столь многочисленным жертвам.
Транспортное сообщение между многочисленными индонезийскими островами довольно проблематично даже в хорошую погоду.
Стихийные бедствия еще больше затрудняют логистику.
Плавучий госпиталь, ранее пришвартованный в Ломбоке для оказания помощи жертвам землетрясения, направляется в Палу, но дорога к месту нового бедствия займет как минимум три дня.
Президент Джоко Видодо сделал укрепление ветхой инфраструктуры Индонезии главным пунктом своей предвыборной кампании и потратил несметные средства на улучшение дорог и железных путей.
Однако администрация президента Джоко, баллотирующегося на новый срок в следующем году, погрязла в проблемах с финансированием.
Президента также критикуют за обострение межконфессиональной вражды между консервативным мусульманским большинством Индонезии и остальным населением.
Было убито свыше тысячи людей, и еще десятки тысяч лишились крова в результате стычек между христианами и мусульманами, вооруженными мачете, луками со стрелами и другими самострелами.
Видео: игрок «Ливерпуля» Дэниэл Старридж сравнивает счет в матче против «Челси» голом в дальний верхний угол ворот
Дэниэл Старридж спас «Ливерпуль» от поражения на 89-й минуте матча Премьер-лиги против «Челси», состоявшемся в субботу на стадионе «Стэмфорд Бридж».
Старридж получил пас от Джердана Шакири примерно в 27 метрах от ворот «Челси», когда его команда проигрывала со счетом 1-0.
Он сместился влево и пробил в дальний угол ворот.
Мяч пролетел высоко и очутился в дальнем верхнем угле сетки.
Голкипер Кепа Аррисабалага прыгнул в направлении мяча, но было уже поздно.
В интервью веб-сайту LiverpoolFC.com Старридж сказал: «Все дело было в том, чтобы оказаться на этой позиции и получить мяч, такие игроки, как Шак, всегда по максимуму играют на нападение, поэтому я просто стремился дать себе как можно больше времени».
«Я увидел, что ко мне направляется Канте, завладел мячом и, недолго думая, пробил по воротам».
По итогам первой половины матча, команда «Челси» вела со счетом 1-0, гол на 25-й минуте забил бельгиец Эден Азар.
Центральный нападающий «Челси», передав пас обратно Матео Ковачичу, через середину поля прорвался на половину «Ливерпуля».
На середине поля Ковачич провел игру на одно касание.
Далее он передал пас на ход Азару, который вышел на ворота.
Азар обогнал защиту и с левого фланга нанес удар в обход вратаря «Ливерпуля» Алисона Бекера, поразив дальний угол сетки.
«Ливерпуль» встретится с командой «Наполи» на групповом этапе Лиги чемпионов. Матч пройдет на стадионе «Сан-Паоло» в Неаполе (Италия) в среду в 15:00.
«Челси» сыграет с клубом «Видеотон» в матче Евролиги UEFA, который состоится в четверг в Лондоне, тоже в 15:00.
Число жертв индонезийского цунами выросло до 832 человек
Число жертв землетрясения и последовавшего за ним цунами в Индонезии достигло 832, сообщило Национальное управление по ликвидации последствий стихийных бедствий в воскресенье утром.
По сообщениям, под руинами зданий, разрушенных в результате землетрясения магнитудой 7,5 баллов по шкале Рихтера, остается немало людей. Землетрясение произошло в пятницу и вызвало цунами с волнами высотой до 6 метров, сообщил Сутопо Пурво Нугрохо, официальный представитель Управления в ходе пресс-конференции.
Город Палу с населением свыше 380 тысяч людей был завален обломками обрушившихся домов.
Полиция арестовала 32-летнего мужчину, подозреваемого в нанесении смертельных ножевых ранений женщине
Сегодня утром в городе Биркенхед графства Мерсисайд было обнаружено тело женщины. Ведется расследование убийства.
Тело 44-летней женщины с колотыми ранами было найдено в 7:55 в комплексе Грейсон Мьюз на Джон-стрит. По подозрению в убийстве арестован 32-летний мужчина.
Полиция ищет возможных свидетелей убийства среди местных жителей.
Говорит инспектор уголовной полиции O'Хейген: «Расследование находится на начальном этапе, но я убедительно прошу всех, кто был в районе Джон-стрит в Биркенхеде и мог наблюдать или слышать что-либо подозрительное, связаться с нами.
Я также обращаюсь ко всем, особенно к водителям такси, кто мог запечатлеть что-то на видеорегистратор. Просьба обратиться к нам с любой информацией, которая может помочь расследованию».
Официальный представитель полиции подтвердил, что убитая проживала в Биркенхеде и ее тело было обнаружено на территории комплекса.
Сегодня днем на место событий прибыли предполагаемые знакомые жертвы, чтобы задать свои вопросы о том, где она была обнаружена этим утром.
Ведется расследование, и полицейские готовятся известить о трагедии ближайших родственников жертвы.
Таксист, проживающий в комплексе Грейсон Мьюз, попытался пройти в свою квартиру, однако полиция сообщила ему, что никому не разрешается заходить в здание или выходить из него.
Узнав о случившемся, он потерял дар речи.
Жителям дома сообщили, что попасть домой им не удастся как минимум несколько часов.
Один из полицейских сказал жильцу, что вся прилегающая территория считается местом совершения преступления.
Одна женщина расплакалась.
«Какой ужас!», — повторяла она.
В 2 часа дня на место происшествия прибыло два полицейских автобуса, и еще один остался за пределами огороженной зоны.
Нескольких полицейских поставили внутри ограждения, чтобы наблюдать за квартирным комплексом.
Всех, кто располагает какой-либо информацией, просят отправить личное сообщение абоненту @MerPolCC в Твиттере, позвонить по номеру 101 или обратиться в организацию Crimestoppers анонимно по телефону 0800 555 111 (дело 247 от 30 сентября).
Памятник Кромвелю перед зданием парламента вызвал ожесточенную дискуссию о «переписывании истории»
«Изгнание» Кромвеля стало бы заслуженным возмездием за варварское уничтожение многочисленных культурных и религиозных артефактов Англии его последователями, пуританскими фанатиками.
Однако Общество памяти Кромвеля назвало предложение г-на Крика «сумасшествием» и «попыткой переписать историю».
Джон Голдсмит, председатель Общества памяти Кромвеля, заявил: «В рамках продолжающихся дебатов о сносе исторических памятников неизбежно возник вопрос о статуе Оливера Кромвеля перед Вестминстерским дворцом.
Кромвель не имеет никакого отношения к иконоборческому движению во время английских гражданских войн.
Вероятно, Оливер Кромвель страдает за грехи своего предка, Томаса, жившего на век раньше.
Великолепная статуя Кромвеля авторства сэра Уильяма Хамо Торникрофта отражает мнение его современников в 19-м веке и исторические достижения человека, которого многие по прежнему считают достойным уважения.
В интервью The Sunday Telegraph Джон Голдсмит заявил: «Многие люди, особенно в конце 19-го века, считали Кромвеля защитником парламента от внешнего давления, в его случае — монархии.
Можно ли считать такое мнение исторически точным, остается предметом дебатов специалистов.
Но можно с уверенностью утверждать, что конфликт, возникший в середине 17-го века, повлиял на последующее развитие нашей страны, и Кромвель был значимым историческим лицом, представлявшим одну сторону этого раздела.
Его достижения в качестве лорда-протектора также заслуживают высокой оценки и уважения».
Китайского фермера насмерть загрызла свинья-убийца
На одном из рынков юго-западного Китая фермер стал жертвой свиньи, сообщают местные СМИ.
Окровавленное тело жертвы (в СМИ упоминается только его фамилия, «Юань») с разорванной артерией обнаружили рядом с хлевом на рынке в округе Люпаньшуй провинции Гуйчжоу на юге Китая. Об этом сообщила газета Morning Post в воскресенье.
Свиновод готовится вводить прививки свиньям на свиноферме, 30 мая 2005 г., округ Синин китайской провинции Цинхай.
Юань и его двоюродный брат приехали из соседней провинции Юньнань в среду и привезли на продажу 15 свиней.
На следующее утро двоюродный брат обнаружил бездыханное тело Юаня, при этом дверь в соседний свинарник была открыта.
В свинарнике находился огромный хряк с кровью на рыле.
В ходе судебно-медицинской экспертизы было установлено, что свинья весом в 250 килограмм загрызла фермера насмерть.
«Ноги моего брата были окровавлены и искалечены», — рассказал газете Guiyang Evening News Ву, родственник убитого.
Видео с камер наблюдения показало, что Юань пришел на рынок в 4:40 утра, чтобы покормить своих животных.
Тело было найдено примерно час спустя.
Свинья-убийца не принадлежала братьям.
Менеджер рынка рассказал газете Evening News, что свинью изолировали в отдельном загоне на время следствия, во избежание повторных нападений.
Сообщается, что семья Юаня ведет переговоры с администрацией рынка о компенсации за смерть фермера.
Случаи нападений свиней на людей происходят нечасто.
В 2016 году свинья напала на женщину и ее мужа на ферме в американском штате Массачусетс, тяжело травмировав мужчину.
Десять лет назад 300-килограммовое животное пригвоздило валлийского крестьянина к трактору и отпустило, лишь испугавшись подоспевшей жены.
В 2012 году был зарегистрирован случай, когда фермер из штата Орегон в США был съеден собственными свиньями. Как рассказал каналу CBC News один канадский фермер, свиньи обычно не агрессивны, но вкус крови может действовать на их скрытую агрессию как «спусковой механизм».
«Свиньи игривы,
они кусачие и очень любопытные, но у них нет цели вас обидеть.
Вам просто следует привить своим животным чувство меры и уважения», —объяснил он.
Ураган Роза принесет ливни на значительную часть юго-запада США
Согласно прогнозу, ураган Роза теряет силу, двигаясь через зону с более прохладной водой к северному побережью Мексики.
Тем не менее, в следующие несколько дней он принесет ливни и наводнения на территорию северной Мексики и юго-запада США.
По состоянию на субботу, 5 часов утра по Нью-Йорку, циклон достиг 1-й категории с ветрами до 135 км/ч, находясь за 360 км к юго-западу от города Пунта-Эухения (Мексика).
Ожидается, что в воскресенье ураган переместится к северу.
В то же время над Тихим океаном начинает формироваться зона низкого давления, которая будет двигаться на восток к западному побережью США. Приближаясь к побережью штата Нижняя Калифорния, шторм принесет тропическую влажность к северу от Мексики, на территорию юго-запада США.
В понедельник в Мексике ожидается более 25 см осадков.
Под воздействием тропической влажности, попавшей в формирующуюся зону низкого давления, в ближайшие дни на Юго-Западе ожидаются сильные ливни.
Осадки от 2,5 до 10 см вызовут опасные ливневые паводки, грязекаменные потоки и возможные оползни в пустыне.
В некоторых районах, особенно на юге штатов Невада и Аризона, из-за высокой тропической влажности воздуха скорость выпадения осадков может достичь 5 до 8 см в час.
В отдельных районах юго-запада США, преимущественно на большей части территории Аризоны, ожидается до 5–10 см осадков.
Не исключается риск внезапных быстроразвивающихся паводков в силу неравномерного распределения тропических дождей.
При существующем риске тропического ливня пешие прогулки в пустыне чреваты серьезными последствиями.
Ливни могут превратить каньоны в бурные реки, а гром может вызвать местами порывистые ветры и поднять облака пыли.
С возникновением зоны низкого давления местами на побережье южной Калифорнии обрушатся ливни.
Возможно выпадение до 1,5 см осадков, что может вызвать небольшие грязекаменные потоки и создать скользкие поверхности на дорогах.
Это первые осадки с начала сезона дождей в регионе.
В воскресенье вечером и утром в понедельник в Аризоне местами пройдут тропические дожди, которые распространятся на другие территории к вечеру понедельника и утру вторника.
Ко вторнику ливни пройдут в районе Четырех углов и продлятся до вечера среды.
В октябре по всей территории США будут наблюдаться резкие перепады температуры, из-за низкой температуры воздуха в Арктике при достаточно высоких температурах в тропиках.
Иногда такое сочетание приводит к сильным перепадам температуры на небольшой территории.
Подобные резкие перепады температуры будут особенно заметны в центральной части США в воскресенье.
Между температурой в Канзас-Сити (штат Миссури) и в Омахе (штат Небраска), а также между Сент-Луисом и Де-Мойнз (штата Айова) существует разница почти в 20 градусов.
В течение последующих нескольких дней летняя жара будет накапливаться и распространяться на другие территории.
На большей части центральных и восточных территорий США в начале октября ожидается теплая погода, температура будет достигать 27 градусов на пространстве от Южных равнин до Северо-Востока страны.
В Нью-Йорке во вторник температура воздуха может подняться до 27 градусов, что на 10 градусов выше среднего.
Наш долгосрочный прогноз погоды обещает с большой вероятностью необычайно высокую температуру на восточном побережье США до середины октября.
Сенатские слушания по делу судьи Бретта Кавано посмотрело более 20 млн зрителей
Показания Бретта Кавано и Кристины Блази Форд, которая обвиняет Кавано в попытке изнасилования, совершенной в 1980-е годы, в четверг приковали к себе внимание свыше 20 млн зрителей шести телеканалов.
Политическое противостояние вокруг утверждения кандидатуры Кавано получило неожиданное продолжение. В пятницу в СМИ прошло срочное сообщение: республиканец Джефф Флейк выдвинул условие, чтобы обвинения в адрес юриста в течение одной недели расследовало ФБР.
Как заявила Форд на слушаниях перед Юридическим комитетом Сената, она на «100 процентов» уверена, что Кавано в состоянии опьянения напал на нее и попытался ее раздеть на школьной вечеринке.
Кавано дал эмоциональные показания, заявив, что на 100 процентов уверен в том, что этого не было.
По данным исследовательского агентства Nielsen, пятничные дебаты смотрело более 20,4 млн зрителей.
Агентство учитывало среднестатистические данные от каналов CBS, ABC, NBC, CNN, Fox News Channel и MSNBC.
Данные о количестве аудитории других каналов, таких как PBS, C-SPAN и Fox Business Network, пока не доступны.
Кроме того, рейтинг Nielsen не всегда учитывает зрителей, смотрящих телевизор на работе.
Для сравнения: речь идет о средней аудитории, следящей за матчем американского футбола в плей-оффе или церемонией вручения «Оскар».
Самая большая аудитория была у Fox News Channel, чьи ведущие горячо поддержали назначение Кавано: сенатские слушания, длившиеся весь день, посмотрело в среднем 5,69 млн зрителей, сообщило агентство Nielsen.
На втором месте — ABC с 3,26 млн зрителей.
Аудитория CBS составила 3,1 млн, NBC — 2,94 млн, MSNBC смотрели 2,89 млн зрителей, тогда как на CNN пришлось 2,52 млн просмотров, сообщает Nielsen.
После слушаний интерес к делу отнюдь не ослаб.
В пятницу разыгралась настоящая драма с участием Джеффа Флейка.
После того как сенатор от Аризоны, считающийся умеренным республиканцем, сообщил о своем намерении поддержать кандидатуру Кавано, телеканалам CNN и CBS удалось запечатлеть на камеру, как в пятницу утром по пути на заседание Юридического комитета Флейк столкнулся в лифте с группой активисток, обрушивших критику на сенатора.
Весь мир видел, как он, опустив глаза, получает взбучку от разгневанных женщин в прямом эфире по CNN.
«Я стою перед вами», — сказала одна из них.
«Вы думаете, что он говорит стране правду?»
«За вами сила, в то время как столь многие женщины бессильны», — пытались объяснить свою позицию женщины.
Флейк ответил активисткам, что его офис уже подготовил заявление и он выскажется на эту тему на заседании комитета. Двери лифта закрылись, скрыв сенатора от вездесущих камер.
Когда спустя несколько часов Юридический комитет готовился утвердить кандидатуру Кавано на пост судьи и отправить ее в Сенат на общее голосование, все телеканалы каналы транслировали заседание в прямом эфире.
Однако Флейк поставил одно условие — проведение расследования ФБР по данным обвинениям против кандидата к следующей неделе, как того добивалось демократическое меньшинство.
Флейк утверждает, что изменил свое мнение благодаря вмешательству друга, сенатора от демократов Криса Кунса.
Он принял окончательное решение, поговорив с Кунсом и еще несколькими сенаторами.
Решение Флейка возымело эффект, так как было очевидно, что республиканцам не хватает голосов для утверждения Кавано без проведения расследования.
Указом Президента Трампа ФБР открыло расследование обвинений в адрес Кавано.
Премьер-министр Великобритании Тереза Мэй обвиняет своих критиков в «политических играх» вокруг ситуации с Брекситом
В интервью газете Sunday Times премьер-министр Тереза Мэй обвинила политиков, критикующих ее план покинуть Евросоюз, в том, что они ставят узкопартийные интересы выше интересов общества.
Премьер-министр Великобритании прибывает на конференцию консервативной партии в Бирмингеме 29 сентября 2018 г.
В другом интервью, опубликованном на одной полосе с интервью Мэй, бывший глава МИД Борис Джонсон раскритиковал ее так называемый план «Шашки» в рамках Брексита, заявив, что считает ввод таможенных пошлин между Великобританией и ЕС «абсолютно нелепым».
Смерть Уэйда Симса в перестрелке: Полиция арестовала Дайтеона Симпсона по подозрению в убийстве форварда Университета штата Луизиана
Полиция арестовала мужчину, подозреваемого в убийстве в результате перестрелки Уэйда Симса, 20-летнего баскетболиста, игравшего за Университет штата Луизиана.
Как сообщила полиция Батон-Ружа, 20-летний Дайтеон Симпсон был арестован и помещен под стражу по обвинению в убийстве второй степени.
Полиция опубликовала видеозапись драки с участием Симса и Симпсона, в которой Симс потерял свои очки.
По информации WAFB, регионального канала CBS, полиция обнаружила ДНК Симпсона на очках, найденных на месте преступления.
В ходе допроса Симпсон признался, что смертельно ранил Уэйда.
По информации издания Advocate, для Симпсона установлен залог в размере 350 тыс. долларов.
Коронер восточного округа Батон-Ружа в пятницу опубликовал предварительное заключение: смерть была вызвана сквозным сочетанным огнестрельным ранением шеи и головы.
Отдел приносит благодарность отделу уголовного розыска полиции штата Луизиана, лаборатории криминалистики полиции штата, полиции Южного университета и местным жителям, помогавшим в проведении оперативно-розыскных мероприятий, приведших к задержанию.
Джо Аллева, директор по спорту Университета штата Луизиана, поблагодарил силы правопорядка за их «добросовестную работу по поимке преступника».
Симсу было всего 20 лет.
Двухметровый форвард был уроженцем Батон-Ружа; его отец Уэйн также играл в команде Университета штата Луизиана.
В минувшем сезоне Симс набирал 5,6 очка и делал 2,6 подбора в среднем за матч.
Тренер команды Уилл Уэйд выступил с заявлением в пятницу утром, сказав, что трагическая смерть Уэйда Симса вызвала «шок» и «настоящее горе» у всех игроков.
«Это то, чего я всегда боялся», — добавил тренер.
Вулкан покрыл пеплом Мехико
Вулкан Попокатепетль засыпал пеплом южные окрестности мексиканской столицы.
В субботу Национальный центр по предотвращению стихийных бедствий Мексики рекомендовал населению не приближаться к вулкану: в его кратере была зарегистрирована активность и за сутки было произведено 183 парогазовых выброса.
По наблюдениям Центра, вблизи вулкана часто раздавался грохот и ощущалось дрожание.
В некоторых районах Мехико, таких как Сочимилько, пользователи социальных сетей публиковали фотографии лобовых стекол автомобилей, покрытых тонким слоем пепла.
После землетрясения магнитудой 7,1 Mw, потрясшего центральную часть Мексики в сентябре 2017 г., геофизики зафиксировали участившуюся вулканическую активность в 72 км к юго-востоку от столицы.
Вулкан Попокатепетль (или, для своих, «Дон Гойо») является действующим вулканом с 1994 г.
Столкновения полиции с каталанскими сепаратистами в преддверии первой годовщины референдума о независимости
В субботу в Барселоне прошел многотысячный митинг, посвященный первой годовщине референдума о выходе Каталонии из состава Испании, расколовшего страну на два лагеря. Не обошлось без столкновений между сторонниками независимости автономии и полицейскими; шестеро участников беспорядков попали под стражу.
Сотрудники полиции оттесняли протестующих сторонников независимости, тогда как последние, облаченные в черные маски, забрасывали стражей порядка яйцами и порошковой краской, поднимая облака темной пыли в самом центре Барселоны.
После того как полиция пустила в ход дубинки для сдерживания толпы, беспорядки возобновились с новой силой.
В течение нескольких часов сторонники независимости скандировали: «Не забудем, не простим!», а их оппоненты отвечали им лозунгом: «Да здравствует Испания!».
По сообщениям местной прессы, четырнадцать участников акции попали в больницу с легкими ранениями.
1 октября прошлого года был проведен референдум о выходе Каталонии из состава Испании. Он был признан незаконным испанским правительством, но стал важной вехой для сепаратистов. Год спустя в стремящемся к суверенитету регионе сохраняется напряжение.
Каталония с огромным перевесом проголосовала за выход из состава Испании, но явка была низкой из-за того, что противники выхода преимущественно бойкотировали референдум.
По сообщениям каталонских официальных источников, в прошлом году при попытках полиции блокировать проведение референдума на избирательных участках страны в ожесточенных столкновениях почти 1000 человек получили ранения.
В пятницу сепаратисты заночевали на заявленном пути следования демонстрации в поддержку испанской полиции, чтобы помешать ее проведению.
Демонстрация все равно состоялась, но прошла по другому маршруту.
68-летний электрик Нарсис Термес, посетивший митинг сепаратистов в компании своей жены, сетует на то, что надежда о приобретении Каталонией суверенитета становится все более зыбкой.
«В прошлом году произошло одно из самых важных событий в нашей жизни.
Мои родители плакали от счастья, получив возможность проголосовать в референдуме, а сегодня мы находимся в подвешенном состоянии», — говорит он.
На недавних декабрьских выборах в местные органы управления каталонские партии, выступающие за отделение от Испании, одержали важную победу, хоть и с небольшим отрывом. Однако в этом году их движение теряет сторонников, поскольку многие из известных лидеров движения находятся либо в бегах, либо под стражей, ожидая суда за их роль в организации референдума и последующего объявления независимости.
Хоан Пуч, 42-летний механик, записывающий на телефон митинг в поддержку полиции, сказал, что конфликт подогревается обеими сторонами политического спектра.
«Растет напряжение», — добавил он.
В субботу Ориол Жункерас, один из девяти лидеров каталонских сепаратистов, с конца прошлого года находящихся в камере предварительного заключения, заявил о своем намерении в следующем году баллотироваться в Европейский парламент.
«Участие в очередных выборах в Европейский парламент в качестве кандидата — лучший способ осудить потерю демократических ценностей и репрессии со стороны испанского правительства», — говорит он.
Лондондерри: машина врезалась в дом, все трое соучастников арестованы
Один из домов в Лондонберри был несколько раз протаранен автомобилем; находившиеся в нем мужчины в возрасте 33, 34 и 39 лет были взяты под арест.
Наезд был совершен в четверг около 19:30 по местному времени в районе Баллинагард Кресент.
В результате тарана были повреждены ворота и само здание, сообщает инспектор уголовной полиции Боб Блеммингс.
Есть сообщения о том, что в машину мог быть произведен выстрел из лука.
Победа «Ливингстона» над «Рейнджерс» благодаря меткому голу Менги
Первый гол Долли Менги принес гарантированную победу команде «Ливингстон»
Благодаря забитому мячу «Ливингстон» одержал неожиданную победу над «Рейнджерс». Для главного тренера шотландского клуба, Стивена Джеррарда, это всего лишь второе поражение за 18 игр.
Точный удар Долли Менги уравнял команду Гари Холта с клубом «Хиберниан» в зачетной таблице, где они делят второе место.
Клуб Джеррарда остался без победы на выезде в этом сезоне Премьер-лиги. В воскресенье им предстоит встреча с лидерами группы, «Хартс», от которых «Рейнджерс» отстают на восемь очков.
В четверг «Рейнджерс» проведут на своем поле матч Лиги Европы с австрийским клубом «Рапид» (Вена).
Клуб «Ливингстон» продолжает свою беспроигрышную серию в дивизионе, отыграв уже шесть матчей и не получив ни одного поражения с тех пор, как Холт сменил Кенни Миллера на посту главного тренера команды.
Упущенные моменты для «Ливингстона» в схватке с напористыми гостями
Подопечные тренера Холта должны были вести счет с самого начала — «рейнджеры» явно не справлялись с их напором.
Скотту Робинсону удалось прорваться через линию защиты, но гола из его слабой попытки не вышло. Затем защитник Алан Литгоу, замахнувшись слишком широко, не смог помешать мячу Кэйга Халкетта попасть в сетку.
Принимающая сторона позволила «Рейнджерс» разыграться перед их линией защиты, рассчитывая на опасные моменты при возобновлении игры.
Именно так они и пропустили этот важный гол.
«Рейнджерс» уступили свободный удар, и «Ливингстон» воспользовался возможностью: Деклан Галлагер и Робинсон сделали передачу Менге, который забил из центрального положения.
К тому моменту «Рейнджерс» имели превосходство во владении мячом, но защита принимающей команды была непробиваемый, поэтому вратарь Лиам Келли не был обеспокоен.
Второй тайм продолжался по той же схеме, хотя Келли все же пришлось отбить удар от Альфредо Морелоса.
Вратарь «Рейнджерс» Аллан Макгрегор ногой отбил мяч от Скотта Питтмана, а Литгоу сделал широкую подачу из стандартного положения.
Мячи постоянно попадали в штрафную «Ливингстона», но все атаки были отражены, а два требования пенальти — одно за провоцирование запасного игрока Гленна Миддлтона Халкеттом и второе за игру рукой — не были удовлетворены.
«Феноменальная» игра «Ливингстона» — анализ
От BBC Scotland — Аласдер Ламонт, репортаж со стадиона «Тони Макарони Арена»
Феноменальная игра и отличный результат для команды «Ливингстон».
Абсолютно все игроки были великолепны и в очередной раз превзошли все ожидания, продолжая свое восхождение на футбольный Олимп.
Их стиль игры и состав практически не изменились с момента их восхождения к верхним строчкам рейтинга, и большая заслуга тренера Холта в том, что он с самого начала мобилизовал эту команду.
В его команде было немало настоящих героев.
Капитан Халкетт руководил великолепно организованной защитой, а Менга не давал расслабиться Коннору Голдсону и Джо Уораллу.
При этом «Рейнджерс» никак не могли войти в ритм.
Хотя у них случались хорошие игровые моменты с тренером Джеррардом, в этом раз они не оправдали наших ожиданий.
В последние минуты матча им не хватало владения мячом, а пройти защиту принимающей команды им удалось лишь однажды. «Рейнджерс», опустившимся на середину таблицы, есть о чем задуматься.
Прохладный прием Эрдогана в ходе визита в Кельн
В субботу, 29-го сентября, когда лидеры Турции и Германии встретились за завтраком, стояла прекрасная погода, и оба высших лица были в отличном настроении.
Это был последний день визита президента Эрдогана в Германию с целью наладить отношения между двумя странами-участниками НАТО — визита, и без того сопряженного с некоторыми конфликтами.
Главам стран не удалось найти понимание по таким вопросам, как права человека, свобода печати и вступление Турции в ЕС.
После Эрдоган направился в Кельн, чтобы принять участие в церемонии открытия огромной новой мечети.
В Кельне проживает самая большая турецкая диаспора за пределами Турции.
Из соображений безопасности полиция не подпустила 25-тысячную толпу к входу в мечеть, но многие сторонники Эрдогана расположились неподалеку, чтобы увидеть своего президента.
В том же месте собрались и противники режима Эрдогана, в том числе курды, чтобы в полный голос осудить как политику Эрдогана, так и решение немецкого правительства пригласить его с визитом в Германию.
Наличие радикально противоположных точек зрения на встрече отражает неоднозначную сущность этой фигуры: многие немцы с турецкими корнями превозносят Эрдогана, тогда как другие считают его тираном.
Авария на дорогах Дептфорда: столкновение с машиной привело к смерти велосипедиста
В Лондоне автомобиль столкнулся с велосипедистом, который скончался на месте происшествия.
Авария случилась неподалеку от Бествуд-стрит и Эвелин-стрит, оживленного перекрестка в юго-восточной части города Депфорт, примерно в 10:15 по местному времени.
Водитель машины и прибывшие на место санитары пытались оказать помощь велосипедисту, но мужчина скончался не приходя в сознание.
Это не единственная авария со смертельным исходом в данном районе: всего в полутора километрах от места происшествия, на улице Чайлдерс-стрит, другой велосипедист был сбит автомобилем, водитель которого скрылся.
Лондонская полиция сообщает, что в настоящее время ведется работа по установлению личности погибшего и извещению его ближайших родственников.
А пока на месте происшествия перекрыты дороги и изменен маршрут автобусов: автомобилистов просят не заезжать в этот район.
Беспорядки в тюрьме Лонг-Лартин: ранено шестеро полицейских
По сообщениям администрации Лонг-Лартина, в ходе беспорядков, учиненных в мужской тюрьме строгого режима, было ранено шестеро полицейских.
В мужской тюрьме строгого режима Лонг-Лартин (Вустершир) с воскресенья продолжаются беспорядки, завязавшиеся около 09:30 по местному времени.
Для подавления беспорядков, в которых участвует восемь заключенных из одного крыла, была вызвана опергруппа «Торнадо».
Полицейские получили незначительные повреждения мягких тканей лица; им была оказана медицинская помощь на месте.
По заявлению официального представителя тюрьмы, «для разрешения инцидента в исправительном учреждении Лонг-Лартин были привлечены специально обученные сотрудники.
Шестеро из них получили травмы.
Мы категорически порицаем применение физической силы в нашем учреждении, и очевидно, что виновники будут переданы в руки полиции и их мера пресечения может быть изменена на более длинный срок».
В Лонг-Лартине в настоящее время содержится свыше 500 заключенных, в том числе одни из самых опасных преступников в стране.
В июне в СМИ появилось сообщение о том, что управляющий тюрьмы попал в больницу, подвергшись нападению одного из заключенных.
А в октябре прошлого года руководство тюрьмы было вынуждено привлечь подразделения особого назначения, чтобы успокоить разбушевавшихся заключенных, бросавших бильярдные шары в надзирателей.
Ураган Роза может затопить Феникс, Лас-Вегас и Солт-Лейк-Сити (что пойдет на пользу засушливым территориям)
Аризона редко попадает в зону прохождения интенсивного тропического циклона, но в этот раз ей «повезло»: в начале следующей недели ураган Роза, сделав последний рывок, должен пройти над пустынной частью Юго-Запада и принести с собой риск ливневых паводков.
Национальная метеорологическая служба уже предупреждала об угрозе ливневых паводков в понедельник и вторник в западной Аризоне и южной и восточной части штата Невада, на юго-востоке Калифорнии и Юты, в том числе в таких городах, как Феникс, Флагстафф, Лас-Вегас и Солт-Лейк-Сити.
Ожидается, что ураган Роза пройдет по прямой линии над Фениксом во вторник и прольется ливнем в понедельник вечером.
Бюро Национальной метеорологической службы в Фениксе сообщило в Твиттере о том, что всего «десять тропических циклонов сохраняли статус тропического шторма или депрессии, находясь в радиусе 320 км от Феникса, с 1950 года.
Ураган Катрина (в 1967 г.) прошел в 65 км от границы Аризоны».
По последним прогнозам Национальной метеорологической службы, выпадет от 5 до 10 см осадков, местами достигая 15 см на аризонском плато Могольон-Рим.
В других пустынных регионах Юго-Запада, таких как центральные Скалистые горы и Большой Бассейн, возможно выпадение до 2,5–5 см осадков, местами осадки могут достигать 10 см.
Для зон, которых ливневые потоки обойдут стороной, дождь, принесенный ураганом Роза, может стать настоящим благословением, ведь регион давно страдает от засухи.
Хотя ливневые паводки могут представлять опасность, обильные дожди могут облегчить засушливый сезон, не проходящий на Юго-Западе США.
Согласно картам U.S. Drought Monitor, на более чем 40% территории Аризоны наблюдается как минимум сильная засуха (второй по тяжести категории)», — сообщает веб-сайт weather.com.
Сначала ураган Роза обрушится на мексиканский штат Нижняя Калифорния.
По состоянию на воскресное утро, ураган, максимальная скорость которого составляет 137 км/ч, находится за 360 км к югу от города Пунта-Эухения (Мексика) и движется на север со скоростью 19 км/ч.
Ураган оказался в зоне с более прохладной водой на тихоокеанском побережье и таким образом теряет свою силу.
Во второй половине дня ураган достигнет Мексики в категории «тропический шторм».
Ожидается, что в отдельных районах Мексики пройдут обильные ливни с угрозой наводнений.
«На территории от Нижней Калифорнии до северо-запада Соноры может выпасть до 7–10 см осадков, местами до 25 см», — сообщает веб-сайт weather.com.
Далее ураган Роза направится на север через территорию Мексики и ранним утром во вторник дойдет до границы с Аризоной в категории тропического циклона. От Аризоны он дойдет до южной части штата Юта к вечеру вторника.
«Основной потенциальный риск, сопряженный с ураганом Роза и его остатками, связан с сильными ливнями в Нижней Калифорнии, в северо-западной части Соноры и в пустынных районах юго-запада США», — сообщает Национальная метеорологическая служба.
Ожидается, что осадки вызовут опасные ливневые паводки, грязекаменные потоки в пустыне и возможные оползни в горных районах.
Нападение в Мидсомер Нортоне: задержаны четверо подозреваемых в покушении на убийство
В Сомерсете 16-летний подросток получил тяжелые ножевые ранения. По подозрению в покушении на убийство задержаны трое подростков и 20-летний юноша.
Жертву покушения с тяжелыми ранениями обнаружили в районе Эксельсиор Террас города Мидсомер Нортон около 4 часов утра в субботу.
После госпитализации его состояние оценивается как «стабильное».
В тот же вечер в районе Радсток были арестованы четверо подозреваемых в возрасте 17, 18 и 20 лет, сообщает полиция округа Эйвон и Сомерсет.
Полиция ищет возможных свидетелей преступления, обладающих любыми видеозаписями происшедшего на мобильный телефон.
Дональд Трамп: «На Кавано „обрушилась вся ненависть, вся злоба“ демократов»
«Голос за судью Кавано — это голос против безжалостной и возмутительной тактики, применяемой демократами», — заявил Трамп на митинге своих соратников в Уилинге, штат Западная Вирджиния.
По мнению Трампа, в процессе утверждения номинации Кавано на кандидата «обрушилась вся ненависть, вся злоба» Демократической партии.
В четверг Кавано дал показания в Конгрессе США, в своем эмоциональном обращении категорически отвергнув обвинение Кристины Блази Форд в том, что он сексуально домогался ее более 30 лет назад, когда оба были подростками.
Доктор Форд также дала показания в ходе слушания по ее обвинению.
В субботу президент США сказал, что в тот день «американский народ увидел блестящий ум, класс и мужество» Кавано.
«Голос за утверждение судьи Кавано — это голос за утверждение одного из самых выдающихся юристов нашего времени, с незапятнанным государственным послужным списком», — объявил президент толпе своих соратников в штате Западная Вирджиния.
В своей речи президент косвенно затронул вопрос о номинации Кавано, говоря о важности явки республиканцев на выборы в Конгресс и Палату представителей.
«До самых важных выборов в нашей жизни остается всего пять недель.
Я в них не участвую, но зато участвую в гонке в другом смысле», — сказал он.
«Я ношусь как угорелый и борюсь за наших отличных кандидатов».
Трамп считает, что демократы поставили себе задачу «всеми силами оказывать нам сопротивление».
По регламенту, первое ключевое голосование в Сенате по утверждению кандидатуры Кавано должно состояться не позднее пятницы, сообщил помощник высокопоставленного представителя Республиканской партии.
Землетрясение в Индонезии унесло сотни жизней, и общее число жертв продолжает расти
В субботу индонезийские власти объявили, что погибло как минимум 384 человека, многих унесло гигантскими волнами, захватившими пляжи индонезийского острова Сулавеси, на который обрушился невероятной силы цунами и землетрясение.
Первыми жертвами стихии стали сотни гостей пляжного фестиваля в городе Палу. В пятницу на закате побережье настигли волны высотой почти шесть метров, которые смели все на своем пути и привели к мгновенной смерти многих из присутствующих.
Цунами последовал за землетрясением магнитудой 7,5 по шкале Рихтера.
«Когда вчера было объявлено штормовое предупреждение, люди продолжали свой пляжный отдых, вместо того чтобы сразу же бежать в укрытие, и из-за этого потеряли жизнь», — сообщил Сутопо Пурво Нугрохо, официальный представитель индонезийского Национального управления по ликвидации последствий стихийных бедствий в ходе пресс-конференции, состоявшейся в Джакарте.
«Цунами не пришло одно, в потоке воды были машины, бревна, целые дома, стихия разрушила все на своем пути», — объяснил Нугрохо, добавив, что цунами пересекло океан со скоростью 497 км/ч и со всей силой обрушилось на побережье.
Некоторые из присутствующих забрались на деревья, что спасло им жизнь.
Примерно 16 700 местных жителей было эвакуировано в 24 убежища в Палу.
На аэрофотосъемке управления по ликвидации последствий стихийных бедствий видны разрушенные дома, магазины, обрушившиеся мосты и затопленная мечеть.
В субботу прибрежный город все еще сотрясали подземные толчки.
Серия землетрясений произошла на территории с населением 2,4 млн человек.
В заявлении Агентства по оценке и использованию технологий Республики Индонезия (BPPT) указывается, что спровоцированный землетрясением выброс энергии оказался примерно в 200 раз больше, чем при взрыве атомной бомбы, уничтожившем Хиросиму.
Возможно, цунами оказалось сильнее, чем ожидалось, за счет географического положения города, расположенного в конце длинного узкого залива.
Нугрохо назвал ущерб «масштабным», добавив, что разрушению подверглись тысячи домов, больниц, торговых центров и гостиниц.
Под руинами обрушившихся зданий были обнаружены тела погибших; всего травмы получили 540 человек, и еще 29 числятся пропавшими.
Нугрохо добавил, что жертвы и разрушения могут быть еще более значительными вдоль побережья к 300 км от Палу, в местечке Дунгала, которое оказалось ближе к эпицентру землетрясения.
Коммуникации с Дунгала были «полностью разрушены, не поступало никакой информации».
«В районе Дунгала проживает свыше 300 тыс. человек», — сообщает в своем коммюнике Международный Комитет Красного Креста, чьи сотрудники и волонтеры уже направились в зону бедствия.
«Произошла трагедия, но это еще не предел», — говорится в сообщении.
В субботу Управление подверглось жесткой критике, поскольку вовремя не сообщило о приходе цунами в Палу. Власти, однако, полагают, что волны достигли побережья в тот момент, когда первоначальное предупреждение было еще в силе.
В социальных сетях появилось любительское видео, в котором мужчина на верхнем этаже здания кричит о надвигающемся цунами, отчаянно пытаясь привлечь внимание людей на улице.
Через несколько минут на берег обрушивается стена воды, унося с собой целые дома и машины.
Агентству Reuters пока не удалось подтвердить авторство этого ролика.
Землетрясение и цунами привели к крупному обесточиванию электролиний, из-за чего в Палу пропала связь. Это весьма затруднило спасательные операции служб.
Из Джакарты и других городов были отправлены военные транспортные самолеты с гуманитарной помощью, но эвакуированному населению по-прежнему не хватает пищи и предметов первой необходимости, сообщают правительственные источники.
Аэропорт города был открыт только для получения гуманитарной помощи; он будет закрыт для других полетов до октября.
В воскресенье эвакуационные центры в Палу посетит президент Джоко Видодо.
Число жертв цунами в Индонезии превышает 800.
Ситуация очень плохая.
Волонтеры благотворительной организации World Vision благополучно прибыли из Дунгалы в Палу, где сотрудники нашли укрытие в брезентовых палатках, разбитых во дворе их офисного здания. По словам Досебы Синай, по дороге их глазам предстала ужасающая картина полного разрушения.
«Они видели огромное множество разрушенных домов», — рассказывает он.
Ситуация очень плохая.
Благотворительные организации начали приводить в действие механизмы оказания гуманитарной помощи, но многие жалуются на то, что специалистам из международных НКО не удалось попасть в Палу.
Индонезийское законодательство разрешает привлечение финансирования, гуманитарной помощи и сотрудников иностранных организаций только после объявления места, где ударила стихия, зоной национального стихийного бедствия.
Этого пока не случилось.
«Считается, что речь идет о локальном бедствии», — сообщает Аулия Ариани, пресс-секретарь Индонезийского Красного Креста.
«Как только правительство объявит стихийное бедствие национальным, мы сможем принимать иностранную помощь, но пока что статус остается неизменным».
На второй день после природной катастрофы, потрясшей Палу, друзья и родственники людей, числящихся пропавшими, все еще надеются на их чудесное спасение, которое вернет населению веру в лучшее.
В субботу был спасен маленький мальчик, упавший в канализационный люк.
В воскресенье спасатели извлекли из-под обломков здания женщину, которая провела там два дня, рядом с бездыханным телом своей матери.
Гендон Субандоно, тренер национальной сборной Индонезии по парапланеризму, подготовил двоих из пропавших без вести пилотов к недавно прошедшим в Индонезии Азиатским играм.
Среди других людей, попавших в ловушку в отеле Роа Роа, были его ученики, в том числе и Мандаги.
«В этом спорте я не последний человек, и эмоционально это сложно пережить», — сказал он.
Гендон вспоминает, как, узнав об обрушении отела Роа Роа от других парапланеристов, в течение следующих часов он отчаянно пытался связаться по WhatsApp со своими коллегами из Палу, отдыхающими на пляжном фестивале.
Однако его сообщения отображались с одной серой галочкой, а не двумя голубыми.
«Это означает, что сообщения не доставлялись», — считает он.
Дерзкая кража 26 750 долл. во время обслуживания банкомата в городе Ньюпорт-он-Ливи
В пятницу утром злоумышленники похитили 26 750 долларов у инкассатора Brink's, заправляющего один из банкоматов в городе Ньюпорт-он-Ливи, говорится в пресс-релизе ньюпортской полиции.
Как сообщает следователь Деннис Маккарти, водитель бронированного микроавтобуса забирал наличность из банкомата, расположенного в развлекательном комплексе, и собирался заправить его новыми банкнотами.
В это время «к сотруднику Brink's со спины подбежал злоумышленник» и выкрал мешок с банкнотами для заправки банкомата.
По сообщениям свидетелей происшествия, с места преступления бежало несколько подозреваемых, но полиция не указала число потенциальных участников.
Граждан, располагающих какой-либо информацией об этих личностях, просят обратиться в ньюпортское отделение полиции по номеру 859-292-3680.
Канье Уэст: рэппер сменил имя на Йе
Рэппер Канье Уэст придумал себе новое имя: Йе.
Об этом он объявил в субботу в Твиттере: «Личность, ранее известная как Канье Уэст».
41-летний Уэст уже давно носит это псевдоним и даже поставил его в название своего восьмого альбома, который вышел в июне.
Новость об этом появилась в преддверии появления Канье в передаче Saturday Night Live, где он планирует представить свой новый альбом Yandhi.
Канье Уэст выступит соведущим вместо певицы Арианы, которая отменила свое участие по причине «эмоциональных переживаний», сообщает автор передачи.
Уэст ранее заявлял о том, что псевдоним не только является сокращенным вариантом его имени, но и несет к себе религиозный смысл.
«Ye — наиболее часто встречающееся слово в Библии, оно значит „ты“, „вы“», — так Уэст объяснял название своего альбома в одном из недавних интервью радиоведущему Биг Бою.
«То есть я — это ты, я — это мы.
Сначала был Канье, что значит „единственный“, а теперь я — всего лишь Йе, то есть отражение всего хорошего, плохого, непонятного в нас, всего сразу.
И альбом — это попытка осмыслить, кто же мы такие».
Канье не первый известный рэппер, решивший сменить имя.
Шон Комбс, раньше известный как Пафф Дэдди, Пи Дидди или просто Дидди, в этом году попросил называть себя Лав («любовь») или Браза Лав («Братская Любовь» или «Брат Любовь»).
Выступавший с Уэстом рэппер Джей-Зи тоже несколько раз менял написание своего имени: с дефисом и без, прописными буквами или строчными.
Президент Мексики торжественно обещает не применять военные силы против гражданского населения
Президент Мексики Андрес Мануэль Лопес Обрадор поклялся никогда не прибегать к военной силе против гражданского населения в преддверии 50-й годовщины студенческой демонстрации, закончившейся кровопролитным столкновением.
Выступая в субботу на площади Тлателолько, Президент Лопес Обрадор пообещал «никогда не прибегать к помощи армии для подавления мексиканского народа».
На этом месте 2 октября 1968 г. во время мирной демонстрации студентов раздались первые выстрелы по толпе и началась резня, унесшая жизни 300 человек. Это происходило на фоне усиления левых студенческих движений в Латинской Америке.
Лопес Обрадор также пообещал поддержку мексиканской молодежи в виде ежемесячной стипендии на учебу и открытия большего числа бесплатных государственных университетов.
По его словам, безработица и отсутствие перспектив учебы приводят молодежь прямиком в преступный мир.
США необходимо удвоить финансирование разработок ИИ
Не следует недооценивать Китай и его усилия в области искусственного интеллекта (ИИ) — США должны удвоить инвестиции в свои научные разработки, считает Ли Кайфу, инвестор и предприниматель в области разработок ИИ с опытом работы в Google, Microsoft и Apple.
Ранее заявления о работе над ИИ сделали несколько американских министерств, хотя в целом США не обладают четкой стратегией в области разработок ИИ.
В то же время Китай представил собственный план еще в прошлом году: его цель — стать первыми в инновациях ИИ к 2030 г.
«Увеличение бюджета на исследования в области ИИ в два раза было бы хорошим началом, учитывая, что все другие страны намного отстают от США, и мы ожидаем следующего прорыва в области ИИ», — говорит Ли.
Увеличение финансирования в два раза может удвоить шансы на то, что следующее большое достижение ИИ будет сделано в США, сказал Ли CNBC в интервью на этой неделе.
Ли, чья книга ««Сверхдержавы искусственного интеллекта: Китай, Кремниевая долина и новый мировой порядок» была опубликована в этом месяце издательством Houghton Mifflin Harcourt, является генеральным директором Sinovation Ventures, которая инвестировала в одну из самых выдающихся компаний ИИ в Китае, Face ++.
В 1980-х годах в Университете Карнеги-Меллона он работал над системой искусственного интеллекта, которая превзошла самого высокого игрока в американском Отелло, а затем он был руководителем в Microsoft Research и президентом китайского филиала Google.
Ли упомянул предыдущие правительственные технологические конкурсы США, например, Robotics Challenge агентства Defense Advanced Research Projects, и поинтересовался, когда состоится следующий конкурс, чтобы помочь найти людей с нетрадиционным мышлением.
По словам Ли, исследователям в США часто приходится много работать, чтобы получать правительственные гранты.
«Не Китай поглощает академических лидеров, а корпорации», — убежден Ли.
Facebook, Google и другие технологические компании нанимают в последние годы светил из университетов для работы над искусственным интеллектом.
Ли убежден, что изменения в иммиграционной политике могут также помочь США в развитии искусственного интеллекта.
«Я думаю, что грин-карты должны автоматически предлагаться кандидатам в области искусственного интеллекта», — говорит он.
В июле 2017 года Государственный совет Китая опубликовал план развития искусственного интеллекта следующего поколения.
Китайский национальный фонд естественных наук выделяет ученым финансирование аналогично тому, как Национальный научный фонд и другие правительственные организации выделяют деньги американским исследователям, но качество научной работы в Китае ниже, утверждает Ли.
Ранее в этом году Министерство обороны США создало Объединенный центр искусственного интеллекта, в работе которого должны участвовать партнеры из промышленности и научных кругов, а Белый дом объявил о создании Специального комитета по искусственному интеллекту.
В этом месяце DARPA объявила об инвестировании 2 миллиардов долларов в программу под названием AI Next.
Что касается NSF, то в настоящее время он инвестирует более 100 миллионов долларов в год в исследования ИИ.
Между тем, законодательство США, которое стремилось создать Комиссию национальной безопасности по искусственному интеллекту, уже несколько месяцев не принимает никаких мер в этом направлении.
Македонцы голосуют на референдуме о том, стоит ли менять название страны
Народ Македонии в воскресенье проголосовал на референдуме по вопросу о том, следует ли сменить название своей страны на «Республика Северная Македония», что позволило бы разрешить многолетний спор с Грецией, который заблокировал ее заявки на вступление в Европейский Союз и НАТО.
Греция, в составе которой есть провинция Македония, утверждает, что имя ее северного соседа представляет собой претензию на ее территорию, и наложила вето на его вступление в НАТО и ЕС.
В июне оба правительства заключили соглашение, основанное на предложении нового названия, но оппоненты-националисты утверждают, что это изменение подорвало бы этническую самобытность славянского большинства населения Македонии.
Президент Георге Иванов заявил, что не будет голосовать на референдуме, и кампания бойкота поставила под сомнение вопрос о том, будет ли явка избирателей соответствовать минимуму в 50 процентов, необходимому для проведения референдума.
Вопрос, вынесенный на референдум, был сформулирован следующим образом: «Поддерживаете ли вы членство в НАТО и ЕС при условии принятия договора с Грецией?».
Сторонники смены имени, в том числе премьер-министр Зоран Заев, утверждают, что Македонии, одной из стран, появившихся после распада Югославии, стоит заплатить эту цену за вступление в такие организации, как ЕС и НАТО.
«Я пришла сегодня, чтобы проголосовать за будущее страны, за молодежь Македонии, чтобы она могла свободно жить под эгидой Европейского Союза, потому что это означает более безопасную жизнь для всех нас», — рассказывает 79-летняя Оливера Георгиевская, жительница Скопье.
Достаточное количество членов парламента заявили, что будут соблюдать итоги голосования, чтобы сделать его решающим, хотя оно и не имеет обязательной юридической силы.
Изменение названия потребует большинства в две трети голосов членов парламента.
Государственная избирательная комиссия заявила, что к 13:00 сообщений о нарушениях не поступало.
Однако явка составила всего 16 процентов по сравнению с 34 процентами на последних парламентских выборах в 2016 году, когда проголосовали 66 процентов зарегистрированных избирателей.
«Я пришел голосовать ради своих детей, наше место в Европе», — говорит 62-летний Йосе Таневски, избиратель из столицы Скопье.
Премьер-министр Македонии Зоран Заев, его жена Зорица и его сын Душко проголосовали за референдум в Македонии по вопросу об изменении названия страны, которое откроет путь для ее вступления в НАТО и Европейский союз в Струмице, Македония, 30 сентября 2018 года.
Перед зданием парламента в Скопье Владимир Кавардарков, 54 года, подготовил небольшую сцену, расставив стулья перед палатками, установленными теми гражданами, которые собираются бойкотировать референдум.
«Мы за членство в НАТО и ЕС, но мы хотим объединиться с высоко поднятой головой, а не обивая пороги чиновничьих кабинетов», — говорит Кавадарков.
«Да, мы граждане бедной страны, но и у нас есть чувство собственного достоинства.
Если они не хотят принимать нас как Македонию, мы можем обратиться к другим странам, таким как Китай и Россия, и стать частью евро-азиатской интеграции».
Премьер-министр Заев говорит, что членство в НАТО принесет инвестиции в Македонию, которые столь необходимы этой стране, где уровень безработицы составляет более 20 процентов.
«Я верю, что подавляющее большинство будет за, потому что более 80 процентов наших граждан поддерживают ЕС и НАТО», — заявил Заев после голосования.
Он полагает, что положительный ответ станет «залогом нашего благополучного будущего».
Опрос, опубликованный в прошлый понедельник Институтом политических исследований Македонии, показал, что от 30 до 43 процентов избирателей примут участие в референдуме, но это ниже требуемой явки.
В ходе другого опроса, проведенного македонским каналом Telecom-TV, выяснилось, что проголосовать в воскресенье планируют 57 процентов респондентов.
70 процентов от этого количества утверждают, что проголосуют положительно.
Чтобы референдум состоялся, явка должна составлять 50 процентов плюс один голос.
Провал референдума станет первым серьезным ударом по политике прозападного правительства с тех пор, как оно пришло к власти в мае прошлого года.
Смотрите: Серхио Агуэро из «Манчестер Сити» обходит защиту «Брайтона», чтобы забить гол
Серхио Агуэро и Рахим Стерлинг расправились с защитой «Брайтона», приведя «Манчестер Сити» к победе со счетом 2:0 в субботу на стадионе Этихад в Манчестере, Англия.
Когда Агуэро забил гол на 65-й минуте, казалось, что это не составило ему никакого труда.
В начале эпизода аргентинский нападающий получил пас в центре поля.
Он промчался между тремя защитниками «Брайтона», прежде чем вырваться на открытое пространство
Агуэро оказался в окружении четырех соперников в зеленых футболках.
Он обошел одного защитника и обогнал еще нескольких по краю штрафной зоны «Брайтона».
Далее он передал мяч Стерлингу слева.
Английский нападающий, находясь в штрафной зоне, в одно касание вернул мяч Агуэро, который правой ногой пробил вратаря «Брайтона» Мэтью Райана в правый угол ворот.
«Агуэро испытывает какие-то проблемы с ногами», — заявил журналистам тренер «Манчестер Сити», Пеп Гвардиола.
«Мы договорились, что он будет играть 55, 60 минут.
Вот что случилось.
Нам повезло, что он забил гол в тот момент».
Но именно Стерлинг дал «Небесно-голубым» первоначальное преимущество в борьбе Премьер-лиги.
Тот гол был забит на 29-й минуте.
В этой игре Агуэро получил мяч, будучи глубоко на территории «Брайтона»
Он отдал отличную разрезную передачу по левому флангу на Лероя Сане.
Сане сделал несколько касаний, прежде чем отдать передачу Стерлингу на дальнюю штангу.
Нападающий «Небесно-голубых» забил мяч в ворота прямо перед тем, как вылететь за пределы поля.
«Манчестер Сити» сразились с «Хоффенхаймом» в группе Лиги чемпионов во вторник в 12:55 на Рейн-Неккар-Арене в Зинсхайме, Германия.
Шерзер собирается отобрать очки у «Колорадо Рокиз»
После того, как «Вашингтон Нэшионалс» выбыли из битвы за плей-офф, не было особой причины форсировать события.
Но неутомимый Шерзер надеется взять верх в борьбе против «Колорадо Рокиз» в воскресенье, но только если у «Рокиз», опережающих на одну игру «Лос-Анджелес Доджерс» в Западном дивизионе, начнутся проблемы в плей-офф.
Победой 5-2 над «Нэшионалс» в пятницу вечером «Рокиз» уже завоевали, по крайней мере, 7 или 8 место, но они все еще надеются обеспечить себе титул в первом дивизионе.
«И хотя мы играем просто так, но по крайней мере,  можем удержать позиции, зная об огромном значении атмосферы в Денвере в присутствии зрителей и другой команды, вероятно, беспрецедентном в этом году.
Как могу я пропустить такое?».
«Нэшионалс» еще не объявили питчера на воскресенье, но, по последним данным, в сложившейся ситуации склонны выставить Шерзера на эту роль.
Шерзер, собирающийся выйти на 34-ю игру, в четверг бросал мяч на площадке для питчеров, а в воскресенье, в свой выходной, будет питчером.
Статистика правши-питчера «Вашингтона» — 18-7 с рейтингом ERA 2,53 и 300 аутов в 220 2/3 иннингах в текущем сезоне.
Трамп проводит предвыборную гонку в Западной Вирджинии
Говоря о важности явки республиканцев на промежуточных выборах, президент косвенно сослался на ситуацию вокруг Бретта Кавано, кандидатуры, выдвинутой президентом в Верховный суд.
«Все, что мы сделали, поставлено на карту в ноябре.
Пять недель осталось до одних из самых важных выборов в нашей жизни.
Это очень, очень важно. Я не бегаю, хотя я действительно бегаю, повсюду борясь за хороших кандидатов», — сказал он.
Трамп продолжил: «Вы видите эту ужасную, ужасную радикальную группу демократов, вы видите, что это происходит прямо сейчас.
И они полны решимости вернуть себе власть, используя любые необходимые средства, и мы наблюдаем подлость и мерзость.
Им все равно, кого они обидят, через кого они должны переступить, чтобы получить власть и контроль, а именно это они и хотят получить — власть и контроль, но мы не собираемся их отдавать им».
Демократы, утверждает он, задались целью «противостоять и препятствовать».
«И вы наблюдаете это в течение последних четырех дней», — сказал он, назвав демократов «злыми, подлыми, гадкими и лживыми».
Он сослался на Юридический комитет Сената, упомянув сенатора-демократа Дайэнн Файнстайн, что вызвало громкие возгласы из зала.
«Вы помните ее ответ?
Вы допустили утечку содержания этого документа?
Ммм... ммм..., какого документа?
Нет, нет. Язык тела выдал ее, я никогда еще не видел, чтобы язык тела настолько опровергал слова».
Лейбористская партия — это больше не организация, придерживающаяся разных взглядов.
Она не проявляет толерантность к тем, кто высказывает свое мнение
Когда активисты Momentum в моей местной партии внесли предложение о вотуме недоверия мне, это не было неожиданностью.
В конце концов, я последний в ряду членов парламента от лейбористской партии, которому еще не высказывали, что нас не приветствуют за то, что мы высказываем свое мнение.
Аналогичное отношение и к моей коллеге в парламенте Джоан Райан, потому что она решительно высказывалась против антисемитизма.
В моем случае вотумом недоверия меня раскритиковали за несогласие с Джереми Корбином.
Важность ответственной экономической политики,  национальная безопасность, Европа — по иронии судьбы это вопросы, по которым Джереми не соглашался с предыдущими лидерами.
В уведомлении о Ноттингемском Восточном лейбористском собрании в пятницу говорилось, что «мы хотим, чтобы собрания были инклюзивными и продуктивными».
Большую часть времени из восьми лет моего пребывания на посту местного члена парламента от лейбористской партии вечерние пятничные собрания GC были именно такими.
К сожалению, сегодняшний тон не соответствует тем многим встречам, а обещание «более человечной и мягкой» политики давно забыто, если она таковой вообще и была когда-либо.
Тот факт, что в лейбористской партии не допускаются различия во взглядах, становится все более и более очевидным, и каждое мнение оценивается на предмет того, является ли оно приемлемым для руководства партии.
Это началось вскоре после того, как Джереми стал лидером; коллеги, чью политическую перспективу я ранее считал схожей с моей собственной, стали ожидать, что я кардинально изменю свои взгляды и займу позиции, с которыми я никогда бы не согласился — будь то вопросы национальной безопасности или единого рынка ЕС.
Всякий раз после моего публичного выступления — причем не важно, что именно я говорю — в социальных сетях следует тирада оскорблений, призывающих к отмене выборов, осуждающих политику центра, или утверждающих, что я не должен быть членом лейбористской партии.
И такое происходит не только со мной.
Действительно, я знаю, что мне повезло больше, чем некоторым моим коллегам, поскольку комментарии в мой адрес все же имеют тенденцию быть политическими.
Я восхищаюсь профессионализмом и решимостью тех моих коллег, которые каждый день сталкиваются с потоком нападок на сексуальной или расистской почве, но никогда не отступают.
Больше всего в этой  политике разочаровывает то, что такое количество оскорблений стало считаться нормой.
На прошлой неделе Джереми Корбин заявил, что лейбористская партия должна развивать культуру терпимости.
Реальность такова, что мы больше не та «широкая церковь», и с каждым вотумом недоверия или изменением правил выбора партия становится уже.
За последние два года я получал много рекомендаций, призывающих меня сидеть потише и пореже высказываться, и тогда со мной все будет в порядке.
Но я не для этого пришел в политику.
С тех пор, как я присоединился к лейбористам 32 года назад, будучи учеником школы, возмущенным пренебрежительным отношением правительства Тэтчер, из-за которого мой школьный класс буквально распался, я стремился отстаивать наивысший стандарт государственных услуг для тех, кто в них больше всего нуждается — будь то работе локального депутата или правительственного министра.
Я никогда не скрывал своих политических взглядов, я не сделал этого и на прошлых выборах.
Никто в Ноттингем Восток не мог неправильно истолковать мои политические позиции и сферы, в которых я не согласен с нынешним руководством.
Тем, кто поддержал этот вотум в пятницу, я хотел бы сказать следующее: наша страна с таким трудом движется к Brexit, который гарантированно нанесет хозяйственный, промышленный и государственный урон, и я не понимаю желания некоторых тратить свое время и силы на вопрос о моей лояльности лидеру лейбористской партии.
Но на самом деле единственная аудитория, к которой я хотел бы обратиться, — это не Nottingham Momentum, а мои избиратели, неважно, являются ли они лейбористами или нет: я горжусь тем, что служу вам, и обещаю, что никакие угрозы отмены результатов выборов или политическая целесообразность не помешают мне действовать так, как я считаю необходимым в ваших интересах.
Крис Лесли, член парламента от округа Ноттингем Восток
Эр 38 - 17 Мелроуз: Непобедимый «Эр» выходит на первое место
Две запоздалые попытки, возможно, несколько исказили окончательный результат, но, без сомнения, «Эр» заслужил триумф в этом удивительно интересном матче премьер-лиги Теннента.
Теперь они возглавляют таблицу, единственная непобедимая команда десятки.
В конце концов, все благодаря их превосходной защите, а также умению выбирать нужный момент, что дало принимающей команде и тренеру Питеру Мерчи полное право быть довольными.
«Все это время нас проверяли на прочность, и мы все еще непобедимы, поэтому у меня нет причин грустить», — прокомментировал Питер Мерчи.
Робин Кристи, Мелроуз: «Стоит отдать должное «Эр», они постарались лучше нас».
Попытка Гранта Андерсона на 14 минуте, реализованная Фрезером Климо, вывела «Эр» вперед, но желтая карточка  выпущенному для игры «Вориорс» шотландскому игроку Рори Хьюсу позволила «Мелроуз» выйти вперед, а Джейсон Баггот ухватился за нереализованную попытку.
Климо увеличил отрыв «Эр» со штрафного, прежде чем, прямо в середине игры, заработал очко, а затем в перерыве реализовал одиночную попытку, сделав счет 17-5 в пользу «Эр».
Но «Мелроуз» начали вторую половину хорошо, и попытка Патрика Андерсона, реализованная Багготом, сократила отрыв до пяти очков.
Затем был длительный перерыв из-за серьезной травмы Руарида Кнотта, получившего растяжение, и после повторного выхода, «Эр» продвинулся дальше благодаря попытке Стаффорда Макдауэла, реализованной Климо.
Действующий капитан «Эр» Блэр Макферсон тогда получил желтую карточку, и снова «Мелроуз» заставили соперников заплатить очередным игроком за нереализованную попытку Брюса Колвина, в конце периода яростного давления.
Тем не менее, хозяева вернулись, и когда Струан Хатчинсон получил желтую карточку за перехват Климо без мяча с линии штрафной, Макферсон сделал тачдаун позади наступающего мола «Эр».
Климо реализовал преимущество, не останавливаясь практически с самого повторного выхода, после того как Кайл Роу получил удар от Дэвида Армстронга и отправил крайнего нападающего Грегора Генри на пятую попытку хозяев поля.
Звезда Still Game собирается начать новую карьеру в ресторанном бизнесе
Звезда Still Game Форд Киран собирается приступить к работе в гостиничной индустрии: стало известно, что он был назначен директором лицензированной ресторанной компании.
56-летний актер исполняет роль Джека Джарвиса в популярном шоу BBC, сценарий к которому он же и пишет, и снимается вместе с давним комедийным партнером Грегом Хемфиллом.
Дуэт объявил, что предстоящая девятая серия станет последней в шоу, и похоже, что Кирнан планирует жизнь после Крейгланга.
По официальной информации, он является директором Adriftmorn Limited.
Актер отказался комментировать эту информацию, хотя источник Scottish Sun намекнул, что Кирнан планирует принять участие в «процветающем ресторанном бизнесе» в Глазго.
«Море наше»: не имеющая выхода к морю Боливия надеется, что суд вновь откроет ей путь к Тихому океану
Моряки патрулируют военно-морской штаб в Ла-Пасе.
На общественных зданиях вывешены голубые флаги.
Военно-морские базы от озера Титикака до Амазонки обрисованы лозунгом: «Море наше по праву.
Вернуть его — наш долг».
По всей Боливии, не имеющей выхода к морю, все еще жива память о береговой линии, потерянной в пользу Чили в результате кровопролитного конфликта 19-го века из-за ресурсов; живо и стремление снова плыть по Тихому океану.
Эти надежды, возможно, за последние десятилетия стали самыми смелыми, поскольку Боливия ожидает решения международного суда, который состоится 1 октября в результате пяти лет дебатов.
«У Боливии есть энергия, дух единства и душевное равновесие и, конечно же, тут ждут положительного результата», — сказал боливийский дипломат Роберто Кальзадилья.
Многие боливийцы будут наблюдать процесс вынесения решение в Международном суде на больших экранах по всей стране, надеясь, что трибунал в Гааге сможет поддержать заявление Боливии о том, что после десятилетий напряженных переговоров Чили обязана вести переговоры о предоставлении Боливии суверенного выхода к морю.
Эво Моралес, харизматичный президент коренных народов Боливии, который ведет непростую битву за переизбрание в следующем году, также с волнением ждет решения, которое будет вынесено в понедельник.
«Мы очень близки к возвращению в Тихий океан», — утверждал он в конце августа.
Однако некоторые аналитики полагают, что суд вряд ли примет решение в пользу Боливии, а если так и случится, то это мало что изменит.
Находящийся в Нидерландах орган ООН не имеет полномочий распоряжаться чилийской территорией и уже заявил, что не будет никак влиять на исход возможных переговоров.
То, что решение Международного Суда было вынесено только через шесть месяцев после того, как были заслушаны последние аргументы, говорит о том, что дело «не было сложным», — говорит Пас Зарате, чилийский эксперт по международному праву.
А последние четыре года дело Боливии не продвигалось, а наоборот все время откладывалось.
«Нынешняя администрация Боливии пользовалась проблемой доступа к морю в преступных целях», — говорит Зарате.
По ее словам, воинственная риторика Моралеса уничтожила последнюю чилийскую доброжелательность.
Боливия и Чили в какой-то момент продолжат переговоры, но после этого будет крайне трудно вести дискуссии.
Эти две страны не имеют дипломатических отношений с 1962 года.
Бывший президент Эдуардо Родригес Вельце, представитель Боливии в Гааге, не согласен с тем, что решение суда было вынесено слишком быстро.
Понедельник принесет Боливии «исключительную возможность начать новую эпоху взаимоотношений с Чили» и шанс «положить конец 139 годам разногласий с обоюдной выгодой», — утверждает он.
Кальзадилья также не согласен с тем, что Моралес, все еще один из самых популярных президентов Латинской Америки, использует военно-морскую проблему в качестве политического козыря.
«Боливия никогда не откажется от своего права доступа к Тихому океану», — утверждает он.
«Решение суда — это возможность еще раз убедиться в том, что нам надо перешагнуть через наше прошлое».
Северная Корея заявляет, что ядерного разоружения не будет до тех пор, пока она не сможет доверять США
Министр иностранных дел Северной Кореи Ри Ён Хо заявляет, что его страна никогда не пойдет на уничтожение своего ядерного оружия, если не сможет доверять Вашингтону.
В субботу Ри выступал на заседании Генассамблеи ООН.
Он призвал Соединенные Штаты выполнять обещания, данные на саммите в Сингапуре между лидерами своих стран.
Его комментарии поступают по мере того, как Госсекретарь США Майк Помпео постепенно возвращается на путь возобновления тупиковой ядерной дипломатии по прошествии более чем трех месяцев после встречи в Сингапуре с северокорейским лидером Ким Чен Ыном.
Ри утверждает: мечта о том, что длительные санкции и возражение США против декларации об окончании Корейской войны когда-либо поставят Север на колени — это утопия.
Вашингтон опасается утвердить эту декларацию, если Пхеньян прежде не предпримет существенных шагов по разоружению.
И Ким, и президент США Дональд Трамп хотят провести второй саммит.
Но скептицизм по поводу того, что Пхеньян серьезно относится к отказу от арсенала, который страна, вероятно, рассматривает как единственный способ гарантировать свою безопасность, является широко распространенным.
Помпео планирует посетить Пхеньян в следующем месяце, чтобы подготовить второй саммит между Кимом и Трампом.
Парижские модные показы демонстрируют новейшую линию массивных головных уборов, которые обещают появиться в массовой продаже, и их будут носить прямо рядом с вами
Если вы хотите добавить шляп в свою коллекцию или полностью защититься от солнечных лучей, нет нужды искать что-то еще.
Дизайнеры Valentino и Thom Browne представили массу необычных головных уборов, являющихся частью их коллекции SS19 и ослепивших посетителей Недели моды в Париже.
Этим летом крайне непрактичные шляпы завоевали популярность подписчиков Instagram, и дизайнеры решили отправить свои сногсшибательные творения на подиум.
Отличившийся экземпляр Valentino: головной бежевый убор, украшенный широкими полями, похожими на перья, красовался на головах моделей.
Другие массивные аксессуары включали украшенные драгоценными камнями арбузы, шляпу волшебника и даже ананас, однако все эти головные уборы не предназначены для согревания головы в холодную погоду.
Том Браун также явил миру коллекцию причудливых масок, что пришлось очень к стати накануне Хеллоуина.
На многих из этих пестрых масок был зашит рот, и они больше напоминали портрет Ганнибала Лектора, чем творение от кутюр.
Один из экземпляров напоминал снаряжение для подводного плавания с трубкой и защитными очками, а другой — растаявшее мороженое.
Если вы поклонник высокой моды, то вам повезло.
Модные критики предсказывают, что эти огромные шляпы имеют все шансы пробиться в массовую продажу — прямо к вам.
Шляпы огромного размера идут по пятам «La Bomba», соломенной шляпы с полями шириной в два фута, которую надевали уже все, от Рианны до Эмили Ратаковски.
Культовый лейбл, выпустивший эту крайне непрактичную шляпу, завоевавшую такую широкую популярность в социальных сетях, породил и отправил гулять по подиуму еще один огромный аксессуар — соломенную пляжную сумку, почти такую ​​же большую, как и сама одетая в купальник модель, несущая эту сумку.
Оранжевая сумка из обожженной рафии с белой кожаной ручкой и окантовкой из рафии стала ярким экземпляром коллекции Jacquemus La Riviera SS19 на Неделе моды в Париже.
Селебрити-стилист Люк Армитаж рассказывает изданию FEMAIL: «Думаю, большие шляпы и пляжные сумки появятся в массовой продаже следующим летом. Поскольку уж дизайнер произвел такой фурор своими произведениями, было бы крайне трудно игнорировать спрос на огромные аксессуары».
Джон Эдвард: Знание языков имеет огромную важность для граждан мира
Независимые школы Шотландии продолжают традицию блестящего образования, что еще раз получило подтверждение в 2018 году: выдающиеся результаты экзаменов продемонстрировали индивидуальные и коллективные успехи в спорте, искусстве, музыке и других общественно-значимых дисциплинах.
Эти школы входят в Шотландский совет независимых школ (SCIS), тут обучаются более 30 000 учеников по всей Шотландии, тут стремятся обеспечить высший уровень услуг для учеников и их родителей.
Независимые школы стремятся подготовить своих учеников к дальнейшему получению высшего образования, выбранной ими карьеры, а также к статусу граждан мира.
Будучи частью образовательного сектора, который отвечает за разработку и внедрение индивидуальной школьной программы, мы видим, что современные языки продолжают оставаться популярным и желанным предметом выбора в школах.
Нельсон Мандела сказал: «Если вы разговариваете с человеком на языке, который он понимает, то вы взываете к его разуму.
Если вы говорите с ним на его родном языке, то вы обращаетесь к его сердцу».
Это убедительное свидетельство того, что мы не можем полагаться только на английский язык, если  хотим строить отношения с гражданами других стран и уметь доверять им.
По результатам последних экзаменов этого года мы видим, что языки занимают лидирующие позиции в таблицах лиги и имеют самый высокий балл по результатам экзаменов в независимых школах.
В общей сложности 68 процентов учеников, изучавших иностранные языки, получили высшую оценку «А».
Данные, полученные по 74 школам-членам SCIS, показали, что 72 процента учеников получили «A» по  мандаринскому (наречие китайского языка), в то время как 72 процента изучающих немецкий, 69 процентов изучающих французский и 63 процента изучающих испанский, также получили «A».
Это доказывает, что в независимых школах Шотландии иностранные языки несомненно считают жизненно важными для детей и молодежи в будущем.
В настоящее время языковые предметы пользуются таким же спросом, как и естественные науки, технологии, инжиниринг и математика в учебных программах независимых школ и в других образовательных учреждениях.
Опрос, проведенный Комиссией по занятости и навыкам Великобритании в 2014 году, показал, что среди причин, которые создавали работодателям трудности при заполнении вакантных рабочих мест, 17 процентов пришлось на нехватку языковых навыков.
Таким образом, языковые навыки все чаще становятся залогом успешной будущей карьеры для молодых людей.
С учетом того, что более перспективные рабочие должности требуют знания языков, эти навыки необходимы в глобализированном мире.
Независимо от того, какую профессию выберет ученик, если он выучит второй язык, в будущем он получит реальное преимущество, освоив еще один дополнительный навык, который пригодится ему в течение всей его дальнейшей жизни.
Возможность напрямую общаться с людьми из других стран автоматически дает человеку, знающему несколько иностранных языков, конкурентные преимущества.
Согласно опросу YouGov, в котором приняли участие более 4000 взрослых британцев в 2013 году, 75 процентов не смогли достаточно хорошо говорить на иностранном языке, чтобы поддержать разговор, а французский язык оказался единственным языком с двузначным процентом — на нем говорят 15 процентов респондентов.
Вот почему инвестирование в языковое образование так актуально сейчас.
Знание нескольких языков, особенно языков стран с развивающимися экономиками, даст детям больше шансов найти хорошую работу.
В школах Шотландии существует достаточно большой разброс в плане языков, которые преподаются — у каждой школы свой набор языков.
Ряд школ сосредотачивается на более классических современных языках, тогда как другие преподают языки, которые считаются наиболее важными для Великобритании в свете будущего развития страны до 2020 года — такие как мандаринский или японский.
Какими бы ни были интересы вашего ребенка, в независимых школах всегда будет выбор из нескольких языков с преподавательским составом, члены которого являются специалистами по этим языкам.
Независимые школы Шотландии стремятся создать среду обучения, которая подготовит детей и вооружит их навыками, необходимыми для достижения успеха, независимо от того, какое будущее их ждет.
В настоящее время нельзя отрицать, что в глобальной деловой среде языки по-прежнему имеют жизненно важное значение в плане будущего развития страны, поэтому это должно быть соответствующим образом отражено в образовании.
На самом деле, современные языки действительно необходимо рассматривать в качестве «навыков международного общения».
Независимые школы будут и впредь предлагать этот выбор, обеспечивающий разнообразие и преимущества для молодежи Шотландии.
Il faut bien le faire.
Джон Эдвардс, директор Совета независимых школ Шотландии
Леброн дебютирует в составе «Лейкерс» в воскресенье в Сан-Диего
Томительное ожидание фанатов увидеть, как Леброн Джеймс впервые выступит в «Лос-Анджелес Лейкерс», почти подошло к концу.
Тренер «Лейкерс» Люк Уолтон объявил, что Джеймс сыграет в предсезонном воскресном матче против «Денвер Наггетс» в Сан-Диего.
Но еще предстоит выяснить, сколько времени ему предстоит отыграть.
«Больше одной и меньше сорока восьми», — ответил Уолтон на официальном сайте «Лейкерс».
Репортер «Лейкерс» Майк Трюделл написал в Твиттере, что Джеймс, скорее всего, сыграет ограниченное время.
После тренировок в начале этой недели Джеймса спросили о его планах относительно шести предсезонных игр в графике «Лейкерс».
«На данном этапе своей карьеры я не нуждаюсь в предсезонных играх, чтобы подготовиться к сезону», — отвечает игрок.
Предвыборная гонка Трампа в Западной Вирджинии, канал YouTube
Президент Дональд Трамп начинает волну предвыборных встреч сегодня вечером в Уилинге, Западная Вирджиния.
Это первая из пяти запланированных встреч Трампа на следующей неделе, в том числе он посетит дружественно настроенные Теннесси и Миссисипи.
Поскольку голосование по кандидатуре, предложенной им на пост верховного судьи, было отложено, Трамп стремится заручиться поддержкой на предстоящих промежуточных выборах, ведь республиканцы рискуют потерять контроль над Конгрессом, если голосование состоится в ноябре.
Во сколько сегодня вечером состоится встреча Трампа в Западной Вирджинии и как можно посмотреть ее онлайн?
Встреча с Трампом в Уилинге, Западная Вирджиния, состоится в 19:00. по восточному времени сегодня, в субботу, 29 сентября 2018 г.
Вы можете посмотреть встречу Трампа с избирателями Западной Вирджинии онлайн по прямой трансляции на YouTube.
Трамп, вероятно, выступит на слушаниях, которые состоятся на этой неделе, на предмет выдвижения своего  кандидата Бретта Кавано на должность верховного судьи. Предложение Трампом этой кандидатуры вызвало массу негативных откликов, так как Кавано был обвинен в сексуальных домогательствах, и голосование, которое должно было пройти в Сенате, будет отложено на срок до недели, пока ФБР проводит расследование.
Но главная цель этой акции — помочь республиканцам, выходящими на ноябрьские выборы, нарастить предвыборный темп.
Таким образом, кампания президента Трампа направлена на то, чтобы эти пять встреч, которые должны состояться на следующей неделе, помогли «активизировать деятельность добровольцев и сторонников, поскольку республиканцы пытаются защитить и расширить свое большинство в Сенате и Палате представителей», — пишет Reuters.
«Контроль над Конгрессом настолько важен для его повестки, что президент должен посетить как можно больше штатов, ведь мы вступаем в напряженный сезон предвыборной агитации», — рассказывает пресс-секретарь предвыборной кампании Трампа, отказавшийся называться, сообщает Reuters.
Запланированная сегодня  на Wesbanco Arena в Уилинге акция может привлечь сторонников из «...Огайо и Пенсильвании, и привлечь внимание СМИ Питтсбурга», — сообщает West Virginia Metro News.
Посещение Трампом Западной Вирджинии в эту субботу — это уже второе посещение этого штата за последний месяц, ведь именно здесь он получил преимущество более чем на 40 процентных пунктов в 2016 году.
Трамп пытается помочь кандидату в сенат от Западной Вирджинии Патрику Морриси, который отстает по результатом опросов.
«Тот факт, что для того, чтобы Морриси начал опережать конкурентов по опросам, должен приехать президент — это нехороший знак для самого Морриси», — говорит Саймон Хедер, политолог из Университета Западной Вирджинии (цитата из Reuters).
Кубок Райдера 2018: Сборная США демонстрирует готовность к борьбе и питает надежды, отправляясь в воскресенье на парные состязания
После трех односторонних сессий, субботняя игра два на два, возможно, была именно тем, в чем Кубок Райдера нуждался.
Переходящая инициатива — это исключительная выдуманная спортивная концепция, но именно в нее верят игроки, и на подобных соревнованиях она особо ярко выражена.
Так у кого же инициатива?
«У них было преимущество в шесть очков, а теперь четыре, так что, я полагаю, для нас это небольшая инициатива», — сказал Джордан Спит уходя.
Конечно, у Европы преимущество в четыре очка, и еще двенадцать на кону.
Американцы, по мнению Спита, чувствуют «ветер в парусах», и у них есть причины держать дух на высоте, не в последнюю очередь благодаря форме Спита и Джастина Томаса, игравших вместе весь день, и каждый может похвастаться тремя очками из четырех.
Спит был непреклонен от ти до грина, чем подавал личный пример.
Победные возгласы становились все громче по мере того, как продолжался его раунд, загнав решающий мяч в лунку, закрыв матч, когда они с Томасом уступили два на два.
Его удар, подаривший им победу в игре на 15-й лунке, был встречен схожим возгласом, одним из тех, что говорят о его вере в шанс для американской команды.
«Необходимо собраться со всеми силами и сосредоточиться только на своей игре», — прокомментировал Спит.
Это все, что сейчас осталось игрокам.
Пройти 18 лунок и стать победителями.
Единственные игроки, заработавшие  за последние два дня больше очков, чем Спит и Томас, — это Франческо Молинари и Томми Флитвуд, бесспорно вошедшие в историею Кубка Райдера.
Странная, но очаровательная пара из Европы выбила четыре из четырех, и, кажется, они не знают ошибок.
«Моливуд» были единственной парой, не набравшей богги в субботу днем, но они также избегали богги в субботу утром, в пятницу днем и, опять же, в пятницу утром.
Такая серия и то, как их энергия, кажется, циркулирует между ними и неистовыми болельщиками, укрепляет верой в то, что и в воскресенье их будет не победить, и когда солнце скроется за горизонтом поля «Le Golf National», не будет более знаменитого игрока, закрепившего потенциальную победу Европы, чем Флитвуд или Молинари.
Было бы здорово, если бы оба были одновременно на разных лунках.
Однако говорить о славе Европы пока преждевременно.
Бубба Уотсон и Уэбб Симпсон быстро расправились с Серхио Гарсиа, утренним героем игры в четыре мяча, когда он был в паре с Алексом Нореном.
Богги и два двойных богги на первых девяти лунках вырыли испанцу и шведу яму, из которой они так и не смогли вылезти.
Так что в воскресенье никто не поможет вам вылезти из вашей ямы.
Так увлекательно наблюдать за игрой в четыре мяча и четверкой игроков из-за взаимодействия между парами, советов, которыми они обмениваются, и которые намеренно умалчивают, и того, как стратегия может измениться в одно мгновение.
До сих пор Европа играла лучше, как команда, и значительно вырвалась вперед в последний день, но эта сессия четверок также показала, что у сборной США есть все силы для борьбы, в которых некоторые, особенно в Америке, сомневались.
В заключительный день Кубка Райдера Европа лидирует со счетом 10-6
Европа получит ощутимое преимущество в заключительный день Кубка Райдера после завершения субботних матчей в четыре мяча и четверок с преимуществом 10-6 над Соединенными Штатами.
Вдохновленный дуэт Томми Флитвуд и Франческо Молинари возглавил борьбу с двумя победами над борющимся Тайгером Вудсом, чтобы довести счет в «Le Golf National» до четырех очков.
Европейская команда Томаса Бьорна, желающая вернуть себе потерянный в Хазелтине два года назад трофей, доминировала над допускающей ошибки американской командой в утренних играх в четыре мяча, победив со счетом 3-1.
США оказали больше сопротивления в четверках, выиграв два матча, но они не смогли сократить разрыв в счете.
Команде Джима Ферика нужно восемь очков из 12-ти воскресных матчей, чтобы сохранить трофей.
Флитвуд является первым европейским новичком, который выиграл четыре очка подряд, в то время как он и Молинари, получившие прозвище «Молливуд» после сенсационных выходных, стали только второй парой, которая выиграла четыре очка в первых четырех матчах в истории Кубка Райдера.
Разгромив Вудса и Патрика Рида в четыре мяча, они затем великолепно объединились для победы над павшим духом Вудсом и американским новичком Брайсоном Дечебмо с еще более решительными 5/4.
Вудс, прошедший два субботних матча, показывал периодические проблески, но теперь он проиграл 19 из 29 матчей в четыре мяча, а четверки – семь подряд.
Джастин Роуз, отдохнувший перед утренней игрой в четыре мяча, вернулся к напарнику Хенрику Стенсону в четверке, победив Дастина Джонсона и Брукса Кепку со счетом 2/1, занимающих первое и третье места в мире.
Для Европы же игра не стала легкой и приятной прогулкой освежающим днем к юго-западу от Парижа.
Заработанные трехкратным чемпионом Джорданом Спитом и Джастином Томасом в субботу два очка стали для американцев ориентиром.
Они заработали решительную победу со счетом 2/1 над испанцами Джоном Рамом и Айаном Полтером в игре в четыре мяча и вернулись позже, чтобы обыграть Полтера и Рори Макилроя со счетом 4/3 в четверках, потеряв первые две лунки.
Лишь дважды в истории Кубка Райдера команда выпутывалась из отставания в четыре очка, выходя в одиночку, учитывая, что команде Ферика, как хозяевам, необходимо было сыграть вничью, чтобы удержать трофей.
Однако, после двух дней удерживания второго места, контратака в воскресенье выглядит так, будто она за гранью их возможностей.
Северная Корея говорит, что «категорически» не будет разоружаться в одностороннем порядке без доверия
Министр иностранных дел Северной Кореи заявил в Организации Объединенных Наций в субботу, что продолжающиеся санкции усиливают недоверие к Соединенным Штатам, и что его страна ни при каких обстоятельствах не откажется от своего ядерного оружия в одностороннем порядке.
Ри Ён Хо заявил на ежегодной Генеральной Ассамблее, что Северная Корея приняла «существенные меры доброй воли» в прошлом году, такие как прекращение ядерных и ракетных испытаний, демонтаж ядерного полигона и обязательство не наращивать запасы ядерного оружие и не разрабатывать ядерные технологии.
«Однако симметричной реакции от США мы не наблюдаем», — сказал он.
«Без доверия к США не будет уверенности в нашей национальной безопасности, и при таких обстоятельствах мы не сможем в одностороннем порядке первыми предпринимать действия по разоружению».
В то время как Ри повторил уже звучавшие северокорейские жалобы на сопротивление Вашингтона «поэтапному» подходу к денуклеаризации, согласно которому Северная Корея будет вознаграждена за постепенные шаги, его заявление показалось важным в том смысле, что оно не отвергало одностороннюю денуклеаризацию без контроля, как это сделал Пхеньян в прошлом.
Ри сослался на совместное заявление, сделанное Ким Чен Ыном и Дональдом Трампом на первом в истории саммите между действующим президентом США и северокорейским лидером, который состоялся в Сингапуре 12 июня; тогда Ким пообещал начать движение в сторону «денуклеаризации Корейского полуострова», а Трамп пообещал Северной Корее гарантии безопасности.
Северная Корея стремится официально завершить Корейскую войну 1950-53 гг., однако Соединенные Штаты заявляют, что Пхеньян должен сначала отказаться от своего ядерного оружия.
Вашингтон также сопротивляется призывам ослабить жесткие международные санкции в отношении Северной Кореи.
«США настаивают на том, что «сначала должна быть произведена денуклеаризация», и повышают уровень давления через санкции с целью принудительного достижения своей цели и даже возражают против «объявления об окончании войны», — говорит Ри.
«Представление о том, что санкции могут поставить нас на колени, — это утопическая мечта людей, которые не знают нас.
Но настоящая проблема в том, что продолжающиеся санкции усиливают наше недоверие».
Ри не упомянул о планах второй встречи на высшем уровне между Кимом и Трампом, о которой лидер США упомянул в Организации Объединенных Наций в начале недели.
Вместо этого министр заострил внимание на трех встречах между Кимом и южнокорейским лидером Муном Чжэ Ином, имевших место за последние пять месяцев, и добавил: «Если бы стороной этого вопроса денуклеаризации была Южная Корея, а не США, денуклеаризация Корейского полуострова не оказалась бы в таком тупике».
Тем не менее, тон речи Ри резко отличался от прошлого года, когда он сказал в Генассамблее ООН о том, что нацеливание ракет Северной Кореи на материк США было неизбежно после того, как «г-н президент зла» Трамп назвал Кима «ракетчиком-самоубийцей».
В этом году в ООН Трамп, который в прошлом году угрожал «полностью уничтожить» Северную Корею, похвалил Кима за его смелость в принятии мер по разоружению, но сказал, что еще многое предстоит сделать, и санкции должны оставаться в силе до тех пор, пока Северная Корея не разоружится.
В среду Трамп сказал, что он не обозначает никаких временных сроков для этого процесса: «Займет ли это два года, три года или пять месяцев — не имеет значения».
Китай и Россия полагают, что Совет Безопасности ООН должен поощрить Пхеньян за шаги, которые были предприняты.
Однако Госсекретарь США Майк Помпео высказался в Совете Безопасности ООН в четверг: «Введение Советом Безопасности санкций должно продолжаться активно и в обязательном порядке до тех пор, пока мы не увидим полную, окончательную и подтвержденную денуклеаризацию».
Совет Безопасности единогласно усиливал санкции в отношении Северной Кореи с 2006 года, стремясь перекрыть финансирование программ Пхеньяна по ядерным и баллистическим ракетам.
Помпео встретился с Ри в кулуарах саммита Генассамблеи ООН и сообщил после этой встречи, что он посетит Пхеньян снова в следующем месяце, чтобы подготовиться ко второй встрече на высшем уровне.
Помпео посещал Северную Корею уже трижды в этом году, но его последняя поездка не удалась.
В июле он покинул Пхеньян, сказав, что был достигнут прогресс, но уже в течение нескольких часов после этого визита Северная Корея осудила его за «бандитские требования».
Северная Корея пообещала на встрече, проходившей с участием Муна в этом месяце, демонтировать ракетный комплекс, а также ядерный комплекс, если Соединенные Штаты со своей стороны примут «соответствующие меры».
По его словам Ким сказал ему, что «соответствующие меры», о которых он говорил, — это гарантии безопасности, которые Трамп обещал в Сингапуре, а также действия, направленные на нормализацию отношений с Вашингтоном.
Студенты Гарварда учатся отдыхать на специальных курсах
Новый курс, введенный в этом году в Гарвардском университете, помог всем студентам начальных курсов научиться больше спать и бороться с шовинистской культурой беспрерывного потребления кофеина с целью бодрствовать «ночи напролет».
Один из академиков выяснил, что самые успешные студенты в мире часто не имеют представления о том, как заботиться о себе.
Чарльз Чейслер, профессор медицины сна в Гарвардской медицинской школе и специалист клиники Brigham and Women's Hospital, разработал курс, который, по его мнению, является первым в своем роде в США.
После того, как было сделано его открытие, он загорелся идеей ввести такой курс, предварительно выступив с докладом о влиянии нехватки сна на процессы обучения.
«В конце моего доклада ко мне подошла девушка и сказала: 'Очень жаль, что я узнала об этом только сейчас, когда я уже почти заканчиваю обучение.'.
Она сказала, что никто никогда не говорил ей о важности сна — что меня удивило», — рассказал он The Telegraph.
Курс, впервые предложенный студентам в этом году, рассказывает о том, как привычка здорового сна способствует академической и спортивной успеваемости, а также о том, как она улучшает общее самочувствие человека.
Пол Баррейра, профессор психиатрии Гарвардской медицинской школы и исполнительный директор Службы здравоохранения университета, говорит, что университет решил ввести этот курс после того, как было выяснено, что студенты испытывают серьезную нехватку сна в течение учебной недели.
Занятие длится один час, студенты выполняют ряд интерактивных заданий.
В одном из разделов занятия предлагается изображение комнаты в общежитии, где студенты, нажимая на кофейные чашки, шторы, тренажеры и книги, получают информацию о том, как каждое из этих действий и субстанций — кофе, свет, которые и вызывают нехватку сна — влияют на спортивные результаты, и о том, насколько важно ежедневно получать достаточное количество сна.
В другом разделе участники узнают о том, как длительное лишение сна может увеличить риск сердечных приступов, инсульта, депрессии и рака.
Интерактивная карта кампуса побуждает участников курса задуматься о своей повседневной жизни.
«Мы понимаем, что эти занятия не изменят поведения студентов сразу.
Но мы полагаем, что они имеют право знать, как и любой другой человек имеет право знать о том, например, как курение влияет на его здоровье», — добавил профессор Чейслер.
По его словам, ложное чувство гордости за то, что человек может «пахать всю ночь», все еще достаточно распространено, и современные технологии, так же, как и возрастающее давление на студентов означают, что лишение сна становится проблемой.
По его словам, достаточное количество сна хорошего качества — это «секретное оружие» студента для борьбы со стрессом, нервным истощением и тревогой, и даже для борьбы с лишним весом, поскольку недосыпание переводит мозг в режим голодания, заставляя его постоянно испытывать чувство голода.
Рэймонд Со, 19-летний калифорнийец, изучающий химическую и физическую биологию, помог профессору Чейслеру разработать курс, посетив одно из занятий в прошлом году во время своего первого года обучения в Гарварде.
Он сказал, что курс открыл ему глаза и вдохновил его распространять эту информацию по всему кампусу.
Он надеется, что следующий шаг — попросить всех аспирантов пройти аналогичную учебную программу, прежде чем поступать в конкурсное учебное заведение.
Профессор Чейслер рекомендует студентам установить будильник, предупреждающий, что нужно ложиться спать и просыпаться, а также помнить о вредном воздействии «синего света», испускаемого электронными экранами и светодиодными лампами, который нарушает биоритм человека и ведет к проблемам с засыпанием.
«Ливингстон» 1 - 0 «Рейнджерс»: Гол Менга приносит победу над командой Джеррарда
«Рейнджерс» пережили очередную печальную выездную встречу, так как гол Долли Менга привел несобранную команду Стивена Джеррарда к поражению со счетом 1:0 в Ливингстоне.
Команда Айброкса надеялась добыть свою первую победу на выезде после победы со счетом 4:1 в феврале в Сент-Джонстоне, но команда Гари Холта нанесла лишь второе поражение Джеррарду из 18 игр в качестве менеджера, оставив его команду на восемь очков позади, отдав легкую победу команде «Хартс», лидерам Шотландской Премьер-лиги.
Менга забил за семь минут до перерыва, а состав «Рейнджерс», потерявший силу духа, похоже, не собирался выравнивать счет.
В то время как «Рейнджерс» теперь опустился на шестое место, «Ливингстон» поднялся на третье место, и уступил только «Хиберниан» по соотношению забитых голов.
И у «Рейнджерс» могут возникнуть дополнительные проблемы после того, как линейному судье Калуму Спенсу пришлось залечивать рану на голове после того, как какой-то предмет был брошен из гостевого сектора.
Джеррард сделал восемь замен в команде, которая прошла через «Эр» в полуфинал за Кубок шотландской лиги.
В свою очередь, Холт пошел с той же стратегией Ливи 11, благодаря которой увеличил разрыв с «Хартс» на прошлой неделе, и он был бы рад тому, как его хорошо вымуштрованный состав теснил противников на каждом шагу.
«Рейнджерс», возможно, лидировали во владении мечом, но «Ливингстон» выжимали куда больше, когда мяч попадал к ним.
Они должны были забить гол всего за две минуты, когда первую передачу Менга Скотту Питтману остановил Аллан Макгрегор, но полузащитник воспользовался появившимся шансом.
Киган Джакобс выполнил  штрафной удар на капитана команды Крейгу Халкетту, но его партнер по обороне, Алан Литгоу, сумел только отправить мяч в сторону дальней штанги.
«Рейнджерс» перехватили контроль, но в последней трети, похоже, было больше надежды, чем веры в их игру.
Альфредо Морелос был уверен, что должен был бить штрафной удар на сорок пятой минуте, когда он и Стивен Лоулесс столкнулись, но судья Стивен Томсон не согласился с заявлением колумбийца.
«Рейнджерс» сделали всего два удара в первом тайме, но бывший вратарь Айброкса, Лиам Келли, едва ли был обеспокоен ударом Лассана Кулибали головой, и слабым ударом Ови Эджарии.
Хотя первый гол Ливи, забитый на 34-й минуте, возможно, и не соответствовал игре, никто не может отрицать, что они заслужили его исключительно собственным трудом.
Но опять же, «Рейнджерс» не удалось справиться с игрой Джейкобса со стандартного положения.
Скотт Арфилд не отреагировал, когда Деклан Галлахер отдал мяч Скотту Робинсону, старавшемуся изо всех сил передать мяч на Менга для завершения.
Джеррард начал действовать в перерыве, когда поменял Кулибали на Райана Кента, и такая замена почти сразу же дала результат, когда крайний полузащитник отдал пас Морелосу, но впечатляющий Келли помчался со своей линии на перехват.
Но «Ливингстон» продолжали втягивать гостей в задуманную ими игру с участием Литгоу и Халкетт, постоянно делая длинные передачи.
Команда Холта пыталась увеличить отрыв на заключительных этапах, но Макгрегор сумел заблокировать Джейкобса, прежде чем Литгоу отдал передачу с угла поля.
Запасной игрок «Рейнджерс», Гленн Миддлтон, в очередной раз потребовал штрафной удар после того, как он столкнулся с Джейкобсом, но Томсон снова отказал.
Альманах: Изобретатель счетчика Гейгера
И теперь страница нашего альманаха «Воскресное утро»: 30 сентября 1882 года, 136 лет назад в этот день в Германии родился будущий физик Йоханнес Вильгельм «Ганс» Гейгер.
Гейгер разработал метод обнаружения и измерения радиоактивности — изобретение, которое в конечном итоге привело к созданию устройства, известного как счетчик Гейгера.
Став одной из основ науки, счетчик Гейгера стал также и одной из основ популярной культуры, и это нашло отражение в фильме 1950-х годов «Колокола Коронадо», с ковбоеподобными Роем Роджерсом и Дейлом Эвансом — такими, казалось бы, не похожими на ученых — в главных ролях:
Человек: «А это что еще за штуковина такая?»
Роджерс: «Это счетчик Гейгера, используется для обнаружения радиоактивных минералов, таких как уран.
Когда вы надеваете эти наушники, вы действительно можете услышать влияние атомов, порождаемое радиоактивностью в минералах».
Эванс: «Вот, сейчас точно слышно!»
«Ганс» Гейгер умер в 1945 году, не дожив всего нескольких дней до своего 63-летия.
Но его изобретение, названное в честь своего автора, все еще широко используется.
Новая вакцина от рака может научить иммунную систему «видеть» аномальные клетки
Новая противораковая вакцина может научить иммунную систему «видеть» аномально растущие клетки и убивать их
Часть лечебного действия вакцины заключается в том, чтобы научить иммунную систему распознавать аномальные клетки
Метод заключается в извлечении иммунных клеток у пациента и их изменение в лабораторных условиях
В результате этого изменения клетки получают способность «увидеть» тип белка, характерный для многих видов рака, затем клетки должны быть 0ведены повторно
Пробная вакцина показывает многообещающие результаты у пациентов с различными видами рака.
У одной пациентки, которой была введена эта вакцина, и иммунная система которой научилась распознавать аномальные клетки, рак яичников находится в стадии ремиссии уже более 18 месяцев.
Метод заключается в извлечении иммунных клеток у пациента и их изменение в лабораторных условиях, после чего измененные клетки могут «увидеть» белок HER2, характерный для многих видов рака, затем измененные клетки повторно вводятся пациенту.
Профессор Джей Берзофски, Национальный институт США по исследованию рака, Вифезда, штат Мэриленд, утверждает: «Результаты, полученные нами, намекают, у нас появилась очень перспективная вакцина»
Профессор Берзофски объясняет: HER2 «стимулирует рост нескольких видов рака», в том числе рака молочной железы, яичников, легких и колоректального рака.
Похожий метод был успешно применен в лечении лейкемии. Он заключался в заборе иммунных клеток у пациентов и их «обучении», как нужно воздействовать на раковые клетки.
Канье Уэст выступил в защиту Трампа в кепке MAGA после своего появления в SNL.
Все прошло плохо
Канье Уэст был освистан в студии во время субботнего концерта, на котором он высказался в защиту президента США Дональда Трампа, утверждая, что он повторно займет эту должность в 2020 году.
После исполнения своей третьей песни под названием «Город-призрак», исполняя которую, он одел кепку «Сделаем Америку великой снова», исполнитель выступил с речью против демократов и поддержал Трампа.
«Очень часто я разговариваю с белыми людьми, и они спрашивают меня: "Как ты можешь поддерживать Трампа, он же расист?".
Ну, если бы меня волновали вопросы расизма, я бы уже давно уехал из Америки», — сказал исполнитель.
Канал SNL сделал пародийное шоу с Мэттом Дэймоном в главной роли, в котором голливудская звезда высмеивала показания Бретта Кавано перед Судебным комитетом Сената по заявлениям Кристины Блейси Форд о сексуальном домогательстве.
По телевидению не показали, как толпа возмутилась высказыванием Уэста, но эта видеозапись была загружена в социальные сети комиком Крисом Роком.
Сейчас неясно, пытался ли Рок этим шагом высмеять Уэста.
Кроме того, Уэст пожаловался публике на то, что за кулисами высмеяли его кепку.
«Они прикалывались надо мной за сценой.
Говорят, не выходи в этой кепке.
Они реально прикалывались надо мной!
Washington Examiner цитирует его слова: «А еще они сказали, что моя позиция не крутая».
Уэст продолжает: «А хотите знать, что не круто? Надеть плащ супермена, чтобы никто не мог сказать тебе, что надо делать. Хотите ли вы, чтобы мир продолжал развиваться?
Тогда вам нужна любовь».
Его комментарии, по крайней мере, дважды привлекли внимание аудитории, члены актерского состава SNL казались растерянными, а один человек сказал изданию: «Вся студия погрузилась в тишину».
Уэста пригласили в последний момент в качестве замены певицы Ариане Гранде, чей бывший парень, рэпер Мак Миллер, умер за несколько дней до этого.
Многих озадачило исполнение Уэстом песни «I Love it» в костюме бутылки Perrier.
Уэст получил поддержку главы консервативной группы TPUSA Кэндис Тернер, которая написала в Твиттере: «Одному из самых смелых людей: СПАСИБО ЗА ПОДДЕРЖКУ МНОГИХ».
Ведущая ток-шоу Карен Хантер написала в Твиттере, что Уэст был просто «тем, кто он есть, и это абсолютно замечательно».
«Однако, я не хочу поддерживать кого-либо (покупая его музыку, одежду или иным образом поддерживая его творчество), кто, на мой взгляд, разделяет и распространяет идеологию, которая вредна для моего сообщества.
Он — свободный человек.
Как и мы», — сказала она.
Перед началом шоу рэпер объявил в Твиттере, что изменил свое имя, заявив, что теперь он «формально известен как Канье Уэст».
Он не первый артист, который меняет свое имя и идет по стопам Дидди, также известного как Пафф Дадди, Паффи и Пи Дидди.
У его коллеги, рэппера Снуп Дога изначально было имя Снуп Лайон, а в качестве другого примера можно, конечно же, привести исполнителя, недавно ставшего легендой, Принца, который изменил свое имя на символ, а затем на имя художника, ранее известного как «Принц» (Prince).
Попытка обвинения в убийстве из-за поножовщины в ресторане Белфаст
45-летний мужчина был обвинен в покушении на убийство после того, как в пятницу в одном из ресторанов на востоке Белфаста один из его посетителей скончался от ножевых ранений.
Инцидент произошел в Баллихакаморе, как сообщили в полиции.
Ожидается, что ответчик предстанет перед Белфастским мировым судом в понедельник.
Обвинения будут рассмотрены Государственной прокуратурой.
Звезда «Игры престолов» Кит Харингтон нападает на токсичную маскулинность
Кит Харингтон известен своей ролью размахивающего мечом Джона Сноу в жестоком средневековом фэнтезийном сериале HBO «Игра престолов».
Тем не менее, недавно 31-летний актер горячо раскритиковал стереотип героя-мачо, сказав, что такие персонажи часто внушают молодым людям мысль о том, что для того, чтобы тебя уважали, нужно непременно быть жестоким.
В своем интервью The ​​Sunday Times Culture Кит сказал, что он считает, что «что-то пошло не так», и задался вопросом, как решить проблему токсичной маскулинности в эпоху #MeToo.
Кит, который недавно женился на своей коллеге по фильму «Игра престолов», Роуз Лесли, своей ровеснице, признался, что он «весьма неравнодушен» к этой проблеме.
«Лично я довольно серьезно воспринимаю этот вопрос: где же мы ошиблись с восприятием мужественности?», — спрашивает актер.
«Чему мы учим подрастающих ребят, что на сегодняшний день имеем такую проблему?»
Кит считает, что телевидение может быть отчасти виновато в этом всплеске токсичной мужественности по причине слишком мускулинных персонажей.
Актер продолжает: «Что является врожденным, а что — приобретенным?
Чему такому учат по телевизору и на улицах, что заставляет молодых мужчин чувствовать, что они должны проявлять только какую-то одну определенную сторону мужественности?
Я думаю, что это действительно одна из самых больших проблем в наше время, и вопрос в том, как мы можем это изменить?
Потому что сегодня с молодыми людьми, действительно, что-то не так.
В интервью он также признался, что не будет участвовать ни в каких приквелах или сиквелах «Игр престолов», после того, как сериал закончится следующим летом, заявив, что он «покончил с баталиями и лошадьми».
С ноября Кит сыграет главную роль в заново снимающемся «Истинном Западе» Сэма Шепарда, рассказывающем о продюсере фильма и его брате, грабителе.
Актер недавно объявил, что он считает, что встреча с женой Роуз — это лучший финал «Игры престолов» для него.
«Я встретил свою жену на этом сериале, так что он подарил мне мою семью и дальнейшую жизнь», — говорит актер.
Роуз сыграла Игрист — предмет страсти персонажа Кита Джона Сноу в фентезийном сериале, удостоенном наград Эмми.
Пара отметила свадьбу в июне 2018 года в фамильном поместье Лесли в Шотландии.
ВИЧ/СПИД: Китай сообщает о 14-процентном росте новых случаев
Китай объявил о 14-процентном увеличении числа своих граждан, заболевших ВИЧ и СПИДом.
По словам представителей здравоохранения, в стране более 820 000 человек больны этими заболеваниями.
Только во втором квартале 2018 года было зарегистрировано около 40 000 новых случаев.
В подавляющем большинстве новых случаев заболевания передавались половым путем, что свидетельствует об изменении тенденций прошлого.
Традиционно ВИЧ быстро распространялся в некоторых районах Китая в результате переливания зараженной крови.
Однако, количество заражений ВИЧ именно этим путем было практически сведено к нулю, заявили представители китайского здравоохранения на конференции в провинции Юньнань.
Ежегодно число людей, заболевших ВИЧ и СПИДом в Китае, увеличивается на 100 000 человек.
Передача ВИЧ половым путем является острой проблемой в ЛГБТ-сообществе Китая.
Гомосексуализм был декриминализован в Китае в 1997 году, но дискриминация ЛГБТ все еще широко распространена.
Исследования подтверждают, что по причине консервативных ценностей страны 70-90% мужчин, имеющих половые контакты с мужчинами, в конечном итоге женятся на женщинах.
Во многих случаях передача заболеваний происходит по вине недостаточной защиты этих сексуальных меньшинств.
С 2003 года правительство Китая обещает всеобщий доступ к лекарствам против ВИЧ как часть усилий по решению этой проблемы.
Максин Уотерс опровергает информацию об утечке информации по вине сенаторов Республиканской партии, жалуясь на «опасную ложь» и «теории заговора»
Член парламента США Максин Уотерс в субботу отвергла обвинения в том, что один из ее сотрудников разместил личную информацию трех сенаторов-республиканцев США на страницах Википедии законодателей.
Демократ из Лос-Анджелеса утверждает, что иски были подделаны «ультраправыми» экспертами и веб-сайтами.
«Ложь, ложь и еще более подлая ложь», — заявляет Уотерс в своем Твиттере.
Сообщается, что опубликованная информация включает в себя домашние адреса и номера телефонов сенаторов США. Линдси Грэм, Южная Калифорния, Майк Ли и Оррин Хэтч, Юта.
Эта информация появилась в Интернете в четверг и была опубликована неизвестным лицом на Капитолийском холме во время слушаний в сенатской комиссии по обвинениям в сексуальных домогательств, выдвигаемым против кандидата в Верховный суд Бретта Кавано.
Утечка произошла через некоторое время после того, как три сенатора провели допрос Кавано.
Консервативные сайты, такие как Gateway Pundit и RedState, сообщили, что IP-адрес, который идентифицирует источник сообщений, был связан с офисом Уотерс, и обнародовали информацию о сотрудниках Уотерс, сообщает Hill.
«Это необоснованное утверждение является абсолютно ложным», — уверяет Уотерс.
«Член моего персонала, чья личность, персональная информация и безопасность были скомпрометированы в результате этих мошеннических действий, никоим образом не был ответственен за утечку этой информации.
Это необоснованное утверждение является полной ложью».
Заявление Уотерс сразу же вызвало критику в Интернете, в том числе со стороны бывшего пресс-секретаря Белого дома Ари Флейшера.
«Это — гневное отрицание», — пишет Флейшер.
«Это означает, что автор имеет темперамент, не подходящий для работы в Конгрессе.
Когда тебя обвиняют в чем-то, чего ты не делал, зачем сердиться?
И оправдываться тоже не нужно.
И копаться в мотивах обвинителей тоже не следует.
Надо оставаться спокойным и холодным».
Флейшер, казалось, сравнивал реакцию Уотерс с критикой демократов в отношении судьи Кавано, которого критики обвиняли в том, что он слишком зол во время слушаний в четверг.
Омар Наварро, кандидат от республиканцев, баллотирующийся на место Уотерс на промежуточных выборах, также высказал свои мысли в Твиттере.
«Если это правда, то это очень важно», — пишет он.
В своем заявлении Уотерс пишет, что ее офис предупредил «соответствующие власти и правоохранительные органы об этих мошеннических действиях.
«Мы позаботимся о том, чтобы преступники были найдены, — пишет она, — а также о том, чтобы они понесли юридическую ответственность за все свои действия, которые могут быть разрушительными и опасными для всех и каждого из моих сотрудников».
Джонни Инглиш наносит удар снова — слабая пародия на шпиона Роуэн Аткинсон
Сегодня стало традицией искать смыслы Brexit в любом новом фильме, в котором тем или иным образом фигурирует Великобритания; это относится и к новой пародийной шпионской франшизе «Агента Джонни Инглиш», производство которой  началось еще в 2003 году и продолжилось в 2011 году фильмом «Агент Джонни Инглиш: перезагрузка».
Станет ли самоироничная картина с лейтмотивом «очевидно, что мы все дерьмо» новой попыткой национального экспорта?
Во всяком случае, пучеглазый профан Джонни Инглиш с резиновым лицом получил свое право на хаос во второй раз — это его имя ярче всего намекает на то, что он представляет собой широкоэкранное комическое творение, предназначенное для неанглийской кинематографической аудитории.
Герой, конечно, туповатый секретный агент, который, несмотря на свои причудливые претензии на гламурный смузи, получил немного Clouseau, черты мистера Бина и порцию этого парня, внесшего одну единственную ноту в мелодию Chariots of Fire в Лондоне 2012 года на церемонии открытия Олимпиады.
Первоначально этот персонаж создавался на основе личности путешественника и загадочного «международного» Аткинсона, когда-то сыгравшего в забытой сейчас телевизионной рекламе Barclaycard, в которой герой оставляет после себя полный хаос.
В этом последнем выпуске JE есть один или два приятных момента.
Мне очень понравилась сцена, когда Джонни Инглиш приближался к вертолету, одетый в средневековые доспехи, а лопасти лязгают по его шлему.
Да, в ней демонстрируется дар Аткинсона к физическому исполнению комедийных сцен, но сам юмор кажется довольно слабым и странно излишним, особенно потому, что такие «серьезные» кинопробы, как «Агент 007» и «Миссия невыполнима», теперь уверенно предлагают комедию в качестве элемента.
Такое ощущение, что юмор рассчитан на детей, а не на взрослых, и для меня причудливые злоключения Джонни Инглиша не так изобретательны и уместны, как приколы Аткинсона в фильмах о мистере Бине.
Постоянный посыл сейчас заключается в том, что Великобритания в серьезной беде.
Кибер-хакер проник в сверхсекретную шпионскую британскую сеть, раскрыв личность всех британских агентов на местах, к ужасу дежурного агента — Кевину Элдону здесь, к сожалению, досталась эпизодическая роль.
Это последняя капля для премьер-министра, напыщенной и напористой фигуры, уже страдающей от огромной политической непопулярности: Эмма Томпсон делает все возможное для персонажа квази-Терезы-Мэй, но в сценарии не с чем работать.
Ее советники по разведке сообщают ей, что, поскольку каждый активный шпион был скомпрометирован, ей придется вывести кого-то из отставки.
И тут на сцену выступает сам неуклюжий Джонни Инглиш собственной персоной, который сейчас работает школьным учителем в каком-то понтовом заведении, но также дает неофициальные уроки секретной оперативной работы: здесь есть несколько хороших шуток, поскольку Инглиш предлагает навыки шпионской академии в стиле «рок».
Инглиш возвращается обратно в Уайтхолл для экстренного инструктажа и воссоединяется со своим бывшим незадачливыми приятелем Бафом, которого и в этот раз играет Бен Миллер.
Баф теперь женатый человек, подчиняющийся командиру подводной лодки — роль «веселых хоккейных клюшек», в которой Викки Пеппердин немного теряется.
Итак, Бэтмен и Робин снова в игре по причине того, что в секретной службе Её Величества произошли ужасные ошибки. Они сталкиваются с красивой роковой женщиной Офелией Буллетовой в исполнении Ольги Куриленко.
Тем временем премьер-министр опасным образом попадает под чары харизматичного технологического миллиардера, который утверждает, что может решить британские компьютерные проблемы — зловещий Джейсон Вольта, которого играет Джейк Лейси.
Инглиш и Баф начинают свою одиссею фарсовых шуток: замаскированные под официантов, они поджигают французский ресторан; они создают хаос, контрабандой перевозя себя на роскошной яхте Вольта; Инглиш порождает сплошную анархию, пытаясь использовать гарнитуру виртуальной реальности, чтобы ознакомиться с интерьером дома Вольта.
Все эти сцены, конечно же, являются милой и задорной выдумкой, но во всем этом есть что-то совсем детское.
Вполне умеренные вещи.
И, как и в случае с другими фильмами Джонни Инглиша, я не мог не думать: разве британская киноиндустрия не может дать Роуэну Аткинсону роль, действительно соразмерную его таланту?
Лейбористы отрицают, что они разрабатывают план сокращения рабочей недели британцев до четырех дней за пятидневную зарплату
Лейбористская партия Джереми Корбина собирается рассмотреть радикальный план, согласно которому британцы будут работать четыре дня в неделю, но оплату будут получать за пять дней.
Партия, как сообщается, хочет, чтобы руководители компаний отдали работникам сбережения, полученные в результате революции в области искусственного интеллекта, предоставив им дополнительный выходной.
Это позволило бы сотрудникам наслаждаться трехдневными выходными за ту же самую заработную плату.
Источники сообщили, что идея «вписывается» в экономическую повестку дня партии и поможет населению страны стать на сторону рабочих.
Конгресс профсоюзов одобрил переход на четырехдневную рабочую неделю, чтобы работники могли воспользоваться преимуществами меняющейся экономики.
Высокопоставленный источник лейбористской партии сказал The Sunday Times: Ожидается, что о пересмотре политики будет объявлено до конца года.
«Это не произойдет в одночасье, но четырехдневная рабочая неделя — это наша цель, которая соответствует подходу партии к изменению балансов в экономике в пользу рабочих, а также общей промышленной стратегии партии».
Лейбористская партия не первая, кто поддерживает эту ​​идею, поскольку Партия зеленых обещала четырехдневную рабочую неделю еще во время своей предвыборной кампании 2017 года.
Однако это стремление в настоящее время не одобряется большинством лейбористской партии.
Представитель лейбористской партии сказал: «Четырехдневная рабочая неделя не является политикой партии и не рассматривается партией».
Теневой канцлер Джон Макдоннелл использовал конференцию лейбористов на прошлой неделе, чтобы конкретизировать свое видение социалистической революции в экономике.
Г-н Макдоннелл сказал, что он полон решимости вырвать власть у «безликих директоров» и «спекулянтов» коммунальных фирм.
Планы теневого канцлера также означают, что нынешние акционеры водоканалов могут не получить обратно всю свою долю, поскольку лейбористское правительство может делать «вычеты» на основании предполагаемых проступков.
Он также подтвердил планы по включению рабочих в советы директоров компаний и созданию фондов Inclusive Ownership Funds, чтобы передать 10% капитала фирм частного сектора рабочим, которые смогут получать ежегодные дивиденды в размере до 500 фунтов стерлингов.
Линдси Грэм и Джон Кеннеди рассказывают «60 минут», может ли расследование ФБР в отношении Кавано изменить их мнение
Расследование ФБР обвинений в адрес судьи Бретта Кавано задержало окончательное голосование по его назначению на пост верховного судьи как минимум на неделю и ставит вопрос о том, могут ли выводы агентства побудить кого-либо из сенаторов-республиканцев поддержать Кавано.
В интервью, показанном в воскресенье, корреспондент «60 минут» Скотт Пелли брал интервью у сенаторов-республиканцев Джона Кеннеди и Линдси Грэма, могут ли ФБР найти что-нибудь, что заставит их изменить свое мнение.
Кеннеди казался более открытым, чем его коллега из Южной Каролины.
«Ну конечно», — ответил Кеннеди.
«Идя на заседание, я говорил, что разговаривал с судьей Кавано.
Я позвонил ему после того, как это случилось, всплыла эта информация, я спросил: «Ты сделал это?»
Его ответ был решительным, определенным и однозначным».
Но мнение Грэма при голосовании осталось незыблемым.
«Я твердо определился по поводу Бретта Кавано, и мое мнение можно изменить только аргументами, по силе действия сравнимыми разве что с динамитом», - сказал он.
«Доктор Форд, я не знаю, что произошло, но одно я знаю наверняка: Бретт решительно отрицал все это», — добавил Грэм, обращаясь к Кристине Блейси Форд.
«Никто из тех, кого она вызывала в качестве свидетелей, также не могли подтвердить эти факты.
Этой истории уже 36 лет.
И ничего нового в ней я не заметил».
Что такое Global Citizen Festival (Фестиваль граждан мира) и сделал ли он что-нибудь для снижения уровня бедности?
В эту субботу в Нью-Йорке пройдет Global Citizen Festival (Фестиваль граждан мира) — ежегодное музыкальное событие, в котором принимает участие впечатляющий звездный состав с не менее впечатляющей миссией — конец бедности во всем мире.
Уже седьмой год в рамках Фестиваля граждан мира как десятки тысяч людей стекаются на большую лужайку Центрального парка, но не только для того, чтобы насладиться выступлениями таких исполнителей, как Джанет Джексон, Карди Б и Шон Мендес, а также для того, чтобы рассказать о настоящей цели мероприятия: искоренение крайней нищеты к 2030 году.
Фестиваль граждан мира, который был открыт в 2012 году, является продолжением глобального проекта по борьбе с бедностью, которую проводит международная группа правозащитников, надеющаяся покончить с бедностью, увеличив число людей, активно борющихся с ней.
Чтобы получить бесплатный билет на мероприятие (если вы не готовы платить за VIP-билет), вы должны были участвовать в волонтерской деятельности или отправить электронное письмо мировому лидеру, сделать телефонный звонок или выполнить любое другое или другие значимые действия, направленные на то, чтобы помочь повысить осведомленность о своей цели покончить с бедностью.
Но насколько успешным стал Фестиваль граждан мира за 12 лет в плане достижения своей цели?
Является ли идея вознаграждения людей свободным посещением концерта по-настоящему убедить сограждан требовать призыва к действиям, или это просто еще один случай так называемого «кликтивизма», когда люди верят, что они вносят реальные изменения, подписывая онлайн-петицию или отправляя сообщения в Твиттере?
Организаторы Global Citizen заявляют, что с 2011 года на фестивале было зарегистрировано более 19 миллионов «акций», проведенных его сторонниками, которые преследуют множество различных целей.
Упоминается, что благодаря этим действиям мировые лидеры пообещали выделить средства на сумму более 37 млрд. долл. США, которая должна повлиять на жизнь более 2,25 млрд. человек к 2030 году.
В начале 2018 года группа озвучила 390 обязательств и объявлений, которые были сделаны в результате ее действий, по крайней мере 10 миллиардов долларов из которых уже были выплачены или собраны.
По оценкам группы, выделенные фонды оказали непосредственную помощь почти 649 миллионам человек по всему миру.
Одно из наиболее значимых обязательств носит название The Power of Nutrition: британское партнерство инвесторов и специалистов по внедрению, приверженных делу «помогать детям полностью раскрыть свой потенциал», обещало предоставить Руанде 35 миллионов долларов, чтобы помочь положить конец недоеданию в округе. Это было сделано после получения более 4700  твитов от участников Global Citizens.
«При поддержке со стороны правительства Великобритании, доноров, национальных правительств и Global Citizens, таких как вы, мы можем сделать социальную несправедливость в отношении недостаточного питания минувшей ​​историей», — сказала посол Power of Nutrition Трейси Уллман во время живого концерта в Лондоне, состоявшегося в апреле 2018 года.
Группа также заявила, что после того, как было предпринято более 5000 действий, призывающих Великобританию улучшить питание для матерей и детей, правительство объявило о финансировании проекта «Сила питания», который охватит 5 миллионов женщин и детей посредством мероприятий, призванных улучшить питание.
В ответ на один из часто задаваемых вопросов на веб-сайте фестиваля: «Почему вы думаете, что мы можем покончить с крайней бедностью?»
Организаторы Global citizen отвечают: «Это будет долгий и трудный путь, на котором мы будем время от времени спотыкаться и падать.
Но, как в великих движениях борьбы за гражданские права и против апартеида, мы добьемся успеха, потому что вместе мы сильнее.
Джанет Джексон, Уикенд, Шон Мендес, Карди Б, Жанель Монэ — вот некоторые из артистов, которые выступят на мероприятии этого года в Нью-Йорке, а его  ведущими станут Деборра-Ли Фернесс и Хью Джекман.
США могут использовать военно-морской флот с целью «блокады», чтобы воспрепятствовать экспорту российской энергии: министр внутренних дел
Министр внутренних дел США Райан Зинке заявил, что Вашингтон может «при необходимости» прибегнуть к помощи своего военно-морского флота, чтобы предотвратить попадание российских энергоносителей на рынки, в том числе на Ближнем Востоке.
Зинке утверждает, что присутствие России в Сирии,  особенно там, где она действует по приглашению законного правительства, является предлогом для изучения новых энергетических рынков.
«Я считаю, что причина, по которой они находятся на Ближнем Востоке, заключается в том, что они хотят торговать энергией так же, как они делают это в Восточной Европе,в  южной части Европы», — говорит он.
И, по словам чиновника, для решения этой проблемы есть определенные способы и средства.
«Соединенные Штаты совместно с нашим флотом имеют возможность обеспечить открытость морских путей и, в случае необходимости, блокаду, чтобы их энергия не поступала на рынок», — говорит министр.
Зинке обратился к участникам мероприятия, организованного Consumer Energy Alliance, некоммерческой группой, которая позиционирует себя как «голос потребителя энергии» в США.
Далее он сравнивает подходы Вашингтона к отношениям с Россией и Ираном, отметив, что они фактически одинаковы.
«Экономическая стратегия Ирана и России — это более или менее эффективное использование и замена топлива», — говорит министр, называя Россию «пони с одним трюком», экономика которой зависит от ископаемого топлива.
Заявления прозвучали в связи с тем, что администрация Трампа поставила задачу увеличить экспорт своего сжиженного природного газа в Европу, заменив Россию, предлагающую гораздо более дешевый вариант для европейских потребителей.
Для этого чиновники администрации Трампа, включая самого президента США Дональда Трампа, пытаются убедить Германию выйти из «неуместного» проекта трубопровода «Северный поток-2», который, по словам Трампа, сделал Берлин «пленником» Москвы.
В Москве неоднократно подчеркивали, что проект «Северный поток-2» стоимостью 11 миллиардов долларов, который должен удвоить существующую пропускную способность трубопровода до 110 миллиардов кубометров, является чисто экономическим проектом.
Кремль утверждает, что яростное сопротивление Вашингтона этому проекту обусловлено экономическими причинами и является примером недобросовестной конкуренции.
«Подчеркиваю, что мы разделяем мнение о том, что энергия не может быть инструментом для оказания давления и что потребители должны иметь возможность выбирать поставщиков», — заявил министр энергетики России Александр Новак после встречи с министром энергетики США Риком Перри, состоявшейся в сентябре в Москве.
Позиция США вызвала негативную реакцию Германии, которая подтвердила свою приверженность проекту.
Немецкие промышленники в лице Федерации немецкой промышленности (BDI), призвали США держаться подальше от энергетической политики ЕС и двусторонних соглашений между Берлином и Москвой.
«Когда третье государство вмешивается в наши поставки энергии, это создает серьезную проблему», — сказал Дитер Кемпф, глава Федерации немецкой промышленности (BDI) после недавней встречи канцлера Германии Ангелы Меркель и президента России Владимира Путина.
Сенатор от штата Массачусетс Элизабет Уоррен будет тщательно изучать возможности баллотирования на пост президента в 2020 году
Сенатор от штата Массачусетс Элизабет Уоррен заявила в субботу, что будет тщательно изучать возможности баллотирования на пост президента после промежуточных выборов.
На заседании городской думы в Холиоке, штат Массачусетс, Уоррен подтвердила, что она подумает об участии в предвыборной гонке.
«Пришло время женщинам поехать в Вашингтон и “починить” наше сломанное правительство, а для этого “наверху” нужна женщина», — говорит Уоррен The Hill.
«После 6 ноября я буду тщательно рассматривать возможность баллотирования в президенты».
Уоррен так оценила деятельность президента Дональда Трампа во время заседания: «ведет этот округ в неверном направлении».
«Я до мозга костей обеспокоена тем, что Дональд Трамп делает с нашей демократией», — сказала она.
Уоррен является открытым критиком как самого Трампа, так и его кандидата на должность верховного судьи Бретта Кавано.
В своем Твиттере в пятницу Уоррен написала: «Конечно, нам нужно провести расследование ФБР, прежде чем приступать к голосованию».
Однако опрос, опубликованный в четверг, показал, что большинство избирателей самой Уоррен не думают, что она должна баллотироваться в 2020 году.
Согласно опросу Центра политических исследований Университета Саффолка/Boston Globe пятьдесят восемь процентов «вероятных» избирателей Массачусетса заявили, что сенатор не должна баллотироваться.
Тридцать два процента респондентов, напротив, поддерживают ее планы.
Опрос показал, что население больше поддерживает бывшего губернатора Девала Патрика: 38 процентов поддерживают его возможное участие в выборах, а 48 процентов выступают против.
Другие известные имена демократов, которые обсуждались в связи с перспективой 2020 года, включают бывшего вице-президента Джо Байдена и сенатора Вермонта Берни Сандерса.
Байден утверждает, что он примет официальное решение к январю, сообщает Associated Press.
Сара Пэйлин рассказала о посттравматическом стрессовом расстройстве Трака Пэйлина на встрече с избирателями Дональда Трампа
Трек Пэйлин, 26 лет, поступив на службу в армию в сентябре, провел год в Ираке.
Он был арестован и обвинен в домашнем насилии в понедельник вечером
«Мой сын, вернувшийся домой, переживает сейчас то же самое, что и члены других семей, испытывающие последствия ПТСР и имевшие ранения, а наши солдаты возвращаются с ранениями», — сказала она на встрече с Дональдом Трампом в Талсе, Оклахома.
Пэйлин назвала его арест «бельмом на глазу» и сказала о своем сыне и других ветеранах войны: «они возвращаются уже другими, закаленными, задаваясь вопросом, а оказывается ли такое же уважение их товарищам, солдатам, летчикам и любым другим военным, какое они оказали своей стране».
Трак Пейлин был арестован в понедельник в Василле, Аляска, и обвинен в семейном насилии по отношению к женщине, вмешавшись в ситуацию с насилием и хранением оружия в состоянии алкогольного опьянения, по словам Дана Беннетта, представителя департамента полиции Василлы.
18 штатов, округ Колумбия, поддерживают вызов новой политике предоставления убежища
Восемнадцать штатов и округ Колумбия поддерживают правовое оспаривание новой политики США, которая запрещает предоставление убежища жертвам бегства или домашнего насилия.
По сообщению NBC News, представители 18 штатов и округа подали в пятницу в Вашингтоне аналитическую записку консультанта суда о поддержке просителя убежища, оспаривающего политику.
Полное имя истца в иске «Grace против Sessions», поданном Американским союзом гражданских свобод в августе против федеральной политики, не разглашается.
Женщина утверждает, что ее гражданский муж «и его сыновья, состоящие в преступной группировке», подвергли ее жестокому обращению, но 20 июля чиновники США отклонили ее просьбу о предоставлении убежища.
Она была задержана в Техасе.
Адвокаты штатов, поддерживающие Грейс, говорят о том, что Сальвадор, Гондурас и Гватемала подают большое количество заявок на предоставление убежища в США, как страны, сталкивающиеся с широко распространенными проблемами с преступными группировками и насилием в семье.
Новая политика США в отношении предоставления убежища отменила решение, принятое Советом по апелляциям иммигрантов в 2014 году, которое позволяло иммигрантам без документов, спасающимся от домашнего насилия, подавать заявление на предоставление убежища.
Генеральный прокурор округа Колумбия Карл Расин заявил в своем заявлении в пятницу, что новая политика «игнорирует десятилетия применения государственного, федерального и международного права».
«Федеральный закон требует, чтобы все ходатайства о предоставлении убежища рассматривались на основании конкретных фактов и обстоятельств иска, и такой запрет нарушает этот принцип», — говорится в сообщении судебного консультанта.
Адвокаты также утверждают, что политика, запрещающая въезд иммигрантам, наносит ущерб экономике США, подчеркивая, что именно эта категория граждан с большей вероятностью становится предпринимателями и «обеспечивает необходимую рабочую силу».
В июне генеральный прокурор Джефф Сэшнс отдал приказ иммиграционным судьям больше не предоставлять убежище жертвам, спасающимся от домашнего или бандитского насилия.
«Убежище будет предоставлено тем, кто покидает свою страну из-за преследований или страха по причине расы, религии, национальности или принадлежности к определенной социальной группе или по политическим убеждениям», — сказал Сэшнс в своем заявлении от 11 июня.
Этот инструмент никогда не предназначался для решения абсолютно всех проблем, даже самых серьезных, с которыми люди сталкиваются каждый день во всем мире.
Отчаянные усилия по спасению людей в Палу: число погибших удваивается в поисках выживших
Для выживших ситуация становилась все более тяжелой.
«Сейчас очень трудно», — говорит 35-летняя мама Риса Кусума, утешая своего больного малыша в эвакуационном центре разрушенного города Палу.
«Каждую минуту скорая помощь привозит раненых.
Чистая вода в большом дефиците».
Жители возвращаются в свои разрушенные дома, копаются в мокрых вещах и пытаются спасти все, что могут найти.
Сотни людей получили ранения, а больницы, пострадавшие от землетрясения магнитудой 7,5, перегружены.
Некоторые из раненых, в том числе Дви Харис, у которого был перелом позвоночника и плеча, отдыхали возле армейского госпиталя Палу, где пациенты проходили лечение на открытом воздухе, потому что были вынуждены покинуть помещение из-за продолжающихся сильных толчков.
Он плачет, вспоминая, как сильное землетрясение разрушило номер в отеле на пятом этаже, который он снимал со своими женой и дочерью.
«Времени на спасение не было.
Я думаю, что меня втиснуло в обломки стены, — рассказывает Харис Associated Press, поясняя, что его семья приехала в город на свадьбу.
«Я услышал, как закричала моя жена, прося о помощи, а потом наступила тишина.
Я не знаю, что случилось с ней и с нашим ребенком.
Надеюсь, что они спаслись и сейчас с ними все в порядке».
Посол США обвиняет Китай в «нападках», осуществляемых посредством «пропагандистской рекламы»
Через неделю после того, как одна из официальных китайских газет опубликовала в ежедневном американском издании рекламу на четырех страницах, рассказывающую о взаимной выгоде торговли США и Китая, посол США в Китае обвинил Пекин в использовании американской прессы для распространения пропаганды.
Президент США Дональд Трамп в прошлую среду сослался на платное дополнение Des Moines Register China Daily, крупнейшего коммерческого газетного издания штата Айова, выступив с обвинениями в адрес Китая в попытке вмешаться в выборы в Конгресс США, которые состоятся 6 ноября. Это обвинение Китай отрицает.
Обвинение Трампа в том, что Пекин пытается вмешаться в выборы в США, является подтверждением того факта, о котором официальные лица США сообщили агентству Reuters: наступает новый этап в усиливающейся кампании Вашингтона по оказанию давления на Китай.
В то время как для иностранных правительств является  нормой размещать рекламу для продвижения торговли, Пекин и Вашингтон в настоящее время находятся в состоянии эскалации торговой войны, в результате которой они уравнивают тарифы на импорт своих стран.
Ответные тарифы Китая в начале торговой войны имели задачу поразить экспортеров в таких штатах, как Айова, которые поддерживали Республиканскую партию Трампа, заявили китайские и американские эксперты.
Терри Бранстад, посол США в Китае и бывший долгосрочный губернатор Айовы, крупного экспортера сельскохозяйственной продукции в Китай, утверждает, что Пекин нанес ущерб американским рабочим, фермерам и бизнесу.
Китай, пишет Branstad в статье, опубликованной в воскресном журнале Des Moines Register,, «теперь удваивает эту травлю, размещая пропагандистскую рекламу в нашей собственной свободной прессе».
«Распространяя свою пропаганду, правительство Китая пользуется дорогой нашему сердцу американской традицией свободы слова и свободной прессы, проплачивая и размещая рекламу в Des Moines Register», — пишет Бранстад.
«Однако в газетных киосках здесь, на улицах Пекина, вы вряд ли услышите инакомыслящие голоса и не увидите истинного разнообразия мнений, с которыми китайцы могли бы ознакомиться, узнав о тревожной экономической политике Китая, ведь местные СМИ находятся под жестким контролем коммунистической партии Китая», — пишет он.
Он также добавил, что одна из самых известных китайских газет «ловко открестилась» от предложения опубликовать его статью, хотя не привел точное название издания.
Аналитики предупреждают: разносом Кавано республиканцы отталкивают женщин-избирателей накануне промежуточного периода
Многие высокопоставленные республиканцы предпочитают оставаться в стороне и защищают кандидатуру верховного судьи Бретта Кавано, несмотря на несколько заявлений о сексуальном насилии. Аналитики предупреждают, что здесь прослеживается негативная реакция, особенно со стороны женщин, которая может отразиться на предстоящих промежуточных выборах.
Эмоции вокруг этой ситуации раскалились до крайности, и большинство республиканцев официально заявили, что они хотят продолжить голосование.
К таким вещам нельзя вернуться потом, — пишет Грант Риер, профессор политологии в школе Максвелла при Сиракузском университете, в своей статье, опубликованной в субботу.
Риер сомневается в том, что попытки сенатора Джеффа Флейка (R-Arizona) провести расследование ФБР, сделанной в самую последнюю минуту, будет достаточно, чтобы успокоить разгневанных избирателей.
«Женщины не собираются забывать о том, что произошло вчера. Они не забудут об этом ни завтра, ни в ноябре», — сказала в пятницу Карин Жан-Пьер, старший советник и национальный представитель прогрессивной группы MoveOn газете Washington, D.C.
В пятницу утром протестующие скандировали «Ноябрь впереди!» напротив Сената, когда республиканцы, контролирующие Судебный комитет, решили выдвигать кандидатуру Кавано, несмотря на показания доктора Кристин Блейси Форд, сообщает Mic.
«Демократический энтузиазм и мотивация выйдут за рамки», — заявил на новостном сайте беспартийный политолог Стю Ротенберг.
«Люди говорят, что ситуация и так накалилась уже достаточно сильно, и это правда.
Но все может стать хуже, особенно в плане избирателей-женщин в пригородах и молодых избирателей, от 18 до 29 лет, которые, хотя им не нравится президент, часто не голосуют».
Еще до того, как Форд публично свидетельствовала против кандидата на пост верховного судьи, обвиняя его в сексуальных домогательствах, аналитики предполагали, что если республиканцы подтвердят выдвижение, этот шаг может вызвать ответную реакцию.
«Это уже беспорядок для Республиканской партии», — сказал Майкл Стил, бывший председатель Республиканского национального комитета в начале прошлой недели, как сообщает NBC News.
«Речь идет не только о голосовании в комитете или окончательном голосовании или о том, сел ли Кавано на скамью подсудимых, но и о том, как республиканцы справляются с этим, как они к ней относятся», — говорит Гай Сесил, директор Priorities USA, группы, которая помогает избирать демократов, новостному каналу.
Тем не менее, американцы, похоже, несколько разделились по вопросу, кому все же верить — Форд или Кавано, и чуть больше склоняются на сторону последнего.
Новый опрос YouGov показывает, что 41 процент респондентов точно или скорее всего верят показаниям Форда, в то время как 35 процентов сказали, что они точно или скорее всего верят Кавано.
Кроме того, 38 процентов полагают, что Кавано скорее всего или определенно солгал во время дачи своих показаний, в то время как только 30 процентов сказали то же самое о Форд.
По настоянию Флейка ФБР в настоящее время расследует обвинения, выдвинутые Форд, а также, по крайней мере, еще одним обвинителем — Деборой Рамирес, сообщает The Guardian.
На прошлой неделе Форд под присягой свидетельствовала в Юридическом комитете Сената, что Кавано, будучи в состоянии опьянения, напал на нее, когда ей было 17 лет.
Рамирес утверждает, что кандидат на пост верховного судьи показал ей свои гениталии на вечеринке во время обучения в Йельском университете в 1980-х годах.
Изобретатель Всемирной паутины планирует запустить новый Интернет для Google и Facebook
Тим Бернерс-Ли, изобретатель Всемирной паутины, запускает стартап, который претендует на конкуренцию с Facebook, Amazon и Google.
Последний проект технологической легенды, Inrupt, представляет собой компанию, основанную на открытой платформе Berners-Lee Solid.
Solid позволяет пользователям выбирать, где хранить свои данные и каким людям давать доступ к какой информации.
В эксклюзивном интервью Fast Company Бернерс-Ли пошутил, что цель Inrupt заключается в получении «мирового господства».
«Мы должны сделать это сейчас», — так говорит он о своем стартапе.
«Это исторический момент».
В приложении используется технология Solid, которая позволяет людям создавать свои собственные «личные онлайн-хранилища данных» или POD.
Оно может содержать списки контактов, дел, а также календарь, музыкальную библиотеку и другие личные и профессиональные инструменты для работы с данными.
Приложение работает по такому же принципу, как и Google Drive, Microsoft Outlook, Slack и Spotify — всё можно использовать в одном браузере и одновременно.
Уникальность личного онлайн-хранилища данных заключается в том, что оно полностью управляемо пользователем, который может получить доступ к любой необходимой информации.
Компания называет этот принцип «личным расширением прав и возможностей посредством данных».
По словам генерального директора компании Джона Брюса, идея Inrupt заключается в том, что компания предоставила ресурсы, процессы и соответствующие навыки, чтобы сделать Solid доступной для всех.
В настоящее время в состав компании входят Бернерс-Ли, Брюс, платформа безопасности, купленная IBM, несколько штатных разработчиков, с которыми заключен контракт на работу над проектом, и сообщество программистов-добровольцев.
Начиная с этой недели разработчики технологий по всему миру смогут создавать свои собственные децентрализованные приложения, используя инструменты, доступные на веб-сайте Inrupt.
Бернерс-Ли сказал, что он и его команда не ведут переговоры с Facebook и Google о том, стоит ли его компании вносить кардинальные изменения, в результате которых все их бизнес-модели полностью изменятся в одночасье.
«Мы не спрашиваем у них разрешения».
В своем посте на Medium, опубликованном в субботу, Бернерс-Ли написал, что «миссия Inrupt — предоставить коммерческую энергию и экосистему для защиты целостности и качества новой сети, построенной на Solid».
В 1994 году Бернерс-Ли преобразовал Интернет, создав консорциум World Wide Web в Массачусетском технологическом институте.
В последние месяцы голос Бернерса-Ли звучал довольно влиятельно в дебатах о нейтральности в сети.
Даже запуская Inrupt, Бернерс-Ли останется основателем и директором консорциума World Wide Web, Фонда Интернета и Института открытых данных.
«Я невероятно оптимистичен в отношении этой следующей эры Интернета», — говорит Бернерс-Ли.
Бернард Ванн: церковнослужитель, награжденный крестом Виктории во время Первой мировой войны
В истории англиканской церкви только один священник-воин был награжден крестом Виктории во время Первой мировой войны, и это событие было отмечено в его родном городе 100 лет спустя.
Подполковник Преподобный Бернард Ванн был награжден этой наградой 29 сентября 1918 года за участие в нападении на Белленглиз и Лёукур.
К сожалению, он был убит снайпером четыре дня спустя, так никогда не узнав, что он получил высшую британскую военную награду.
Памятник в честь этого события был торжественно открыт представлен его двумя внуками на параде в Рушдене, Нортгемптоншир, в субботу.
Один из его внуков, Майкл Ванн, сказал, что это «очень символично», что памятник был открыт ровно через 100 лет после того, как его дед получил награду.
Согласно «Лондонской газете» от 29 сентября 1918 года подполковник Ванн провел свой батальон через канал Сен-Кантен «в очень густом тумане и под сильным огнем полевых орудий и пулеметов».
Позже он бросился на линию огня и с «величайшей отвагой» повел группу вперед, а затем одной рукой бросил полевую пушку, сбив троих солдат подразделения.
Подполковник Ванн был убит немецким снайпером 4 октября 1918 года — чуть более чем за месяц до окончания войны.
72-летний внук героя Майкл Ванн сказал, что «он вряд ли смог бы поступить так же героически, но это смиряет».
Он и его брат доктор Джеймс Ванн также возложили венок по окончании парада, которым руководил Имперский молодежный оркестр Брентвуд.
Майкл Ванн сказал, что «для него большая честь принять участие в параде» и добавил, что «доблесть подлинного героя подтверждается поддержкой, которая будет оказана многими людьми».
Поклонники ММА не спали всю ночь, чтобы посмотреть Bellator 206, но вместо этого им показали свинку Пеппу
Представьте себе, что вы не спали всю ночь, чтобы посмотреть полный Bellator 206, но вам не дали увидеть главного события.
Таблица Сан-Хосе содержала 13 боев, в том числе шесть боев главной программы, бои транслировались всю ночь в прямом эфире на 5 канале телевидения Великобритании.
В 6 часов утра, когда Гегард Мусаси и Рори Макдональд готовились к встрече, болельщики  Великобритании были ошеломлены, увидев на экранах «Свинку Пеппа».
Некоторых болельщиков это совсем не впечатлило, ведь они не спали до утра именно для того, чтобы посмотреть бои.
Один из поклонников в Твиттере назвал это изменение вещания на детский мультфильм «какой-то больной шуткой».
«Вышло государственное постановление о том, что для 6 часов утра этот контент является неподходящим, поэтому им пришлось переключить на детские программы», — сказал Дейв Шварц, старший вице-президент Bellator по маркетингу и коммуникациям, когда его спросили о том, почему это произошло.
«Да, “Свинка Пеппа”.
Президент компании Bellator Скотт Кокер сказал, что они планируют составить расписание таким образом, чтобы в будущем бои могли также смотреть зрители из Великобритании.
«Что касается повторного показа, думаю, что мы сможем решить этот вопрос», — говорит Кокер.
«Но там воскресенье, шесть часов утра, а мы не сможем решить этот вопрос до воскресенья по нашему времени, а для них это уже будет понедельник.
Но мы приложим максимум усилий.
Поверьте, когда вещание было изменено, посыпалась куча текстовых сообщений, и все они имели далеко не дружественный характер.
Мы пытались сразу же решить эту проблему, думали, что это какой-то технический сбой.
Оказалось, что нет, это был вопрос государственной важности.
Обещаю, что в следующий раз такого точно не произойдет.
Мы будем сокращать количество боев до пяти вместо шести, как мы обычно делаем, а для фанатов мы стараемся увеличить это количество, но получился перебор.
Да, нехорошо получилось».
Desert Island Discs: Том Дейли испытывал чувство неполноценности из-за своей сексуальной ориентации
Олимпийский дайвер Том Дейли говорит, что он рос, чувствуя себя хуже всех из-за своей сексуальности, но именно это и дало ему мотивацию стать успешным.
24-летний спортсмен рассказал, что не понимал, что «не все такие, как он» до тех пор, пока не пошел в среднюю школу.
Выступая в первой программе Radio 4 Desert Island Discs, которую вела Лорен Лаверн, он сказал, что высказался о правах геев, чтобы дать другим «надежду».
Он также сказал, что победа на Олимпиаде стала волновать его меньше после того, как у него появился ребенок.
Постоянный ведущий многолетнего шоу Кирсти Янг из-за болезни взял отпуск на несколько месяцев.
Дейли, выступавший в роли главного гостя в программе Лаверна, сказал, что чувствовал себя «более ничтожным, чем кто-либо из сверстников», потому что его сексуальная ориентация считалась неприемлемой для общества, как для мальчиков, так и для девочек».
Он рассказывает: «До сегодняшнего дня эти чувства ничтожности и неуместности были вполне реальными, но они давали мне мне силу, и я смог добиться успеха».
Он хотел доказать, что он был «что-то значил», чтобы не разочаровывать всех, когда они в конце концов узнают о его сексуальной ориентации.
Двукратный бронзовый олимпийский медалист стал известным ЛГБТ-активистом и на своем выступлении на Играх Содружества в Австралии в этом году призвал страны декриминализировать гомосексуализм.
Он сказал, что выразил свое мнение, потому что ему повезло, что он смог жить открытой жизнью, без последствий, и хотел дать другим «надежду».
Трехкратный чемпион мира сказал, что чувства к мужчине, американскому режиссеру Дастину Лансу Блэку, с которым он познакомился в 2013 году, «застали его врасплох».
В прошлом году Дейли женился на лауреате Оскара, который на 20 лет старше его, но утверждает, что разница в возрасте никогда не была проблемой.
«Если в твоей жизни столько всего происходит в таком молодом возрасте», — он отправился на свою первую Олимпиаду в возрасте 14 лет, а его отец умер от рака три года спустя, — трудно найти ровесника, который имел бы такой же кардинально противоположный жизненный опыт.
Пара стала родителями в июне, у них родился сын, которого назвали Роберт Рэй Блэк-Дейли, и Дейли сказал, что «все его мировосприятие» изменилось.
«Если бы вы спросили меня в прошлом году, это было бы все о том, что “мне нужно выиграть золотую медаль”», — рассказывает спортсмен.
«Но знаете что, есть вещи и поважнее золотых олимпийских медалей.
Моя олимпийская золотая медаль — это Робби».
Его сын был назван в честь его отца Роберта, который умер в 2011 году в возрасте 40 лет от рака мозга.
Дейли рассказал, что его отец не хотел мириться с тем, что он умирает, и одна из его последних просьб — это  были билеты в первый ряд на соревнования «Лондон 2012».
«Я не мог сказать ему «Пап, тебя тогда уже не будет рядом, и ты не сможешь сидеть там в первом ряду», — рассказывает Дейли.
«Я держал его за руку, когда он перестал дышать, и только когда он фактически перестал дышать, я наконец понял, что он не был непобедимым», — говорит спортсмен.
В следующем году Дейли участвовал в Олимпийских играх 2012 года и выиграл бронзу.
«Я просто знал, что это то, о чем я мечтал всю свою жизнь — нырять перед толпой соотечественников на Олимпийских играх, не было лучшего ощущения», — говорит он.
Это также вдохновило его на выбор первой любимой песни — Proud by Heather Small — которая помогла ему готовиться к Олимпиаде и до сих пор так нравится ему.
Desert Island Discs, BBC Radio 4, воскресенье, 11:15 по английскому летнему времени.
Микельсон, находящийся не в форме, провел эту субботу Кубка Райдера на скамье
Американец Фил Микельсон установит рекорд в воскресенье, сыграв свой 47-й матч Кубка Райдера, но ему придется подтянуть форму, чтобы избежать неприятной вехи.
Микельсон, игравший на биеннале в рекордный 12-й раз, был отправлен капитаном Джимом Фьюриком на скамью в субботу за четыре мяча и четверки.
Вместо того, чтобы быть в центре событий, как это часто бывало в Соединенных Штатах, пятикратный крупный победитель разделил свой день между наблюдением за игрой и работой над своей собственной игрой на поле в надежде исправить то, что его беспокоит.
Никогда не обладав самым прямым ударом, даже на пике своей карьеры 48-летний спортсмен не является идеальным кандидатом для жесткой трассы Le Golf National, где длинный раф обычно наказывает за неточные удары.
И если сам по себе курс не является достаточно пугающим, Микельсон в девятом матче в воскресенье встретится с точным чемпионом British Open Франческо Молинари, который объединился с новичком Томми Флитвудом, чтобы выиграть все четыре матча на этой неделе.
Если американцы, проигравшие четыре очка в 12-и одиночных матчах, сделают ярый старт, матч Микельсона может оказаться решающим.
Ферик выразил уверенность в своем партнере, хотя, что еще он мог сказать.
«Он полностью понимал роль, возложенную на него сегодня, похлопал меня по спине, обнял и сказал, что завтра будет готов», — прокомментировал Ферик.
«Он довольно уверен и в себе.
Он ходячий Зал Славы, и он так много сделал для этих команд и в прошлом, и на этой неделе.
Я, вероятно, не предполагал, что он сыграет два матча.
Я надеялся на большее, но так оно и было, и таким путем мы решили идти.
Он хочет быть там, вместе со всеми».
В воскресенье Микельсон побьет рекорд Ника Фолдо по количеству матчей в Кубке Райдера.
Это может ознаменовать конец карьеры в Кубке Райдера, которая никогда не соответствовала высотам его индивидуального рекорда.
Микельсон имеет 18 побед, 20 поражений и семь ничьих, хотя Ферик сказал, что его присутствие принесло команде немалую пользу.
«Он забавный, саркастичный, остроумный, любит подначивать людей, и он отличный парень, с которым интересно», — объяснил он.
«Я думаю, что на этой неделе молодые игроки повеселились с ним, и на это было интересно посмотреть.
Его игра — это намного больше, чем просто игра».
Капитан европейской команды Томас Бьорн знает, что большое преимущество может скоро исчезнуть
Томас Бьорн, капитан европейской команды, по своему опыту знает, что значительное лидерство в одиночном разряде в Кубке Райдера может легко обернуться в неблагоприятную сторону.
Датчанин дебютировал в матче в 1997 году в Вальдерраме, где команда, возглавляемая Северьяно Баллестеросом, имела преимущество в пять очков над американцами, но преодолела финишную черту лишь чуть-чуть впереди с наименьшей разницей, выиграв со счетом 14½- 13½.
«Вы продолжаете напоминать себе, что у нас было большое преимущество в Вальдерраме; у нас было большое преимущество в Бруклине, где мы проиграли, и в Вальдерраме, где мы выиграли, но только пока что», - сказал Бьорн, запечатленный на фотографии, после просмотра Класса 2018 года, выиграв на поле «Le Golf National» со счетом 5-3 как в пятницу, так и вчера, что в результате дало счет 10-6.
Так что история докажет мне и всей команде, что это еще не конец.
Завтра вы выложитесь на полную.
Иди и сделай все правильно.
До тех пор, пока на табло не выставлены очки – еще ничего не кончено.
У нас есть цель, а это шанс выиграть трофей, и именно на этом необходимо сосредоточиться.
Я говорил не умолкая, сосредоточившись на 12 игроках нашей команды, но мы и так прекрасно знаем, что против чего мы стоим – против величайших игроков мира».
Довольный тем, как его игроки выступили на неудобном для них поле для гольфа, Бьорн добавил: «Я бы никогда не превзошел себя в этом.
Завтра нас ждет иное испытание.
Завтра начинаются индивидуальные выступления, а это уже совсем другое дело.
Всегда приятно находиться рядом с партнером, когда дела идут хорошо, но, когда ты остаешься там один, ты испытываешь все свои силы профессионального гольфиста.
Именно такую мысль необходимо внушить игрокам, чтобы и самому завтра выложиться на полную.
Теперь партнер остается позади, и он тоже должен приложить все свои усилия».
В отличие от Бьорна, его соперник, Джим Ферик, считает, что в индивидуально его игроки будут выступать лучше, чем с партнерами, за исключением Джордана Спита и Джастина Томаса, набравших три очка из четырех.
Сам Ферик прошел всю эту карусель последних дней, став частью команды-победителя в Бруклине, прежде чем окончательно проиграть, когда Европа провела «Чудо в Медине».
«Я помню каждое чертово слово об этом», — сказал он в ответ на вопрос о том, как Бен Креншоу, капитан в 1999 году, сплотил своих игроков перед последним днем.
«У нас завтра 12 важных матчей, но вы хотели бы побыстрее закончить все это, как в Бруклине, как в Медине.
Когда инициатива движется в одну сторону, это оказывает большое давление на матчи в середине.
Мы соответствующим образом выстроили наш план на игру и настроили ребят так, как мы считали правильным, понимаете? Завтра мы постараемся сотворить чудо».
Томасу дали задание попытаться возглавить сопротивление, встретившись с Рори Макилроем в топ-матче с Полом Кейси, Джастином Роузом, Джоном Рамом, Томми Флитвудом и Айяном Полтером, а также другими европейскими игроками из верхней части турнирной таблицы.
«Я выбрал именно такую группу парней, и в таком порядке, потому что считаю, что таким образом они перекроют все возможные недостатки», — сказал Бьорн, комментируя свой выбор индивидуальных игроков.
Введение в эксплуатацию нового военного корабля Германии вновь отложено
Новейший фрегат немецкого флота должен был быть введен в эксплуатацию в 2014 году, чтобы заменить стареющие военные корабли эпохи холодной войны, но это не произойдет еще меньшей мере в следующем году из-за неисправных систем и лавинообразного роста стоимости, сообщают местные СМИ.
Ввод в эксплуатацию "Рейнланд-Пфальца", главного корабля совершенно новых фрегатов класса Баден-Вюртемберг, теперь отложен до первой половины 2019 года, сообщает газета Die Zeit со ссылкой на военного представителя.
Судно должно было присоединиться к флоту в 2014 году, но проблемы, которые возникли после поставки, осложнили судьбу амбициозного проекта.
Четыре судна класса Баден-Вюртемберг, заказанные военно-морским флотом в 2007 году, станут заменой стареющим фрегатам класса Бремен.
Насколько известно, они будут иметь мощную пушку, множество зенитных и противокорабельных ракет, а также некоторые технологии «стелс» — такие, как уменьшенные радиолокационные, инфракрасные и акустические сигнатуры.
Другие важные характеристики включают в себя более длительные периоды обслуживания — должна быть возможность развертывания новейших фрегатов на срок до двух лет вдали от домашних портов.
Тем не менее, постоянное откладывание ввода в эксплуатацию означает, что самые современные военные корабли, которые, как говорят, позволяют Германии распространять свою мощь за рубежом, уже устареют к тому времени, когда они поступят на вооружение, отмечает Die Zeit.
Злополучный фрегат F125 попал в заголовки новостей в прошлом году, когда германский военно-морской флот официально отказался от ввода в эксплуатацию судна и вернул его на верфи Blohm & Voss в Гамбурге.
Это стало первым случаем, когда флот вернул судно судостроителю после поставки.
Мало что было известно о причинах возвращения, но немецкие СМИ ссылались на ряд критических «программных и аппаратных дефектов», которые делали военный корабль бесполезным при использовании в бою.
Недостатки программного обеспечения были особенно критичны, поскольку суда класса Баден-Вюртемберг будут эксплуатироваться экипажем из примерно 120 моряков — только половина рабочей силы на старых фрегатах класса Бремен.
Кроме того, выяснилось, что корабль слишком тяжелый, что снижает его производительность и ограничивает способность ВМФ внедрять обновления в будущем.
Считается, что 7000-тонный «Рейнланд-Пфальц» в два раза тяжелее кораблей аналогичного класса, которые использовались немцами во Второй мировой войне.
Помимо неисправного оборудования, стоимость всего проекта, включая обучение команды, также становится проблемой.
Говорят, что она достигла ошеломляющих 3,1 млрд. евро (3,6 млрд. долларов) по сравнению с первоначальными 2,2 млрд. евро.
Проблемы удержания на якоре новейших фрегатов становятся особенно важными в свете недавних предупреждений о сокращении военно-морской мощи Германии.
Ранее в этом году Ханс-Петер Бартельс, глава комитета по обороне немецкого парламента, признал, что у военно-морских сил фактически «заканчивается запас кораблей, способных к развертыванию».
Чиновник сказал, что проблема со временем обострилась, потому что старые корабли были выведены из эксплуатации, но судов им на замену предоставлено не было.
Он посетовал, что ни один из фрегатов класса Баден-Вюртемберг так и не смог быть взят на вооружение флотом.
National Trust прослушивает тайную жизнь летучих мышей
Новое исследование, проведенное в одном из поместий Шотландского нагорья, имеет задачей показать, как летучие мыши используют ландшафт в поисках пищи.
Следует надеяться, что полученные данные позволят по-новому взглянуть на поведение уникальных крылатых млекопитающих и помогут в дальнейшей деятельности по сохранению вида.
В исследовании, организованном учеными Национального фонда Шотландии, будут изучены обыкновенные нетопыри, нетопыри soprano, а также коричневые длинношерстные летучие мыши и ночницы Добантона, населяющие Inverewe Gardens, Вестер Росс.
Специальные регистраторы будут установлены в некоторых точках вокруг места, чтобы отслеживать действия летучих мышей в течение всего сезона.
Сотрудники NHS и волонтеры также будут проводить мобильные обследования местности с использованием ручных детекторов.
Экспертный звуковой анализ всех записей определит частоту криков, а также виды деятельности, за которые отвечают различные группы этих животных.
Затем будет составлена ​​карта среды обитания и подготовлен отчет, чтобы создать детальную картину их поведения в масштабе ландшафта.
Роб Дьюар, советник по сохранению природы NTS, надеется, что эти результаты покажут, какие места обитания наиболее важны для летучих мышей и как они используются каждым из видов.
Эта информация поможет определить главные направления работы по управлению средой обитания, такой как формирование лугов, а также способы поддержания лесных массивов состоянии, оптимальном для летучих мышей и других связанных видов.
Популяции летучих мышей в Шотландии и по всей Великобритании значительно сократились за последнее столетие.
Они находятся под угрозой исчезновения по причине строительных и девелоперских работ, которые влияют на их обитание и утрату среды обитания.
Ветряные турбины и осветительные установки могут представлять опасность, также как клейкая лента для мух, химическая обработка строительных материалов и охота домашних кошек.
В действительности летучие мыши не слепые.
Однако, их ночные охотничьи привычки таковы, что их уши более полезны, чем глаза, когда дело доходит до ловли добычи.
Они используют сложную технику эхо-локации, чтобы точно определить препятствия на пути полета.
NTS, которая отвечает за уход за более чем 270 историческими зданиями, 38 значимыми садами и 76 000 гектарами земли по всей стране, очень серьезно относится к вопросам популяции летучих мышей.
В организации работают десять подготовленных экспертов, которые регулярно проводят опросы, выездные проверки, а иногда и спасательные работы.
Организация даже создала первую и единственную в Шотландии резервацию летучих мышей в поместье Threave в Дамфрисе и Галлоуэе, где проживает восемь из десяти видов шотландских летучих мышей.
Управляющий недвижимостью Дэвид Томпсон говорит, что имение является идеальной территорией для них.
«Здесь, в Threave, отличное место для летучих мышей», — говорит он.
«Здесь есть старые здания, много старых деревьев и все элементы хорошей среды обитания.
Но многое о летучих мышах остается неизвестным, поэтому работа, которую мы проводим здесь и в других местах, поможет нам лучше понять, что им нужно для благополучного существования».
Он напоминает о важности проверки на наличие летучих мышей перед проведением технического обслуживания в пределах частных владений, так как неумышленное уничтожение одного гнезда может привести к гибели до 400 самок и молодых особей, а, возможно, даже к уничтожению всей местной популяции.
Летучие мыши защищены законом, их уничтожение,  травля или разрушение мест их обитания является незаконным.
Элизабет Феррелл, шотландский офицер фонда по сохранению летучих мышей, призывает общественность на помощь.
Она говорит: «Нам еще многое предстоит узнать о наших летучих мышах, и мы просто не знаем, как проживают их многие отдельные виды».
Роналду отрицает обвинения в изнасиловании, а его адвокаты собираются подать в суд на немецкий журнал
Криштиану Роналду отрицает выдвигаемые против него обвинения в изнасиловании, называя их «фейковыми новостями», и утверждая, что люди просто «хотят пропиариться», используя его имя.
Его адвокаты собираются подать в суд на немецкий новостной журнал «Шпигель», опубликовавший обвинения против футболиста.
Форвард Португалии и Ювентуса был обвинен в изнасиловании американки по имени Кэтрин Майорга, которое якобы имело место в гостиничном номере Лас-Вегаса в 2009 году.
Он предположительно заплатил ей 375 000 долларов, чтобы она говорила об этом инциденте, сообщил в пятницу «Шпигель».
Выступая в видео в Instagram, в котором у футболиста 142 миллиона подписчиков, спустя несколько часов после сообщения об обвинениях, 33-летний Роналду назвал эту информацию «фейковыми новостями».
«Нет, нет, нет, нет, нет.
То, что они рассказали сегодня — это все фейковые новости, — утверждает пятикратный победитель Ballon d'Or на камеру.
«Они просто хотят пропиариться, используя мое имя.
Это нормально.
Они хотят стать знаменитыми, произнося мое имя, но это всего лишь часть их работы.
Я — счастливый человек, и все у меня отлично», — добавляет спортсмен с улыбкой.
Адвокаты Роналду готовятся подать в суд на «Шпигель» за обвинения, которые они назвали «недопустимой информацией о подозрениях в области конфиденциальности», согласно Reuters.
Адвокат Кристиан Шерц заявил, что игрок намерен требовать компенсацию за «моральный ущерб в размере, соответствующем серьезности правового нарушения, которое, вероятно, является одним из наиболее серьезных нарушений личных прав за последние годы».
Утверждается, что предполагаемый инцидент произошел в июне 2009 года в номере отеля Palms Hotel and Casino в Лас-Вегасе.
Познакомившись в ночном клубе, Роналду и Майорга якобы вернулись в комнату игрока, где он предположительно изнасиловал ее в анальной форме, согласно документам, поданным в Окружной суд Кларка в Неваде.
Майорга утверждает, что после предполагаемого инцидента Роналду упал на перед ней на колени и сказал ей, что он на «99 процентов хороший парень, но сплоховал на один процент».
В документах утверждается, что Роналду подтвердил, что пара занималась сексом, но это было по обоюдному согласию.
Майорга также утверждает, что она обратилась в полицию, а в больнице были сделаны снимки ее травм, но позже согласилась на внесудебное урегулирование, потому что она чувствовала «страх, что ей будут мстить» и боялась «публичного унижения».
34-летняя женщина говорит, что сейчас пытается изменить место жительства, поскольку она продолжает испытывать травмирующие чувства, нанесенные в результате предполагаемого инцидента.
Роналду собирался присоединиться к «Реал Мадрид» из «Манчестер Юнайтед» во время предполагаемого нападения, но этим летом перешел к итальянским гигантам «Юве» в сделке на 100 миллионов евро.
Brexit: Великобритания «пожалеет об автопроизводителях, потерянных навсегда»
Министр по делам бизнеса и предпринимательства Грег Кларк заявил, что Великобритания «пожалеет об этом навсегда», если после Brexit утратит свой статус мирового лидера в области производства автомобилей.
Он также прокомментировал информацию о том, что Toyota UK сообщила BBC, что если Великобритания выйдет из ЕС без сделки, она временно остановит производство на своем заводе в Бернастоне, недалеко от Дерби.
«Нам нужна сделка», — говорит г-н Кларк.
Японский автопроизводитель заявил, что последствия задержек на границе в случае отсутствия сделки в рамках Brexit могут повлечь за собой потерю рабочих мест.
Завод в Бернастоне производит Toyota Auris и Avensis, а в прошлом году он выпустил почти 150 000 автомобилей, 90% из которых было экспортировано в остальную часть Европейского Союза.
«Я считаю, что если Британия выйдет из ЕС в конце марта, производство на нашем заводе будет остановлено», — говорит Марвин Кук, управляющий директор Toyota в Бернастоне.
Другие производители автомобилей в Великобритании выразили опасения по поводу выхода из ЕС без соглашения о международной торговле, в том числе по Honda, BMW и Jaguar Land Rover.
BMW, к примеру, заявляет, что закроет завод по производству Mini в Оксфорде в течение месяца после Brexit.
Основные опасения связаны с тем, что, по словам автопроизводителей, в случае отсутствия сделки в рамках Brexit цепочки поставок будут поставлены под большой риск.
Производственная линия Toyota запускается «точно в срок», а детали для автомобилей, изготавливаемых на заказ, поставляются поставщиками Великобритании и ЕС каждые 37 минут.
Если 29 марта Великобритания выйдет из ЕС без сделки, на границе могут возникнуть сбои, которые, по словам представителей отрасли, могут привести к задержкам и нехватке запчастей.
По словам компании, Toyota не сможет хранить запасы на своем заводе в Дербишире дольше одного дня, и поэтому производство будет остановлено.
Г-н Кларк сказал, что план Терезы Мэй, озвученный в Чекерс, о будущих отношениях с ЕС «точно откалиброван, чтобы избежать этих проверок на границе».
«Нам нужна сделка. Мы хотим заключить лучшее соглашение, которое позволит, повторюсь, не только достичь успеха в настоящее время, но и воспользоваться этой возможностью в будущем», — рассказал он в эфире программы BBC Radio 4 «Сегодня».
«Не только Toyota, но и другие производители утверждают, что мы должны быть абсолютно в состоянии продолжать успешные цепочки поставок».
Toyota не смогла уточнить, на какой срок будет остановлено производство, но в более долгосрочной перспективе предупредила, что дополнительные расходы снизят конкурентоспособность завода и, в конечном итоге, приведут к сокращению рабочих мест.
Питер Цувалларис, который работал в Бернастоне в течение 24 лет и является руководителем профсоюза завода, говорит, обеспокоенность членов организации растет: «По моему опыту, если мы потеряем эти рабочие места, то уже не сможем их вернуть».
Представитель правительства говорит: «Мы разработали точный и надежный план наших будущих отношений с ЕС».
Встреча Трампа с Розенштейном может быть снова отложена, по информации Белого дома
Ответственная встреча Дональда Трампа с заместителем генерального прокурора Родом Розенштейном может быть «перенесена на другую неделю», поскольку борьба за кандидатуру Бретта Кавано на должность верховного судьи продолжается, заявил Белый дом в воскресенье.
Розенштейн курирует работу специального советника Роберта Мюллера, который расследует вмешательство России в выборы, связи между помощниками Трампа и Россией и потенциальные препятствия для правосудия со стороны президента.
Уволит ли Трамп заместителя генерального прокурора с должности, тем самым поставив под угрозу независимость Мюллера, в Вашингтоне на протяжении многих месяцев вызывало массу догадок.
Ранее в этом месяце газета New York Times сообщила, что Розенштейн обсудил вопрос об использовании провода для записи разговоров с Трампом и возможности импичмента президента с помощью 25-й поправки.
Розенштейн опровергает эту информацию.
Однако в прошлый понедельник он отправился в Белый дом якобы для того, чтобы подать в отставку.
Вместо этого на четверг была объявлена ​​встреча с Трампом, который был тогда в ООН в Нью-Йорке.
Трамп сказал, что он «предпочел бы не» увольнять Розенштейна, но затем встреча была отложена, чтобы избежать столкновения с судебным комитетом Сената, на котором Кавано и одна из женщин, которые обвиняли его в сексуальных домогательствах, доктор Кристина Блейси Форд, давали показания.
В пятницу Трамп распорядился провести недельное расследование по жалобам ФБР на Кавано, что еще больше задержало полное голосование в Сенате.
Пресс-секретарь Трампа, Сара Сандерс, выступила на Fox News в воскресенье.
Когда ей задали вопрос о встрече с Розенштейном, она ответила: «Дата этой встречи пока не была назначена, возможно, что на этой неделе, а, возможно, что она будет отложена еще на одну неделю с учетом всех других событий, происходящих в Верховном суде».
Но посмотрим, и я всегда предпочитаю держать прессу в курсе».
Некоторые журналисты оспаривают это утверждение: Сандерс не проводила брифингов в Белом доме с 10 сентября.
Ведущий Крис Уоллес поинтересовался, почему.
Сандерс говорит, что отсутствие брифингов не вызвано «презрением к сообществу» телевизионных репортеров, хотя она добавила: «Я не буду отрицать, что они играют на публику».
Она предложила увеличить количество прямых контактов между Трампом и прессой.
«Президент проводит больше встреч, отвечая на вопросы журналистов, чем любой другой президент до него», — добавила она, не приведя, однако, точных цифр: «У нас есть эти цифры».
Сандерс уверила, что брифинги по-прежнему будут проходить, но «если у прессы есть возможность напрямую задавать вопросы президенту Соединенных Штатов, это гораздо лучше, чем разговаривать со мной».
Мы стараемся делать это как можно чаще, и вы знаете, как много встреч мы провели за последние несколько недель, а если вы сможете напрямую поговорить с президентом Соединенных Штатов, это достойная замена пресс-брифингам».
Трамп регулярно отвечает на вопросы, выходя из Белого дома, участвуя в открытых встречах или пресс-конференциях с высокопоставленными лицами.
Конференции исключительно для прессы — это вообще редкость.
Фривольное, а временами странное поведение президента перед собравшимися журналистами на этой неделе в Нью-Йорке, возможно, является ответом, почему это так.
Министр здравоохранения обращается к работникам ЕС в Шотландии с письмом по поводу опасений насчет Brexit
Министр здравоохранения обратился к сотрудникам ЕС, работающим в шотландской ГСЗ, чтобы выразить благодарность от имение всей страны и пожелать им остаться на своих должностях после Brexit.
Джин Фриман, MSP, обратилась с этим письмом к сотрудникам менее, чем за шесть месяцев до выхода Великобритании из ЕС.
Правительство Шотландии уже взяло на себя обязательство покрыть стоимость оформление заявлений о статусе для граждан ЕС, работающих в своих государственных службах.
В своем письме г-жа Фриман пишет: «В течение лета переговоры между Великобританией и ЕС по вопросу о выходе продолжались, и этой осенью должно быть вынесено ожидаемое решение.
Однако правительство Великобритании также усиливает подготовку к возможному сценарию с отсутствием сделок.
Я знаю, что это, должно быть, очень тревожное время для всех вас.
Поэтому именно сейчас я хочу еще раз подчеркнуть, насколько я ценю вклад каждого сотрудника, независимо от его национальности.
Коллеги со всего ЕС и за его пределами привносят ценный опыт и навыки, которые укрепляют и улучшают работу службы здравоохранения и приносят пользу пациентам и сообществам, которым мы служим.
Шотландия — это, однозначно, ваш дом, и мы очень хотим, чтобы вы остались здесь».
Кристиан Аберкромби перенес экстренную операцию по поводу травмы головы
Майкл Орган из Теннеси сообщил, что полузащитник «Теннесси Стейтс Тигерс» Кристиан Аберкромби перенес экстренную операцию, получив травму головы в субботу после поражения 31–27 в матче с «Вандербильтом Коммодоресом».
Главный тренер штата Теннесси Род Рид заявил журналистам, что травма была получена незадолго до перерыва.
«Он вышел к боковой линии и просто рухнул там, — сказал Рид.
Тренеры и медицинский персонал дали Аберкромби кислород на боковой линии, прежде чем положить его на носилки и унести на медицинский осмотр.
Официальный представитель штата Теннесси сказал Крису Харрису из WSMV в Нэшвилле, штат Теннесси, рассказал, что Аберкромби была сделана операция в медицинском центре Вандербильта.
Харрис добавил, что «пока нет подробностей о типе/степени травмы», и в Теннесси пытаются выяснить, когда произошла травма.
Для Аберкромби, только поступившего на второй курс, это был первый сезон в составе «Теннесси Стэйт» после переезда из штата Иллинойс.
В субботу, перед выбыванием из игры, он успешно перехватил пять мячей, что в сумме составило 18 мячей за сезон.
Иностранные покупатели будут платить более высокий гербовый сбор при покупке недвижимости в Великобритании.
В соответствии с новыми планами Тори, с иностранных покупателей будет взиматься более высокий гербовый сбор при покупке недвижимости в Великобритании, а вырученные дополнительные денежные средства будут использованы для помощи бездомным.
Этот шаг сведет на нет результаты попыток Корбина привлечь молодых избирателей
Повышенный гербовый сбор будет взиматься с тех, кто не платит налог в Великобритании
Казначейство ожидает, что оно соберет до 120 миллионов фунтов стерлингов в год в пользу бездомных
С иностранных покупателей будет взиматься более высокий гербовый сбор при покупке недвижимости в Великобритании, а вырученные дополнительные денежные средства будут использованы для помощи бездомным — об этом сегодня объявит Тереза ​​Мэй.
Этот шаг сведет на нет результаты попыток Корбина привлечь молодых избирателей, который обещает сделать жилье более доступным и повысить доходы граждан.
Повышение гербового сбора будет взиматься с физических лиц и фирм, не платящих налог в Великобритании, а вырученные таким образом дополнительные средства должны стимулировать усилия правительства в оказании помощи бездомным гражданам.
Надбавка к существующему гербовому сбору, включая повышение, введенное два года назад на приобретение вторичного жилья и жилья для сдачи в аренду, может составить до трех процентов.
Казначейство ожидает, что этот шаг позволит выручить до 120 миллионов фунтов стерлингов в год.
По оценкам, 13 процентов новых лондонских объектов недвижимости покупаются не британскими жителями, что приводит к росту цен и усложняет задачу покупателям, приобретающим свое первое жилье, улучшать свои жилищные условия впоследствии.
Многие элитные районы страны, особенно в столице, стали «городами-призраками» из-за большого количества иностранных покупателей, которые, купив здесь жилье, проводят большую часть своего времени за пределами страны.
Новая политика была разработана спустя несколько недель после того, как Борис Джонсон призвал сократить гербовый сбор, чтобы помочь большему количеству молодых людей приобрести свой первый дом.
Он обвинил крупные строительные фирмы в задирании цен на недвижимость, приобретая земли, но фактически не используя их, и призвал г-жу Мэй отказаться от квот на доступное жилье, чтобы исправить «позорную ситуацию с жилищным строительством» в Британии.
Г-н Корбин объявил о ряде предлагаемых позитивных жилищных реформ, которые будут включать контроль за арендной платой и прекращение необоснованного выселения.
Он также хочет дать органам местного самоуправления больше полномочий для строительства новых домов.
Г-жа Мэй заявила: «В прошлом году я сказала, что посвятила свое премьерство исполнению британской мечты — чтобы жизнь становилась лучше с каждым новым поколением.
А это, в том числе, означает и решение проблем на нашем жилищном рынке.
Британия всегда будет открыта для людей, которые хотят жить, работать и строить жизнь здесь.
Тем не менее, это несправедливо, что для людей, не являющихся гражданами Великобритании, а также для иностранных компаний, приобретение недвижимости так же доступно, как и трудолюбивым британцам.
Для слишком многих людей мечта о приобретении собственного дома стала слишком далекой, а угроза для некоторых оказаться на улице — слишком реальной.
Джек Росс: «Моя конечная цель — управлять Шотландией»
Босс клуба Sunderland Джек Росс говорит, что его «конечная цель» — стать на определенном этапе менеджером Шотландии.
42-летний шотландец получает удовольствие от возрождения северо-восточного клуба, который в настоящее время занимает третье место в первой лиге, отделяющее от первенства тремя очками.
Этим летом он перешел в Stadium of Light после того, как вернул St Mirren обратно в шотландскую Премьер-лигу в прошлом сезоне.
«Я хотел сражаться за свою страну в качестве игрока.
Я получил кепку B, и все», — сказал Росс Sportsound BBC Scotland.
«Но я вырос, наблюдая в детстве со своим отцом за Шотландией в Хэмпдене, и это всегда меня привлекало обратно.
Однако такая возможность появится только в том случае, если я смогу стать успешным менеджером клуба».
Предшественниками Росса, менеджерами Sunderland были также Дика Адвокаат, Дэвид Мойес, Сэм Аллардайс, Мартин О'Нил, Рой Кин, Гас Пойет и Пауло Ди Канио.
Бывший менеджер Alloa Athletic говорит, что он не испытывал трепета перед подобными авторитетными именами в таких крупных клубах, ранее отказавшись от предложений Barnsley и Ipswich Town.
«Для меня успех на данный момент будет зависеть от того, смогу ли я вернуть этот клуб в Премьер-лигу.
По своей структуре и возможностям этот клуб, несомненно, принадлежит к Премьер-лиге», — говорит тренер.
«Вывести его туда — непростая задача, но я буду считать, что справился со своей задачей, только в том случае, если смогу вернуть клуб обратно».
Росс всего три года работает на должности управляющего, став сначала помощником управляющего в Dumbarton, затем проведя 15 месяцев в тренерском штабе Hearts.
Затем он помог Alloa подняться с третьего уровня и в следующем сезоне вывел St Mirren с нижних позиций в победители чемпионата.
Росс утверждает, что сегодня он чувствует себя более комфортно, чем когда-либо во время своей игровой карьеры в Clyde, Hartlepool, Falkirk, St Mirren и Hamilton Academical.
«Вероятно, это был настоящий перекресток», — вспоминает он свою ответственную работу в Alloa.
«Я искренне верил, что менеджмент мне подходит больше, чем игра.
Это звучит странно, потому что я все делал хорошо, неплохо зарабатывал на этой должности и достиг определенных успехов.
Но игра — это сложнее.
Есть много вещей, которые нужно выполнять еженедельно.
Я все равно испытываю стресс давление на работе, но хорошо себя чувствую на должности управляющего.
Я всегда хотел руководить, и теперь, делая это, я чувствую себя наиболее комфортно, как рыба в воде на протяжении всей моей взрослой жизни».
Вы можете прослушать полное интервью на Sportsound в воскресенье, 30 сентября, на радио Шотландии с 12:00 до 13:00 по английскому летнему времени.
Согласно результатам опроса, 17:30 — идеальное время для пинты пива
Летняя жара привела к усилению продаж британских пабов, но понизила продажи в сетях ресторанов.
Согласно статистике, продажи в пабах и барах в июле выросли на 2,7%, а в ресторанах упали на 4,8%.
Питер Мартин из бизнес-консалтинговой компании CGA, которая получила эту статистику, рассказывает: «Продолжительная солнечная активность, а также более продолжительное, чем ожидалось, участие Англии в чемпионате мира означает, что июль продолжил тенденцию предыдущего месяца, июня, когда продажи в пабах выросли на 2,8%, а в ресторанах, наоборот, существенно сократились».
Июньское падение доходов в ресторанной торговле на 1,8% продолжилось также в июле.
Пабы и бары, продающие спиртное, показали гораздо более высокие результаты сопоставимо в ресторанами.
Пабы, продающие только еду, тоже пострадали от жары солнце, хотя и не так сильно, как рестораны.
Складывается ощущение, что люди хотят выскочить на улицу только для того, чтобы пропустить стаканчик.
Продажи напитков в пабах и барах выросли на 6,6% за месяц, а еды — на 3%».
Пол Ньюман, аналитик RSM в сфере досуга и гостиничного бизнеса, говорит: «Эти результаты продолжают тенденцию, которую мы наблюдаем с конца апреля.
Погода и влияние крупных социальных или спортивных мероприятий остаются важнейшими факторами, когда речь идет о продажах на небытовом рынке.
Неудивительно, что ресторанные сети продолжают испытывать сложности, тем более, что падение продаж на 4,8 процента в годовом исчислении будет особенно болезненным из-за продолжающегося ценового давления.
Долгое жаркое лето оказалось как никогда не к стати для операторов, работающих с едой, и еще не факт, что август, принеся более умеренные температуры, даст столь необходимую передышку».
Общий рост продаж в пабах и ресторанах, включая вновь открытые, в июле составил 2,7 процента, что отражает замедление сворачивания брендов.
Мониторинг отраслевых продаж Coffer Peach Tracker по британскому сектору пабов, баров и ресторанов собирает и анализирует данные о производительности 47 сетей с совокупным оборотом более 9 млрд. фунтов стерлингов и является признанным отраслевым эталоном.
У каждого пятого ребенка есть секретные аккаунты в социальных сетях, которые он скрывает от родителей
Согласно результатам опроса, у каждого пятого ребенка — некоторым из них всего 11 лет — есть секретные аккаунты в социальных сетях, которые он скрывает от родителей и учителей.
Опрос 20 000 учеников средних школ выявил рост страниц «фейковых инста»
Эта новость усилила опасения по поводу контента сексуального характера
Двадцать процентов учеников сказали, что у них есть «основной» аккаунт, о котором знают родители
Однако каждый пятый ребенок — некоторым из них всего 11 лет — создает аккаунты в соцсетях, которые он скрывает от взрослых.
Опрос 20 000 учащихся средних школ выявил быстрый рост числа фейковых аккаунтов «инсты» — т.е. Инстаграмма, сайта для обмена фотографиями.
Эта новость усилила опасения по поводу публикаций контента сексуального характера.
Двадцать процентов учеников заявили, что у них есть основной, «чистый» аккаунт, к которому есть доступ у их родителей, но также есть еще и секретные аккаунты.
Одна мать, случайно получившая доступ к секретному аккаунту своей 13-летней дочери, наткнулась там на подростка, который призывал других «изнасиловать его».
Исследование, проведенное Digital Awareness UK и Конференцией независимых директоров школ (HMC), показало, что 40 процентов детей в возрасте от 11 до 18 лет имеют два профиля в соцсетях, причем половина из них призналась, что один из них, как правило, секретный.
Глава HMC Майк Бьюкенен говори: «Многие подростки стремятся создать онлайн-пространства, недоступные для их родителей и учителей, и это тревожный факт».
Эйлид Дойл станет «голосом спортсменов» шотландской легкой атлетики
На ежегодном общем собрании руководящего органа Эйлид Дойл была избрана в совет директоров шотландской легкой атлетики в качестве наблюдательного члена совета директора.
Дойл — самый титулованный спортсмен Шотландии по легкой атлетике. Председатель Йен Битти утверждает, что этот шаг является прекрасной возможностью для тех, кто руководит спортом, воспользоваться обширным опытом спортсменки на международном уровне за последнее десятилетие.
«Эйлид пользуется огромным уважением в шотландском, британском и мировом легкоатлетическом сообществе, и мы уверены, что ее участие принесет легкой атлетике в Шотландии огромную пользу», — утверждает Битти.
Дойл говорит: «Я стремлюсь стать голосом спортсменов, и надеюсь, что смогу действительно внести хороший вклад и способствовать развитию спорта в Шотландии».
Американец, который выиграл 200 метров и 400 метров на Играх 1996 года в Атланте, имеет в целом четыре золотые олимпийские медали, и теперь работает рядовым комментатором на BBC, после перенесенного инсульта утратил способность ходить.
Он пишет в своем Твиттере: «Месяц назад у меня случился инсульт.
Я утратил способность передвигаться.
Врачи сказали, что только время покажет, поправлюсь ли я, и если да, то до какой степени.
Это была изнурительная работа, но я полностью выздоровел, заново научился ходить и сегодня выполняю упражнения на ловкость!
Огромное спасибо за поддержку!»
Реклама молокоотсоса, в которой кормящих мам сравнили с коровами, разделила мнения пользователей интернета
Компания по производству молокоотсосов вызвала споры в Интернете, опубликовав там рекламу, в которой кормящие матери сравниваются с дойными коровами.
Выпуская на рынок, как говорят, «первый в мире бесшумный молокоотсос, который можно носить на груди», компания по производству потребительских технологий Elvie опубликовала рекламное музыкальное видео, демонстрирующее свободу, которую новый молокоотсос предоставляет кормящим матерям.
Четыре реальные мамы танцуют в полном сена коровнике под музыкальный трек, в котором есть такие слова: «Да, я кормлю собственным молоком, но ты не увидишь у меня хвоста» и «Если ты не заметил, это не вымя, это моя грудь».
И далее хор: «Сцеживаем, сцеживаем, мы кормим своих младенцев грудным молоком, сцеживаем, сцеживаем».
Этот рекламный ролик, который был опубликован на странице компании в Facebook, вызвал споры в Интернете.
77 000 просмотров и сотни комментариев: видео получило неоднозначную реакцию со стороны зрителей, причем многие говорят, что оно проливает свет на «ужасы» молочной промышленности.
«Очень плохое решение использовать коров для рекламы этого продукта.
Как и нам, им нужно забеременеть и родить, чтобы производить молоко, за исключением того, что их детей забирают у них в течение нескольких дней после рождения», — пишет одна пользовательница.
Молокоотсос Elvie одевается непосредственно под специальный бюстгальтер (Elvie/Mother)
А вот другой комментарий: «Понятно, что это одинаково травматично как для матерей, так и для детей.
Но да, почему бы не использовать их, чтобы рекламировать молокоотсос для матерей, которые оставляют себе своих детей? "
Другой пользователь добавляет: «Реклама, оторванная от реальности».
Другие, напротив, защищали ролик, а одна женщина даже написала, что песня «просто великолепна».
«Думаю, это великолепная идея.
Если бы я кормила малыша, я бы обязательно купила такой.
Кормление грудью на самом деле заставило меня чувствовать себя коровой.
Реклама, конечно, немного чокнутая, но примерно так оно и ощущается.
Гениальный продукт», — написала одна пользовательница.
И еще один комментарий: «Прикольная реклама, рассчитанная на мам, которые кормят грудью (зачастую они делают это прямо на своих рабочих местах или в туалетах), и которые, и правда, чувствуют себя немножко "коровами."
Эта реклама не для того, чтобы восхвалять или ругать нашу молочную индустрию».
В конце видео группа женщин показывает, что они все танцевали с этими незаметными молокоотсосами, спрятанными под бюстгальтерами.
Концепция этой рекламной кампании как раз основана на том факте, что многие женщины, кормящие грудью, говорят, что чувствуют себя коровами.
На самом деле молокоотсос Elvie абсолютно неощутим, не имеет проводов или трубок, свободно помещается в бюстгальтер для кормления, и при этом незаметен, предоставляя женщинам возможность передвигаться, держать малышей детей и даже выходить на улицу во время кормления.
Ана Баларин, партнер и специалист по раннему развитию детей компании Mother, комментирует: «Молокоотсос Elvie — это настолько революционный продукт, что он вполне заслуживает смелой и провокационной рекламы.
Проводя параллель между женщинами и дойными коровами, мы хотели вывести в центр внимания грудное вскармливание и все его проблемы, демонстрируя при этом шутливым и веселым способом невероятное чувство свободы, которое дает новый молокоотсос.
Это не первый случай, когда молокоотсос Elvie попадает в заголовки новостей.
Во время лондонской недели моды мать двоих детей появилась на подиуме дизайнера Марты Якубовской, используя этот продукт по назначению.
Сотни детей-мигрантов беспрепятственно переехали в палаточный лагерь на границе с Техасом
Число задержанных детей-мигрантов резко возросло, хотя количество ежемесячных пересечений границы оставалось относительно неизменным, отчасти потому, что жесткая риторика и политика, введенные администрацией Трампа, затрудняли размещение детей у поручителей.
Обычно большинство спонсоров сами являются такими же иммигрантами, не имеющими документов, и боятся поставить под угрозу свое пребывание в стране, взяв под поручительство ребенка.
Риск возрос в июне, когда федеральные власти объявили, что потенциальные поручители и другие взрослые члены их семей должны будут предоставить отпечатки пальцев, и что эти данные будут переданы иммиграционным властям.
На прошлой неделе Мэтью Олбенс, высокопоставленный сотрудник Иммиграционной и таможенной служб, засвидетельствовал в Конгрессе, что агентство арестовало десятки людей, которые обращались с просьбой взять под поручительство оставшихся без попечения несовершеннолетних.
Позже агентство подтвердило, что 70 процентов арестованных не были ранее судимы.
«Около 80 процентов лиц, которые являются либо поручителями, либо членами их семей, находятся в стране нелегально, и значительная часть из них —иностранцы, совершившие преступление.
Поэтому мы продолжаем преследование этих лиц», — сказал Олбенс.
Со слов работников приюта, стремясь ускорить процесс оформления детей, чиновники ввели новые правила, согласно которым некоторые из них должны предстать перед судом в течение месяца после задержания, а не через 60 дней, как было ранее.
Чтобы заявить о своем правовом статусе судье по иммиграционным делам, многие из присутствуют по видеосвязи, а не лично.
Те, кто считается не имеющим права на помощь, будут быстро депортированы.
По словам работников приютов и информации, появившейся в системе в последние месяцы, чем дольше дети остаются в заключении, тем больше вероятность того, что они у них разовьются тревожность или депресся, что может привести к вспышкам насилия или попыткам побега.
Адвокаты говорят, что эти проблемы усиливаются в более крупных учреждениях, таких как Торнильо, где признаки того, что ребенок испытывает трудности, с большей вероятностью будут игнорироваться из-за размеров учреждения.
Они добавляют, что если перевозить детей в палаточные лагеря, не давая им времени эмоционально к этому подготовиться или попрощаться с друзьями, это может усугубить травму, с которой многие из них и так уже борются.
Сирия приказывает «оккупационным силам» США, Франции и Турции немедленно вывести войска
Выступая на Генеральной Ассамблее ООН, министр иностранных дел Валид аль-Муалем также призвал сирийских беженцев вернуться домой, не смотря на то, что в стране уже восьмой год идет война.
Муалем, который также является заместителем премьер-министра, заявил, что иностранные силы находились на сирийской земле незаконно, под предлогом борьбы с терроризмом, и «будут рассматриваться соответствующим образом».
«Они должны уйти немедленно и без каких-либо условий», — сказал он собравшимся.
Муалем настаивает на том, что в Сирии, где с 2011 года погибло более 360 000 человек, а миллионы людей были изгнаны из своих домов, «война с терроризмом почти закончена».
Он сказал, что Дамаск будет продолжать «вести эту священную битву, пока мы не очистим все сирийские территории» от террористических групп и «любого незаконного иностранного присутствия».
Соединенные Штаты разместили около 2000 военнослужащих в Сирии, которые в основном обучают и консультируют как курдские силы, так и сирийских арабов, выступающих против президента Башара Асада.
Французский контингент насчитывает более 1000 военнослужащих в охваченной войной стране.
Что касается беженцев, Муалем сказал, что для их возвращения были созданы хорошие условия, и обвинил «некоторые западные страны» в «распространении иррациональных страхов», которые побудили беженцев оставаться за пределами страны.
«Мы призвали международное сообщество и гуманитарные организации содействовать возвращению граждан», — говорит он.
«Они политизируют то, что должно быть чисто гуманитарным вопросом».
Соединенные Штаты и Европейский союз предупреждают, что Сирии не будет оказана помощь в восстановлении до тех пор, пока между Асадом и оппозицией не будет достигнуто политическое соглашение о прекращении войны.
Дипломаты ООН говорят, что недавнее соглашение между Россией и Турцией о создании буферной зоны в последнем крупном оплоте повстанцев Идлиб создало возможность для продолжения политических переговоров.
Российско-турецкое соглашение предотвратило широкомасштабное нападение сирийских сил, поддерживаемых Россией, на провинцию, где проживает три миллиона человек.
Однако Муалем подчеркнул, что это соглашение имело «четкие сроки», и выразил надежду, что военные действия будут направлены против джихадистов, в том числе против боевиков из связанного с «Аль-Каидой» фронта Нусра, которые «будут уничтожены».
Посланник ООН Стаффан де Мистура надеется, что в ближайшее время будут созваны первые заседания нового комитета, в состав которого войдут представители правительства и оппозиции, чтобы разработать послевоенную конституцию для Сирии и проложить путь к выборам.
Муалем изложил условия участия сирийского правительства в этом комитете, заявив, что работа комиссии должна быть ограничена «рассмотрением статей действующей конституции», и предостерег от вмешательства.
Почему Трамп выиграет второй срок
Следуя этой логике, г-н Трамп победит на переизбрании в 2020 году, если импичмент и скандал преждевременно не завершат его президентство, а именно на это, вероятно, надеются многие либеральные зрители.
И это, без сомнения, будет «самый драматичный финал президентства за всю историю!»
На данный момент нет никаких признаков утомленности зрителей.
С 2014 года рейтинги прайм-тайм выросли более чем вдвое — до 1,05 миллиона на CNN и почти в три раза — до 1,6 миллиона на MSNBC.
По данным Nielsen, у Fox News в среднем 2,4 миллиона зрителей прайм-тайм, по сравнению с 1,7 миллионами четыре года назад, а шоу MSNBC "The Rachel Maddow Show" превзошло рейтинги кабельных каналов, собирая у экранов 3,5 миллионов зрителей по вечерам во время показа главных новостей.
«Это огонь, к которому тянутся люди, потому что это вне рамок нашего понимания», — говорит Нил Бэр, режиссер драмы ABC «Назначенный выживший», о члене кабинета министров, который становится президентом после того, как Капитолий разрушен в результате атаки.
Нелл Сковелл, давно публикующийся комедийный писатель и автор «Только смешное: несколько неприятных истин о проникновении в “Клуб” голливудских мальчиков» предлагает другую теорию.
Она вспоминает, как однажды ехала на такси в Бостоне перед выборами 2016 года.
Водитель такси сообщил ей, что будет голосовать за господина Трампа.
«Почему?», — спросила она.
Он ответил: «Да потому, что он смешной!», — рассказывает г-жа Сковелл.
Во всем этом хаосе есть нечто ценное — это веселье.
Конечно, ведь в отличие от всего остального контента, транслируемого по телевидению, сюжетные линии по событиям Вашингтона могут определить будущее по «Роу против Уэйда» и ответить на вопросы возможности воссоединения семей иммигрантов и здоровья мировой экономики.
Выключение — это роскошь, которую могут себе позволить только самые привилегированные зрители.
И все же, когда вы уже шестой час подряд смотрите, как группа экспертов обсуждает использование Бобом Вудвордом «глубокого фона» для своей книги «Страх», или про куртку Пола Манафорта за 15 000 долларов из страусиной кожи (одежда, утепленная гордыней», — как пишет «Вашингтон пост»), или про резкое описание Сторми Дэниелсом, скажем так, анатомии г-на Трампа — это уже выходит за рамки обычной информированности.
Я, например, уже никогда не посмотрю на Супер Марио теми же глазами.
«Частично его работа в том, чтобы заставить нас чувствовать, что реалити-шоу состоит в том, что он кормит тебя чем-то каждую ночь», — говорит Брент Монтгомери, исполнительный директор Wheelhouse Entertainment и создатель «Pawn Stars» о меняющемся актерском составе шоу Трампа и ежедневных поворотах сюжета (драка с N.F.L., восхваление Ким Чен Ына).
Вы не можете позволить себе пропустить ни одного эпизода, или вы безнадежно отстали.
Когда я на этой неделе связался с г-ном Флейсом, на северном берегу Кауаи было 27 градусов тепла, светило солнце, но он скрывался внутри своего дома и смотрел MSNBC во время записи CNN.
Он не мог оторваться от экрана, по крайней мере точно не когда показывают, как Бретт Кавано предстает перед Юридическим комитетом Сената и решается будущее Верховного Суда.
«Я помню, когда мы делали все эти сумасшедшие шоу, люди говорили: «Это начало конца западной цивилизации», — рассказывает г-н Флейс.
«Тогда я еще подумал, что это шутка, но оказалось, что они были правы».
Эми Чозик, автор «Таймс», освещающий вопросы бизнеса, политики и СМИ, является автором мемуаров «В погоне за Хиллари».
Аутсайдерские деньги вливаются в жесточайшие промежуточные выборы, которые ведет Белый дом
Неудивительно, что 17-й округ Пенсильвании получает поток наличности благодаря изменению округов в Конгрессе, в которых два должностных лица участвуют в гонке за одно и то же место.
Этот пригородный район Питтсбурга, география которого была не так давно изменена, поддерживает демократа, члена палаты представителей Конора Лэмба, который получил место в другом округе на внеочередных выборах прошлой весной.
Лэмб выступает против другого действующего должностного лица, республиканца Кита Ротфуса, который в настоящее время представляет старый 12-й округ Пенсильвании, который существенно пересекается с новым 17-м.
Карты были пересмотрены после того, как Верховный суд Пенсильвании в январе постановил, что в результате предвыборных махинаций старые районы были в нарушение конституции приписаны республиканцам.
Гонка в новом 17-м округе вызвала горячую дискуссию о финансировании кампаний между финансовыми силами главной партии — Комитетом Конгресса демократической кампании (DCCC) и Национальным комитетом республиканской кампании (NRCC).
Имя Лэмба стало известным в Пенсильвании после победы с маленькой разницей на широко наблюдаемых в марте специальных выборах в Конгресс в 18-м округе Пенсильвании.
Это место уже более десяти лет занимал республиканец, и президент Дональд Трамп выиграл округ, получив 20 очков преимущества.
Политические эксперты дают демократам небольшое преимущество.
США наказали Эль-Сальвадор за поддержку Китая, но затем отступили
Дипломаты отметили, что Доминиканская Республика и Панама уже признали Пекин, что вызвало негативную реакцию Вашингтона.
В июне 2017 г. г-н Трамп провел теплую встречу с президентом Панамы Хуаном Карлосом Варелой. В его собственности также находился в Панаме, пока партнеры не выселили управленческую команду организации Трампа.
Представители госдепартамента решили отозвать американских руководителей дипломатических миссий из Сальвадора, Доминиканской Республики и Панамы по причине «недавних решений о непризнании Тайваня», заявила в начале этого месяца пресс-секретарь департамента Хезер Науэрт.
Однако возможность наказания рассматривалась только в отношении Сальвадора, который получил около 140 миллионов долларов американской помощи в 2017 году, в том числе на контроль над наркотиками, экономическое развитие и поддержку.
Предлагаемые штрафные санкции, включающие сокращение финансовой помощи и целевые ограничения на выдачу виз, стали бы болезненными для этой страны Центральной Америки с ее высоким уровнем безработицы и убийств.
На фоне регулярного проведения внутренних встреч представители Северной и Центральной Америки откладывали конференцию на высоком уровне, посвященную безопасности и экономическому процветанию, которую следовала провести для подведения итогов аналогичной встречи, которая состоялась в прошлом году, которая воспринималась, как шаг вперед в усилиях по предотвращению миграции в Соединенные Штаты.
Однако к середине сентября высокопоставленные представители администрации дали понять, что они хотят, чтобы подготовка конференции все же продвинулась, и фактически прекратила рассмотрение вопроса о наказании Эль-Сальвадора.
По словам дипломатов, конференция намечена на середину октября, и на ней выступит вице-президент Майк Пенс в знак того, что администрация придает действительно важное значение этой встрече.
Три американских дипломатических представителя благополучно вернулись в Эль-Сальвадор, Панаму и Доминиканскую Республику, не везя с собой из Вашингтона никаких новых жестких посланий или санкций.
Представитель Белого дома г-н Болтон отказался комментировать детали дебатов, о которых рассказали три американских официальных лица, включая двух дипломатов, которые согласились обсудить внутренние вопросы при условии анонимности.
Их отчеты подтверждает и сторонний аналитик, вхожий в круги администрации, но также говорил на условиях анонимности.
Изучайте историю
Следующим шагом может стать сообщение специального советника Роберта Мюллера о возможном препятствовании г-на Трампа правосудию, о чем в настоящее время имеются очень существенные доказательства в публичных отчетах.
Г-н Мюллер, по сообщениям, также приступает к расследованию наличия фактов сговора кампании Трампа с Россией и ее атаки в ходе прошедших выборов.
Если Конгресс сменит хозяина, г-н Трамп окажется перед лицом ответственности в этом органе, точно так же, как он готовится снова выступить перед избирателями, и, возможно, в конечном итоге перед присяжными из числа своих коллег.
Но существует много «если»; я не хочу сказать, что падение мистера Трампа неизбежно, равно как и падение его эквивалентов в Европе.
Мы все сделаем выбор по обе стороны Атлантики, что скажется на продолжительности борьбы.
В 1938 году немецкие офицеры были готовы устроить государственный переворот и свергнуть Гитлера, и это произошло бы, если бы Запад оказал ему сопротивление и поддержал чехословацкие войска в Мюнхене.
Однако мы этого не сделали, и этим упустили возможность избежать последующих лет кровопролития.
Курс истории разворачивается именно на таких точках, и неумолимый марш демократии ускоряется или задерживается.
Американцы переживают некоторые из этих переломных моментов сейчас.
Что мы будем делать, если г-н Трамп уволит заместителя генерального прокурора Рода Розенштейна, человека, который контролирует судьбу расследования мистера Мюллера?
Розенштейн находится в сложной ситуации с тех пор, как, согласно информации этой газеты, в прошлом году он предложил делать тайные записи о деятельности президента и рассуждал о его непригодности для должности.
Г-н Розенштейн утверждает, что данные The Times неверны.
«Как мы будем реагировать, если недавно запрошенное расследование ФБР относительно Бретта Кавано не будет полным или правдивым, или если его все-таки утвердят на должность верховного судьи несмотря на заслуживающие доверия обвинения в сексуальных домогательствах и лживые показания?
И прежде всего, будем ли мы в среднесрочной перспективе голосовать за Конгресс, который привлечет г-на Трампа к ответственности?
Если мы не пройдем эти испытания достойно, то эта зима окажется для демократии слишком затяжной.
Но я верю, что мы сможем пройти их достойно благодаря уроку, который я выучил в Праге.
Моя мать была чехословацкой еврейкой, сосланной в Освенцим тем же нацистским режимом, чиновники которого когда-то занимали посольский дом, в котором я жил много лет спустя.
Она выжила, иммигрировала в Америку и 60 лет спустя провожала меня зажигать субботние свечи на столе с символом свастикой.
С таким семейным прошлым как я могу не быть оптимистом в отношении нашего будущего?».
Норман Эйзен, старший научный сотрудник Института Брукингса, является председателем организации «Граждане за ответственность и этику в Вашингтоне» и автором книги «Последний дворец: тревожный век Европы в истории пяти жизней и одного легендарного дома»
Грэм Дорранс из «Рейнджерс» настроен оптимистично в преддверии столкновения с футбольным клубом венский «Рапид».
«Рейнджерс» принимают венский «Рапид» в четверг, зная, что победа над австрийцами, после впечатляющей ничьей в Испании над «Вильярреалом» в начале этого месяца, позволит им занять сильные позиции в группе G Лиги Европы.
Травма колена помешала полузащитнику Грэму Доррансу впервые выступить в сезоне до ничьей со счетом 2:2 против «Вильярреала», но он считает, что «Рейнджерс» может использовать данный результат в качестве трамплина для достижения больших результатов.
«Это был хороший момент для нас, потому что «Вильярреал» - хорошая команда», - сказал 31-летний футболист.
«Мы вошли в игру, полагая, что можем что-то получить, а ушли с ничьей.
Возможно, в конце концов, мы могли справиться, но в целом ничья, вероятно, была справедливым результатом.
Они, вероятно, лучше сыграли в первом тайме, а наш успех пришелся на второй тайм, где мы проявили себя лучше.
В этот четверг состоится еще одна большая европейская ночь.
Надеюсь, мы сможем получить три очка, но это будет сложная игра, потому что они показали хороший результат в своей последней игре, но, учитывая поддержку болельщиков, я уверен, что мы сможем продвинуться вперед и получить положительный результат.
Прошлый год определенно выдался тяжелым, с учетом всего, что связано с моими травмами, и заменами в самом клубе, но сейчас в этом месте есть хороший фактор.
Состав прекрасно подобран, и ребята действительно получают от этого удовольствие; тренировки прошли на «ура».
Надеюсь, мы сможем продвинуться вперед, оставить позади прошлый сезон и добиться успеха».
Женщины теряют сон из-за страха за свои пенсионные накопления
Несмотря на то, что участники опроса имели четкое представление о том, как они хотят, чтобы о них заботились, мало кто говорил об этом с членами своей семьи.
Около половины людей, участвовавших в общенациональном исследовании, сказали, что они обсуждали со своими супругами стоимость долгосрочного ухода.
Однако только 10% сказали, что говорили на эту тему со своими детьми.
«Люди хотят, о них заботился кто-то из членов семьи, но не пытаются обсуждать с ними эту тему», — рассказывает Холли Снайдер, вице-президент Nationwide по страхованию жизни.
А начинать надо именно с этого.
Поговорите с вашим супругом и детьми: вы не можете подготовить свою семью к тому, что им, вероятно, придется заботиться о вас, если вы заранее не озвучите своих желаний.
Обсуждайте со своим консультантом и семьей, где и как вы будете получить медицинскую помощь, поскольку этот выбор может быть важным фактором в плане расходов.
Советуйтесь со своим финансовым консультантом: он поможет вам разработать план оплаты этих расходов.
Ваш выбор финансирования для долгосрочного ухода может покрываться традиционным страховым полисом долгосрочного ухода или смешанным полисом денежного страхования жизни, которые помогут покрыть эти расходы или самостоятельно застраховаться с помощью своего собственного имущества при условии, что у вас есть деньги.
Приведите в порядок свои юридические документы: избавьте себя от юридических баталий.
Составьте доверенность на медицинское обслуживание и назначьте доверенное лицо, которое будет контролировать ваше медицинское обслуживание и следить за тем, чтобы специалисты выполняли ваши пожелания в случае, если вы не сможете общаться.
Рекомендуем также рассмотреть возможность составления финансовой доверенности.
Следует выбрать доверенное лицо, которое будет помогать вам принимать финансовые решения и следить за оплатой ваших счетов в случае, если вы окажетесь недееспособны.
Не забывайте и о мелочах: представьте, что вашему пожилому родителю потребовалась неотложная медицинская помощь, и он находится на пути в больницу.
Сможете ли вы в этом случае предоставить информацию о том, какие лекарства он принимает и на что у него аллергия?
Запишите все эти детали на бумаге, чтобы как следует приготовиться на всякий случай.
Мартин добавляет: «Важно не только наличие финансов, но и выбор врачей».
«Какие лекарства вы принимаете?
Кто будет заботиться о вашей собаке?
Составьте и запишите этот план».
В Ильфракомбе человек несколько раз выстрелил из пневматической винтовки
Человек несколько раз выстрелил из пневматической винтовки, возвращаясь домой с гулянки.
Жертва, в грудь, живот и руку которой попали пули, 40 лет, находилась в районе Оксфорд-Гроув в Ильфракомбе, Девон.
Полиция охарактеризовала стрельбу, которая произошла примерно в 02:30 по английскому летнему времени, как «случайность».
Жертва не видела нападающего.
Ранения не опасны для жизни, в настоящий момент полиция разыскивает свидетелей.
Землетрясения и цунами в Индонезии
По словам официальных лиц, по меньшей мере 384 человека погибли в результате мощного землетрясения и цунами, обрушившихся на индонезийский город Палу в пятницу, и ожидается, что число погибших возрастет.
Из-за выхода из строя коммуникаций спасатели не могут получить никакой информации из Донггала, района к северу от Палу, который находится ближе к эпицентру землетрясения силой 7,5 балла.
В Палу в результате стихийного бедствия были эвакуированы более 16 000 человек.
Вот некоторые ключевые факты о Палу и Донггала, расположенных на острове Сулавеси:
Палу — столица провинции Центрального Сулавеси, расположенная в конце узкой бухты на западном побережье острова Сулавеси, с предполагаемой численностью населения 379 800 человек (данные на 2017 год).
Город праздновал свое 40-летие, когда произошли землетрясение и цунами.
Донггала — это округ, простирающийся вдоль 300 км (180 миль) береговой линии на северо-западе острова Сулавеси.
Округ, административный район меньше провинции, в 2017 году насчитывал 299 200 человек.
Рыболовство и сельское хозяйство являются основой экономики провинции Центральный Сулавеси, и в частности, прибрежного региона Донггала.
Добыча никеля также имеет важное значение для экономики провинции, но в основном сосредоточена в Моровали, на противоположном побережье Сулавеси.
По данным Индонезийского агентства по устранению последствий стихийных бедствий, за последние 100 лет цунами несколько раз наносили разрушения в Палу и Донггала.
В 1938 году цунами убило более 200 человек и разрушило сотни домов в Донггала.
Цунами также произошло в западной части Донггала в 1996 году, в результате погибли девять человек.
Индонезия находится на Тихоокеанском вулканическом огненном кольце и регулярно страдает от землетрясений.
Вот некоторые из основных землетрясений и цунами за последние годы:
2004: Сильное землетрясение на западном побережье индонезийской провинции Ачех на севере Суматры 26 декабря вызвало цунами, обрушившееся на 14 стран, в результате которого погибло 226 000 человек вдоль побережья Индийского океана, более половины из них в Ачехе.
2005: Последовательность сильных землетрясений обрушилась на западное побережье Суматры в конце марта и начале апреля.
Сотни людей погибли на острове Ниас, у побережья Суматры.
2006: Землетрясение силой 6,8 разразилось южнее Явы, самого густонаселенного острова Индонезии, вызвав цунами, обрушившееся на южное побережье, в результате которого погибло около 700 человек.
2009: Землетрясение магнитудой 7,6 произошло в городе Паданг, столице провинции Западная Суматра.
Погибло более 1100 человек.
2010: Землетрясение силой 7,5 баллов произошло на одном из островов Ментавай у Суматры, вызвав цунами до 10 метров, которое разрушило десятки деревень и убило около 300 человек.
2016: Слабое землетрясение обрушилось на округ Пиди-Джая в Ачехе, вызвав разрушения и панику, так как люди помнили о разрушительном землетрясении 2004 года и цунами.
На этот раз цунами не произошло, но более 100 человек погибли в следствие разрушения зданий.
2018: Сильные землетрясения обрушились на туристический остров Индонезии Ломбок, в результате чего погибли более 500 человек, в основном на северной стороне острова.
Землетрясение разрушило тысячи зданий и тысячи туристов временно оставались под руинами.
Старший сын Сары Пэйлин арестован по обвинению в домашнем насилии
Трак Пэйлин, старший сын бывшего губернатора Аляски и вице-кандидата в президенты Сары Пэйлин, был арестован по обвинению в нападении.
29-летний Пэйлин из Василлы, Аляска, был арестован по подозрению в домашнем насилии, вмешавшись в ситуацию, в которой имело место домашнее насилие, и за сопротивление аресту, согласно сообщению, опубликованному в субботу полицией штата Аляска.
Согласно отчету полиции, когда одна его знакомая пыталась позвонить в полицию, чтобы сообщить о предполагаемом преступлении, он отобрал у нее телефон.
По сообщению KTUU, Пейлин находится в следственном изоляторе Mat-Su и будет выпущен под залог в 500 долларов.
Он появился в суде в субботу, и когда его спросили, виновен ли он, он заявил о своей «однозначной невиновности».
Пейлину грозит вменение трех мелких преступлений класса А, а это означает, что он может быть лишен свободы на срок до одного года и оштрафован на 250 000 долларов.
Ему также предъявлено обвинение в совершении преступления класса В, наказуемое лишением свободы на срок до одного дня и штрафом 2 000 долларов США.
Это не первый случай, когда против Пейлина были выдвинуты уголовные обвинения.
В декабре 2017 года он был обвинен в нападении на своего отца Тодда Пэйлина.
Его мать, Сара Пэйлин, вызвала полицию, сообщив о предполагаемом нападении.
Дело в настоящее время находится на рассмотрении ветеранского суда Аляски.
В январе 2016 года ему было предъявлено обвинение в домашнем насилии, подделке отчета о насилии в семье и хранении оружия в состоянии алкогольного опьянения в связи с инцидентом.
Его девушка утверждала, что он ударил ее по лицу.
Сара Пэйлин подверглась критике со стороны групп ветеранов в 2016 году, после того, как объяснила жестокое поведение своего сына посттравматическим стрессовым расстройством, якобы полученным в результате его службы в Ираке.
Землетрясение и цунами в Индонезии: сотни убитых
По меньшей мере 384 человека погибли в результате землетрясения на индонезийском острове Сулавеси в пятницу.
Землетрясение силой 7,5 баллов вызвало цунами и разрушило тысячи домов.
Электричество и коммуникации не работают, и в ближайшие дни число жертв возрастет.
Землетрясение произошло недалеко от центрального Сулавеси, который находится к северо-востоку от столицы Индонезии Джакарты.
В социальных сетях появляются видеозаписи с происшествием.
Сотни людей находились на пляжном фестивале в городе Палу, когда цунами обрушилось на берег.
Федеральная прокуратура хочет вынести подозреваемому в теракте в Нью-Йорке редкий смертный приговор
Федеральная прокуратура в Нью-Йорке добивается смертной казни для Сайфулло Саипова, подозреваемого в осуществлении теракта в Нью-Йорке, в результате которого погибли восемь человек — редкое наказание за федеральное преступление, которое не применялось в штате с 1953 года.
В октябре Саипов, 30 лет, якобы взял напрокат грузовик Home Depot, чтобы совершить нападение на велосипедную дорожку на шоссе Вест-Сайд в Нижнем Манхэттене, сбивая пешеходов и велосипедистов.
Чтобы оправдать смертный приговор, прокуроры должны будут доказать, что Саипов «преднамеренно» убил восемь человек и «преднамеренно» нанёс серьезные телесные повреждения, согласно уведомлению о намерении добиться смертной казни, поданному в Южном округе Нью-Йорк.
Согласно судебному документу, по этим обоим обвинениям, возможно, будет вынесен смертный приговор.
Через несколько недель после нападения большое федеральное жюри зачитало Саипову обвинительный приговор с 22 пунктами обвинения, который включал в себя восемь обвинений в убийстве с целью рэкета, обычно используемых федеральными прокурорами в делах об организованной преступности, а также обвинение в применении насилия и уничтожении автомобилей.
По словам прокуроров, нападение было «тщательно спланированным и преднамеренным», Саипов осуществил его, как описывается, «отвратительным, жестоким и преступным образом».
«Сайфулло Хабибуллаевич Саипов причинил травмы, нанес ущерб и потерю семьям и друзьям Диего Энрике Анджелини, Николаса Клевеса, Анн-Лора Декадта, Даррена Дрейка, Ариэля Эрлия, Эрнана Ферручи, Эрнана Диего Мендосы и Алехандро Дамиана Пагнукко», — говорится в  уведомлении о намерениях.
Пятеро погибших были туристами из Аргентины.
Прошло десять лет с тех пор, как в Южном округе Нью-Йорка за уголовное преступление прокурор потребовал смертной казни.
В сентябре 2009 года обвиняемый Халид Барнс был осужден за убийство двух наркодилеров, но в конечном итоге был приговорен к пожизненному заключению.
В последний раз смертная казнь по федеральному делу в Нью-Йорке была применена в 1953 году по отношению к Юлиусу и Этель Розенберг, супружескую пару, казненную за сговор с целью шпионажа в пользу Советского Союза во время холодной войны двумя годами ранее.
Розенберги были казнены с применением электрического стула 19 июня 1953 года.
Согласно судебным документам Саипов, уроженец Узбекистана, демонстрировал отсутствие раскаяния после совершенного им нападения.
По словам полиции, он заявил следователям, что он рад, что он это сделал.
Согласно обвинительному заключению, Саипов рассказал властям, что на совершение нападения его вдохновил просмотр видео ИГИЛ на телефоне.
Он также попросил вывесить флаг ИГИЛ в своей больничной палате, сообщила полиция.
Он отрицает свою вину по всем 22 пунктам обвинительного заключения.
Дэвид Паттон, один из федеральных общественных защитников, выступающих на стороне Саипова, сказал, что они «явно разочарованы» решением прокуратуры.
«Мы считаем, что решение о применении смертной казни, а не о пожизненном заключении без возможности освобождения только усугубит боль этих событий для всех их участников», — сказал Паттон.
Защита Саипова ранее обращалась к прокурорам с ходатайством не добиваться смертной казни.
Член парламента от Тори говорит, что НАЙДЖЕЛ ФАРАЖ не должен нести ответственность за переговоры по Brexit
Сегодня во время протеста на конференции Тори Найджел Фараж поклялся «мобилизовать народную армию».
Бывший лидер Ukip сказал, что политики должны «чувствовать накал» евроскептиков, так как один из членов парламента Терезы Мэй предположил, что он должен отвечать за переговоры с ЕС.
Член партии консерваторов Питер Боун сказал на митинге в Бирмингеме, что Великобритания уже «вышла бы», если бы мистер Фараж был секретарем Brexit.
Однако проблема, с которой сталкивается г-жа Мей, пытаясь примирить свои глубоко разделенные ряды, усугубляется еще и тем, что члены партии Тори, выступающие против выхода из ЕС, присоединяются к отдельному протесту против Brexit, который проходит в городе.
Премьер изо всех сил пытается сохранить свой компромиссный план, озвученный в Чекерс в разгар атак со стороны сторонников Brexit, его противников и ЕС.
Союзники настаивают на том, чтобы она продолжила пытаться заключить сделку с Брюсселем, несмотря на негативную реакцию, и, таким образом, заставить Евроскептиков и лейбористов выбирать между ее пакетом и «хаосом».
Мистер Боун сказал на митинге Leave Means Leave («Выйти значит выжить») в Солихалле, что хочет «обыграть Чекерс».
Он предложил, чтобы г-на Фаража уровняли и возложили на него ответственность за переговоры с Брюсселем.
«Если бы он был ответственным, мы бы уже вышли, — сказал он.
Депутат Веллингборо добавил: «Я буду и дальше выступать за Brexit, но нам нужно обыграть Чекерс».
Выступая против ЕС, он сказал: «Мы не воевали в мировых войнах, чтобы быть зависимыми.
Мы хотим устанавливать наши законы в нашей стране».
Г-н Боун отклонил предположения о том, что общественное мнение изменилось после голосования 2016 года: «Идея о том, что британцы изменили свое мнение и хотят остаться, совершенно не соответствует действительности».
Сторонник Brexit от партии Тори Андреа Дженкинс также была на митинге, дав журналистам такой комментарий: «Я говорю: Премьер-министр, просто послушайте людей».
«Чекерс непопулярен среди широкой общественности, оппозиция не собирается голосовать за этот план, он непопулярен также среди членов нашей партии и наших активистов, которые фактически штурмуют улицы и в первую очередь избирают нас.
Пожалуйста, отложите в сторону Чекерс и начните прислушиваться к тому, что вам говорят».
В своем резком обращении к г-же Мей она добавила: «Премьер-министры остаются на своей работе, если остаются верны своим обещаниям».
Г-н Фараж сказал, что если политики собираются предать решение, принятое на референдуме 2016 года, значит их необходимо заставить «почувствовать накал».
«Это теперь вопрос доверия между нами, людьми, и нашим политическим классом», — говорит он.
«Они пытаются предать Brexit, и мы здесь сегодня, чтобы сказать им: “Мы не спустим вам это с рук”».
Обращаясь к восторженной толпе, он добавил: «Я хочу, чтобы наш политический класс, который находится на грани предательства Brexit, почувствовал накал.
«Мы мобилизуем народную армию этой страны, давшую нам победу в Brexit, и мы не успокоимся, пока не станем независимым, самостоятельным и гордым Соединенным Королевством».
Тем временем противники Brexit прошли с демонстрацией по Бирмингему, затем проведя двухчасовой митинг в центре города.
Несколько активистов размахивали плакатами «Тори против Brexit» в эти выходные.
На открытие конференции член Лейбористскиой партии лорд Адонис критиковал консерваторов из-за проблем с безопасностью в мобильном приложении их партии.
«И эти люди утверждают, что могут настроить ИТ-системы и технологии Canada plus plus, для работы на границах, для свободной торговли без границ с Ирландией», — добавил он.
«Это один сплошной фарс.
Хорошего Brexit не существует в принципе», — утверждает он.
Уоррен планирует «тщательно изучить» возможности участия в президентской гонке
Член парламента США Сенатор Элизабет Уоррен говорит, что после ноябрьских выборов она будет «тщательно изучать возможности баллотирования вв президенты».
The Boston Globe сообщает, что демократ из Массачусетса в субботу рассказала о своем будущем на заседании ратуши в западном Массачусетсе.
Уоррен, частый критик президента Дональда Трампа, баллотируется в ноябре на переизбрание против члена Республиканской партии Джеффа Дила, который был сопредседателем кампании Трампа в Массачусетсе в 2016 году.
Ходят разговоры, что она имеет шансы занять пост Трампа в 2020 году.
В субботу днем ​​в Холиоке она провела очередную встречу с избирателями; с тех пор, как Трамп вступил в должность, это была уже ее 36-я встреча с избирателями в формате заседания ратуши.
Один из участников спросил ее, планирует ли она баллотироваться на пост президента.
Уоррен ответила, что пришло время «женщинам отправиться в Вашингтон, чтобы “починить” наше сломанное правительство, а для этого нужно, чтобы наверху была женщина».
В результате убийства Симса (застрялан), игрока LSU был произведен арест
Полиция Батон-Руж, штат Луизиана, объявила в субботу, что подозреваемый в убийстве (стрельба)  баскетболиста LSU Уэйда Симса, произошедшего в пятницу, был арестован.
В 11:00 по английскому времени на пресс-конференции полиция Батон-Руж объявила об аресте Дейтона Симпсона, 20 лет .
В пятницу отдел полиции опубликовал видеозапись стрельбы с просьбой помочь опознать человека, которого удалось снять на видео.
20-летний Симс был застрелен около кампуса Южного университета в пятницу утром.
«Уэйд Симс получил огнестрельное ранение в голову,  в результате которого скончался», — заявил в субботу журналистам начальник полиции Мерфи Дж. Пол.
Уэйд вступился за своего друга, и был застрелен Симпсоном.
Симпсон был допрошен и признался в том, что участвовал в инциденте, имел при себе оружие и выстрелил в в Уэйда Симса.
При аресте Симпсон не оказал сопротивления и был взят под стражу в полицейском управлении округа Ист-Батон-Руж.
Молодой человек ростом 1 м 82 см вырос в Батон-Руж, сыграл в 32 играх с 10 стартами в прошлом сезоне и набрал в среднем 17,4 минуты, 5,6 очка и 2,9 подборов за игру.
Гран При России: Льюис Хэмилтон приближается к титулу чемпиона мира после того, как командная тактика подарила ему победу над Себастьяном Феттелем
С того момента, как Валттери Боттас в субботу прошел квалификацию, обогнав Льюиса Хэмилтона, стало ясно, что командная тактика «Мерседес» сыграет большую роль в гонке.
Уже с поул-позишн Боттас хорошо стартовал и практически повис на Хэмилтоне, когда тот защищал свою позицию на первых двух поворотах, и пригласил Феттеля атаковать своего товарища по команде.
Феттель первым ушел на пит-стоп, оставив Хэмилтона плестись в хвосте всей группы – выбор, ставший решающим.
«Мерседес» ушел на пит-стоп один круг спустя, и после вышел позади Феттеля, но Хэмилтон, после некоторой борьбы «колесо в колесо», вырвался вперед, что привело к тому, что водитель «Феррари» неохотно оставил внутреннее пространство свободным, рискуя зацепиться после двойного движения для защиты на третьем повороте.
В свой 21-й день рождения Макс Ферстаппен стартовал с заднего ряда сетки и был на седьмом месте к концу первого круга.
Затем большую часть гонки он вел, держась на родных шинах, с целью быстро финишировать, подвинув Кими Райкконена на четвертое место.
В итоге он ушел на пит-стоп на 44-м круге, но не смог увеличить темп на оставшихся восьми кругах, поскольку Райкконен занял четвертое место.
День выдался трудным, поскольку Валттери проделал фантастическую работу на выходных и проявил настоящее благородство, поделившись со мной этим.
Команда проделала такую исключительную работу, чтобы иметь пару трюков в запасе", сказал Гамильтон.
Предательский язык жестов
Президент Дональд Трамп раскритиковал сенатора Дайэнн Файнстайн на встрече с избирателями в субботу за ее утверждение, что она не обнародовала письмо Кристины Блейси Форд, обвиняющей Бретта Кавано, кандидата на должность верховного судьи, в сексуальных домогательствах.
Выступая на митинге в Западной Вирджинии, президент не упоминал напрямую показания, данные Форд перед Юридическим комитетом Сената, сказав, что происходящее в Сенате показало, что участники этих событий — «подлые, мерзкие и лживые люди».
«Единственная возможная реакция на все это, и то, что происходит в последние несколько дней в Сенате — это прекрасно, это гнев, злоба, мерзость и ложь», — сказал он.
«Вы видите все эти утечки, а потом они говорят: «Нет,  я этого не делал.
Я этого не делала».
Помните?
Дайэнн Файнстайн вы «слили» информацию?
Помните ее ответ... вы «слили» информацию документа? — "что, что?
О, нет.
Я не сливала.
Так, стоп.
Мы, что ли, «слили»?...Нет, мы не «сливали», — добавил он с интонацией сенатора.
В июле Файнстайн было отправлено письмо с подробным изложением обвинений, выдвинутых Форд против Кавано, а в начале сентября оно было незаконно обнародовано, но Файнстайн отрицает, что утечка произошла в ее офисе.
«Я не скрывала утверждений доктора Форд, но я и не сливала ее информацию», — заявила Файнстайн Комитету, по данным The Hill.
«Она попросила, чтобы я держала эту информацию в тайне, и я сделала, как она просила».
Однако, манера, в которой она отрицала обвинения в утечке, похоже, не понравилось президенту, который прокомментировал это во время субботнего митинга: «Вот что я вам скажу: язык тела здорово ее подвел.
Может, она и не «сливала», но язык тела был худшим, что я когда-либо видел».
Продолжая защищать своего кандидата на должность верховного судьи, которого три женщины обвинили в сексуальных домогательствах, президент предположил, что демократы используют эти обвинения в своих собственных целях.
«Они определенно пытаются вернуть себе власть всеми доступными способами.
Мы наблюдаем подлость, мерзость, им все равно, кого они обидят, через кого они должны перешагнуть, чтобы получить власть и контроль», — цитирует Mediaite слова президента.
Британская элитная хоккейная лига: «Данди Старс» 5-3 «Белфаст Джайантс»
Патрик Дуайер забил два гола, за «Джайантс» в игре против «Данди»
В игре Элитной хоккейной лиги, «Данди Старс» расплатились за пятничное поражение против «Белфаст Джайантс», выиграв ответный матч в субботу со счетом 5-3 в пользу «Данди».
«Джайантс» получили раннее преимущество в два гола благодаря ударам Патрика Дуайера и Фрэнсиса Бовильера.
Майк Салливан и Джордан Коуни подняли уровень домашней команды до того, как Дуайер вывел «Джайантс» в лидеры.
Франсуа Бушар сравнял счёт «Данди», прежде чем два гола Лукаса Лундвальда Нильсена закрепили их победу.
Для людей Адама Кифа, одержавших победу над «Данди» со счетом 2:1 в Белфасте в пятницу вечером, это было третье поражение в сезоне Элитной лиги.
Между сторонами это была четвертая встреча в сезоне, когда «Джайантс» выиграли три предыдущих матча.
Первый гол Дуайера пришелся на четвертой минуте на 3:35 после голевого паса Кендалла Макфолла при поддержке Дэвида Резерфорда, после чего Бовильер удвоил преимущество четыре минуты спустя.
Во время начального периода Салливан вернул хозяев в игру на 13:10, прежде чем Мэтт Марквардт поспособствовал Коуни в выравнивании счета на 15:16.
Дуайер удостоверился, что «Джайантс» перехватили инициативу в первом перерыве, когда он забил второй гол за вечер в конце первого периода.
Хозяева перегруппировались, и Бушар снова выровнял счет, забив гол при численном перевесе на 27:37.
Коуни и Чарльз Коркоран объединились, чтобы помочь Нильсену дать «Данди» возможность впервые за матч завладеть лидерством в конце второго периода, после чего он вместе со своей командой закрепил победу, удержав соперников на середине поля до конца заключительного периода.
«Джайантс», на данный момент проигравшие четыре из последних пяти матчей, направляются в Милтон-Кейнс на следующий матч, который состоится в пятницу.
Авиадиспетчер погиб ради того, чтобы сотни людей, находившихся на борту самолета, смогли избежать землетрясения
Индонезийскому авиадиспетчеру было посмертно присвоено звание героя после того, как он осознанно пошел на смерть ради того, чтобы самолет с сотнями пассажиров смог благополучно взлететь.
Более 800 человек погибли и многие пропали без вести в результате сильного землетрясения на острове Сулавеси в пятницу, вызвавшего цунами.
Сильные подземные толчки продолжают разрушать этот район, многие жители города Палу оказались под обломками зданий.
Несмотря на то, что его коллеги спасались бегством ради спасения своей жизни, 21-летний Антониус Гунаван Агунг отказался покинуть свой пост в страшно раскачивающейся диспетчерской вышке аэропорта Мутиара Сис Аль Джуфри, город Палу.
Он оставался на своем месте, чтобы удостовериться, что самолет Batik Air Flight 6321, который в то время находился на взлетно-посадочной полосе, смог безопасно взлететь.
Затем, когда ему показалось, что вышка обрушивается, он спрыгнул с нее.
Позже он скончался в госпитале.
Представитель аэронавигации Индонезии Йоханнес Сираит заявил, что это решение могло спасти сотни жизней, сообщает австралийское агентство ABC News.
Мы подготовили вертолет из Баликпапана в Калимантане, чтобы доставить его в большую больницу в другом городе.
К сожалению, диспетчер скончался еще до того, как вертолет успел сесть в Палу.
«Мы очень сожалеем об этой утрате», — добавил он.
Между тем власти опасаются, что число погибших в результате землетрясения может достигнуть тысяч человек, поскольку, согласно информации агентства по устранению последствий стихийных бедствий, доступ к городам Донггала, Сиги и Бутонг ограничен.
«Число жертв, вероятно, растет, так как большое количество людей все еще находятся под обломками, а многие так и не смогли оттуда выбраться», — говорит представитель агентства Sutopo Purwo Nugroho.
Волны, высота которых достигала шести метров, опустошили город Палу, в котором в воскресенье пройдет массовое захоронение погибших.
Военные и коммерческие самолеты доставляют в пострадавший город гуманитарную помощь.
Риса Кусума, a 35-летняя мать, рассказывает Sky News: «Скорая помощь привозит пострадавших каждую минуту.
Чистой воды не хватает.
Мини-маркеты повсюду разграблены».
Ян Гельфанд, глава Международного Красного Креста в Индонезии, рассказывает CNN: «Сотрудники индонезийского Красного Креста уже спешит на помощь выжившим, но мы не знаем, что они там застанут.
Трагедия уже приняла довольно серьезные масштабы, но все может быть намного хуже».
Президент Индонезии Джоко Видодо прибыл в Палу в воскресенье и выступил перед вооруженными силами страны, в частности, сказав: «Я прошу всех вас работать днем ​​и ночью, чтобы выполнить все задачи, связанные с эвакуацией.
Вы готовы?», — рассказывает CNN.
В начале этого года Индонезия пострадала от землетрясения в Ломбоке, в результате которого погибло более 550 человек.
Авиакатастрофа в Микронезии: Air Niugini теперь сообщает, что один человек пропал без вести после крушения самолета в лагуне
Авиакомпания, выполнявшая рейс, потерпевший крушение в Тихоокеанской лагуне в Микронезии, теперь сообщает, что один человек пропал без вести, тогда как ранее было сказано, что все 47 пассажиров и экипаж благополучно покинули тонущий самолет.
В сообщении Air Niugini говорится, что по состоянию на субботу днем, она не имеет никакой информации об одном пассажире мужского пола.
Авиакомпания заявила, что сотрудничает с местными властями, больницами и полицией, предпринимая попытки найти этого человека.
Авиакомпания не смогла немедленно ответить на запросы о предоставлении более подробной информации о пассажире, например, о его возрасте или национальности.
Местные моряки помогли спасти других пассажиров и команду самолета после того, как он упал на воду, пытаясь приземлиться в аэропорту острова Чуук.
В пятницу официальные лица сообщили, что семь человек были доставлены в больницу.
Авиакомпания также сообщила, что в субботу шесть пассажиров были госпитализированы, и все они находятся в стабильном состоянии.
Причины авиакатастрофы и точная последовательность событий остаются неясными.
Авиакомпания и ВМС США утверждают, что самолет приземлился в лагуне недалеко от взлетно-посадочной полосы.
Некоторые свидетели утверждают, что самолет не смог приземлиться на взлетно-посадочную полосу.
Американский пассажир Билл Джейнс говорит, что самолет стал заходить на взлетно-посадочную полосу слишком низко.
«И это очень хорошо», — добавляет Джейнс.
Джейнс рассказал, что ему и другим пассажирам удалось пройти к аварийным выходам на тонущем самолете, так как уровень воды был по пояс.
Он также рассказал, что стюардессы паниковали и кричали на борту, и что он получил легкую травму головы.
ВМС США сообщают, что моряки, ремонтировавшие причал поблизости, также помогли в спасении, используя надувную лодку, на которой они доставляли людей на берег, прежде чем самолет погрузился под воду примерно на 30 метров (100 футов).
Данные Сети безопасности полетов показывают, что за последние два десятилетия в авиакатастрофах с самолетами компаний, зарегистрированных в PNG, погибло 111 человек, но ни одна из этих катастроф не имела отношения к Air Niugini.
Аналитик по разведданным сумел доказать факт сожжения женщины заживо
В субботу обвинение возбудило дело против мужчины, обвиняемого в сожжении в 2014 году жительницы Миссисипи.
Аналитик Департамента юстиции США Пол Роулетт дал многочасовые показания в качестве свидетеля-эксперта в области анализа разведданных.
Он рассказал членам департамента, как он использовал записи с мобильного телефона, чтобы составить общую картину действий 29-летнего обвиняемого Квинтона Теллиса и 19-летней жертвы Джессики Чемберс в ту ночь, когда она погибла.
Роулетт рассказал, что он получил данные о местонахождении этих людей с нескольких мобильных телефонов; согласно этим данным, тем вечером Теллис проводил время с Чемберс, что противоречит его предыдущим показаниям, сообщает The Clarion Ledger.
Он сказал, что находился со со своим другом Майклом Сэнфордом, однако согласно полученным данным его мобильный телефон находился вблизи Чемберс; когда выяснилось это обстоятельство, полиция допросила Сэнфорда.
В своих показаниях Сэнфорд заявил, что в тот день его не было в городе.
Когда прокуроры спросили Сэнфорда, говорит ли Теллис правду, утверждая, что той ночью находился в грузовике Сэнфорда, Сэнфорд сказал, что «это ложь, поскольку мой грузовик находился в Нэшвилле».
Другое несоответствие состояло в том, что Теллис сказал, что он познакомился с Чемберс за две недели до ее смерти.
Однако согласно записям телефонных звонков они созванивались только в течение одной недели.
Роулетт также показал, что спустя некоторое время после смерти Чемберс Теллис удалил со своего телефона ее текстовые сообщения, звонки и контактную информацию.
«Он стер ее из своей жизни», — говорит Хейл.
Защита должна приступить к изложению своих заключительных аргументов в воскресенье.
Судья сказал, что он ожидает, что процесс будет передан присяжным позже в тот же день.
The High Breed: что такое «осознанный хип-хоп»?
Трио хип-хопперов собирается бороться с негативным отношением к этому жанру, наполняя свою музыку позитивным содержанием.
Группа The High Breed из Бристоля утверждает, что содержание хип-хопа изменилось, уйдя от изначальных политических и социальных проблем.
Участники группы хотят вернуться к своим корням и снова сделать «осознанный» хип-хоп популярным.
Такие артисты, как The Fugees и Common, недавно стали свидетелями возрождения в Великобритании благодаря таким артистам, как Akala и Lowkey.
Еще одна черная?!
Нью-Йоркская няня подала в суд на семейную пару из-за расистского смс
Нью-йоркская няня подала в суд на семейную пару за дискриминационное увольнение после получения сообщения от женщины с жалобой на то, что няня оказалась «еще одной черной», которое женщина ошибочно вместо своего мужа отправила няне.
Супруги отрицают, что они расисты, утверждая, что иск подан с «целью вымогательства».
Линси Пласко-Флексмен, мать двоих детей, выразила беспокойство, узнав, что новая няня, предложенная сервисом по уходу за детьми, Жизель Морис, является чернокожей, когда та приехала в семью на свой первый рабочий день в 2016 году.
«НЕЕЕЕЕЕЕЕЕЕЕТ, ТОЛЬКО НЕ ЭТО, ЕЩЕ ОДНА ЧЕРНАЯ», — написала миссис Пласко-Флексмен в смс своему мужу.
Однако, вместо того, чтобы отправить смс своему мужу, она дважды ошибочно отправила его мисс Морис.
Осознав свою оплошность, «сконфуженная» Пласко-Флексмен уволила Морис, заявив в сервисе, что няня, которая оказалась афроамериканкой, плохо делала свою работу, и вообще, что они ожидали филиппинку, а не афроамериканку, сообщает New York Post.
Морис заплатили за один день работы, а затем отправили домой на Uber.
Теперь Морис подает в суд на семейную пару и требует компенсацию за увольнение в размере 350 долларов в день за шесть месяцев — согласно условиям изначальной устной договоренности, которые, однако, не были закреплены никаким контрактом.
«Я хочу, чтобы они поняли: такие вещи недопустимы», — сказала она «Post» в пятницу, добавив: «И я знаю, что это дискриминация».
Супруги не согласны с обвинением в расизме, и заявляют, что увольнение Морис можно считать разумным шагом, поскольку, обидев ее, они больше не смогли бы доверять ей.
«Моя жена отправила ей в сообщении то, что она на самом деле не имела в виду.
Она не расист.
Мы не расисты», — сказал муж, Джо Пласко, изданию Post.
«Но вы бы доверили своих детей кому-то, с кем вы были грубы, даже если нагрубили, сами того не желая?
Доверили бы вашего новорожденного ребенка?
Да ладно вам!».
Называя иск «вымогательством», Пласко сказал, что его жена родила ребенка всего два месяца назад и оказалась в «очень сложной ситуации».
«И вы готовы преследовать человека, оказавшегося в таком положении?
Не очень-то мило с вашей стороны», — добавил банковский работник, специализирующийся на инвестировании.
Судебное разбирательство все еще продолжается, но общественное мнение уже вынесло свой приговор в социальных сетях, обвинив пару в неприемлемом поведении и проблемах с логикой.
Издатели Paddington опасались, что читатели не поймут ход с говорящим медвежонком, говорится в новом письме
Дочь Бонда, Карен Янкель, родившаяся вскоре после того, как книга была принята издательством, так отозвалась о письме: «Трудно поставить себя на место того, кто читает произведение впервые, еще до того, как оно опубликовано.
Очень забавно знать, что Паддингтон имеет огромный успех».
Она также рассказала, что ее отец, до того, как он решил написать детскую книгу о медвежонке, работал оператором на BBC, и отнесся бы к отказу в публикации с оптимизмом, а также добавила, что 60-летний юбилей издания его книг был «и радостным и горьким», поскольку в прошлом году их автора не стало.
Что касается самого медвежонка Паддингтона, она отзывается о нем, как об «очень важном члене нашей семьи», и что ее отец тихо гордился тем, что его персонаж в конце концов обрел известность.
«Он был тихим и скромным человеком», — рассказывает его дочь.
«Ведь Паддингтон был для него таким реальным, и для отца это было почти как если бы его собственный ребенок добился успехов: он им гордился, хотя на самом деле не считал этот успех своей собственной заслугой.
Я думаю, что он относился к успеху Паддингтона именно таким образом.
Паддингтон был его творением и плодом его воображения, но он также всегда отдавал должное самому медвежонку».
Я была вынуждена попрощаться со своей умирающей дочерью по телефону
После посадки самолета ее дочь была доставлена ​​в больницу Ниццы Hospital Louis Pasteur 2, где врачи тщетно пытались спасти ее жизнь.
«Над регулярно звонил и говорил, что все действительно плохо, что что-то пошло не так», — рассказывает миссис Эднан-Лаперуза.
«Затем он позвонил снова и сказал, что она умрет в течение следующих двух минут, и что нам надо попрощаться.
Я так и сделала.
Я сказала: “Таши, я так тебя люблю, дорогая.
Мы скоро будем вместе.
Мы будем вместе.
Лекарства, которые врачи давали ей, заставляя ее сердце работать, постепенно переставали действовать,  покидая ее организм.
Она умерла раньше, чем ожидалось.
Я должна была просто сидеть и ждать, зная, что все подходит к концу.
Я не могла ни плакать, ни кричать или плакать, потому что вокруг меня были другие люди, другие семьи.
Мне пришлось крепко держать себя в руках».
В конце концов миссис Эднан-Лаперуза, скорбя о потере дочери, села на самолет вместе с другими пассажирами, смиряясь с огромной утратой, которую ей только что пришлось пережить.
«Никто вокруг не знал, что произошло», — рассказывает она.
«Моя голова поникла, я не переставала плакать.
Это трудно объяснить, но именно во время полета я испытала это всепоглощающее чувство сочувствия к Наду.
Он так нуждался в моей любви и поддержке.
Я знаю, насколько сильно он ее любил».
Женщины, пережившие утрату близких, предотвращают самоубийства на мосту
Две женщины, которые потеряли близких, совершивших самоубийство, пытаются предотвратить других от этого шага.
Шарон Дэвис и Келли Хамфри размещают на мосту Уэлш открытки с утешающими словами и телефонными номерами, по которым люди могут обратиться за поддержкой.
Сыну миссис Дэвис Тайлеру было 13 лет, когда у него началась депрессия, а в возрасте 18 лет он покончил с собой.
«Я не хочу, чтобы другие родители испытывали то же, что испытываю я каждый день», — рассказывает она.
45-летняя Дэвис, живущая в Лидни, рассказывает, что ее сын был отличным поваром и обладал чертовски обаятельной улыбкой.
«Все любили его улыбку.
Все говорили, что когда он улыбается, в комнате будто зажигается свет».
Однако перед смертью он оставил работу, поскольку переживал по-настоящему страшные времена».
Это случилось в 2014 году, и покончившего с собой Тайлера нашел его родной брат, которому тогда было 11 лет.
Миссис Дэвис говорит: «Я не перестаю бояться, что пойдет цепная реакция».
Миссис Дэвис придумала эти открытки, «чтобы люди знали, что есть кто-то, к которому можно обратиться и все рассказать, даже если это ваш друг.
Нельзя сидеть и молчать, надо разговаривать с людьми».
Миссис Хамфриз, которая дружит с миссис Дэвис в течение многих лет, потеряла Марка, своего мужа, с которым прожила 15 лет — его не стало вскоре после смерти его матери.
«Он не говорил, что чувствует себя подавленным, расстроенным или что-то в этом роде», — рассказывает она.
«За пару дней до Рождества мы заметили перемены в его настроении.
На Рождество ему стало особенно плохо: он даже не смотрел на детей, когда они открывали свои подарки».
Она говорит, что его смерть была огромной травмой для них, но они должны пройти через это, это событие потрясло нашу семью.
Оно разорвало ее на части.
Но нам надо продолжать жить и бороться».
Если вы испытываете проблемы, вы можете бесплатно обратиться к этим волонтерам по номеру 116 123 (Великобритания и Ирландия), отправить письмо по электронной почте jo@samaritans.org или посетить их веб-сайт по ссылке.
Будущее Бретта Кавано висит на волоске: ФБР начинает расследование
«Я подумал, что если бы мы могли получить что-то вроде того, о чем он просил — расследование, ограниченное по времени и объему, мы могли бы привнести хоть немного единства», — сказал г-н Флэйк в субботу, добавив, что он опасается, что комитет «разрывается» на фоне растущей партийной цепной реакции.
Почему г-н Кавано и его сторонники-республиканцы не хотели, чтобы ФБР проводило расследование?
Время — причина их колебаний.
Промежуточные выборы пройдут всего через пять недель, 6 ноября, и если — как и ожидается — все пройдет плохо для республиканцев, то они будут серьезно ослаблены в своих попытках получить человека, которого они хотят, и избрать его на должность верховного судьи страны.
Джордж У. Буш звонит сенаторам, лоббируя поддержку г-на Кавано, который с свое время работал в Белом доме на г-на Буша, и который благодаря Бушу познакомился со своей будущей женой Эшли, работавшей тогда личным секретарем г-на Буша.
Что произойдет после того, как ФБР обнародует свой отчет?
Будет проведено голосование в Сенате, который в настоящее время состоит из 51 республиканца и 49 демократов.
До сих пор не ясно, сможет ли г-н Кавано получить хотя бы 50 голосов на заседании Сената, что позволило бы вице-президенту Майку Пенсу решить проблему равенства голосов и подтвердить его кандидатуру на должность верховного судьи.
Число перебежчиков из Северной Кореи сократилось при Ким
С тех пор, как Ким Чен Ын пришел к власти семь лет назад, число северокорейских перебежчиков в Южную Корею сократилось, заявил южнокорейский законодатель.
Пак Бён Сеуг, сославшись на данные министерства юга, заявил, что по сравнению с 2706 случаями побега, зафиксированными в 2011 году, в прошлом году эта цифра сократилась до 1127 случаев.
Г-н Пак говорит, что ключевыми факторами стали ужесточение пограничного контроля между Северной Кореей и Китаем, а также и более высокие ставки, взимаемые контрабандистами, вывозящими людей.
Пхеньян публичных комментариев не дает.
Подавляющему большинству северокорейских перебежчиков в конечном итоге предлагается гражданство Южной Кореи.
Сеул утверждает, что с момента окончания Корейской войны в 1953 году более 30 000 северокорейцев незаконно пересекли границу.
Большинство людей бежит через Китай, имеющий самую длинную границу с Северной Кореей, которую легче пересечь, чем надежно защищенную демилитаризованную зону (ДМЗ) между двумя Кореями.
Китай рассматривает перебежчиков как нелегальных мигрантов, а не беженцев, и зачастую подвергает их принудительной репатриации.
Отношения между Севером и Югом, которые все еще находятся в состоянии войны, заметно улучшились за последние месяцы.
В начале этого месяца лидеры двух стран встретились в Пхеньяне для возобновления зашедших в тупик переговоров по ядерному разоружению.
Это произошло после июньской исторической встречи президента США Дональда Трампа и Ким Чен Ына в Сингапуре, на которой они достигли общих договоренностей о разоружении Корейского полуострова.
Однако в субботу министр иностранных дел Северной Кореи Ри Юн Хо обвинил США в том, что своими санкциями они препятствуют прогрессу в этом вопросе.
«Если у нас не будет хотя бы малейшего доверия к США, у нас также не будет уверенности в нашей национальной безопасности, а в таких обстоятельствах мы никоим образом не сможем начать разоружение в одностороннем порядке», — заявил г-н Ри в своем выступлении на Генеральной Ассамблее ООН в Нью-Йорке.
Нэнси Пелоси называет Бретта Кавано «истеричным», и утверждает, что он не годится для работы в Верховном суде
Лидер меньшинства в Палате представителей Нэнси Пелоси назвала Бретта Кавано, кандидата на должность верховного судьи, «истеричным» и сказала, что он по причине своего темперамента непригоден для работы в Верховном суде.
Пелоси сделала этот комментарий в интервью в субботу на мероприятии Texas Tribune Festival в г. Остин, штат Техас.
«Я не могу не думать о том, что если бы женщина позволила себе когда-либо вести себя подобным образом, ее бы сразу назвали «истеричкой», — говорит Пелоси о своей реакции на показания Кавано в Юридическом комитете Сената, данные им в четверг.
Кавано эмоционально отвергал обвинения доктора Кристин Блейси Форд в сексуальных домогательствах, которые якобы имели место, когда они оба были еще подростками.
Кавано выступал достаточно эмоционально, временами даже срывался на крик и задыхался, рассказывая о своей семье и школьных годах.
Он также недвусмысленно осудил демократов  комитета, назвав обвинения против него «гротескным и четко спланированным убийством действующего лица», организованным либералами, рассерженными тем, что Хиллари Клинтон проиграла президентские выборы 2016 года.
Пелоси также сказала, что, по ее мнению, своими показаниями Кавано лишь подтвердил, что не может служить в Верховном суде, поскольку имеет предвзятое отношение к демократам.
«Я думаю, что он дисквалифицирует себя своими утверждениями, а также тем, как он набрасывается на Клинтонов и демократов», — говорит она.
Пелоси возмутилась, когда ее спросили, попытается ли она привлечь к ответственности Кавано, если его вина подтвердится, и если демократы получат большинство в Палате представителей.
«Я скажу так: если он не говорит правду Конгрессу или ФБР, то он не годится не только для Верховного суда, но и для суда, на котором он находится сейчас», — сказала Пелоси.
Кавано в настоящее время является судьей окружного апелляционного суда D.C.
Пелоси добавила, что, будучи демократом, она обеспокоена возможными решениями Кавано в отношении Закона о доступном медицинском обслуживании или «Роу против Уэйда», поскольку он считается представителем консервативного правосудия.
На слушаниях по своей кандидатуре Кавано обошел стороной вопрос, станет ли он отменять некоторые решения Верховного суда.
«Сейчас не время, чтобы пускать истеричного и предвзятого человека на должность верховного судьи и при этом восклицать: “как великолепно!”, — говорит Пелоси.
И женщины должны владеть этим.
Это праведный гнев, месяцы и годы ярости, она не может пройти через это без слез.
«Когда мы злимся, мы плачем», — сказала мне мисс Штейнем 45 спустя.
«Я не думаю, что это так уже необычно, как считаете?»
Она продолжила: «Мне очень помогла женщина, которая работала где-то на руководящей должности. Она рассказала, что она тоже плакала, когда злилась, но разработала технику, с помощью которой она объясняла своему собеседнику: “Вы можете подумать, что я плачу, потому что я расстроена.
На самом деле я рассержена".
А потом она просто продолжала разговор.
Меня здорово впечатлил этот подход».
Слезы разрешены как выход для гнева отчасти потому, что они в корне неверно трактуются.
Одно из моих самых болезненных воспоминаний о первой работе в офисе, где доминировали мужчины: однажды я заплакала от яростного гнева, но меня схватила за шиворот пожилая женщина, бездушный менеджер, которую я всегда ужасно боялась, и выволокла на лестничную клетку.
«Никогда не позволяй, чтобы они видели, как ты плачешь», — сказала она мне.
«Они же не знают, что ты плачешь от злости.
Они думают, что ты расстроилась, и радуются, думая, что наконец-то довели тебя».
Патриция Шредер, тогда конгрессмен от демократов из Колорадо, работала с Гари Хартом в ходе его президентских выборов.
В 1987 году мистер Харт был пойман на какой-то несерьезной интрижке и вышел из гонки, г-жа Шредер, глубоко разочарованная, решила, что нет никаких причин, мешающих ей баллотироваться на пост президента.
«Это решение не было как следует обдумано», — признавалась она мне с усмешкой 30 лет спустя.
«В гонке уже тогда участвовало семь других кандидатов, и последнее, что им было нужно, это еще один кандидат.
Кто-то назвал тот случай “Белоснежка и семь гномов”».
Кампания уже подходила к концу, она сильно отставала в сборе средств, и поэтому она поклялась, что не будет участвовать в гонке, если не соберет 2 миллиона долларов.
Казалось, это был совершенно проигрышный вариант.
Она обнаружила, что некоторые из ее сторонников, которые давали по 1000 долларов мужчинам, предлагали ей только 250.
«Я что для них, уцененный товар, что ли?», — удивлялась она.
Когда она выступила с речью, объявляя, что не будет проводить официальную кампанию, она была настолько охвачена эмоциями — благодарностью людям, которые ее поддержали, разочарованием системой, которая так затрудняла сбор денег и доступ к избирателям, а также гневом из-за дискриминации по половому признаку, что она задыхалась.
«Вы бы подумали, что у меня нервный срыв», — вспоминает г-жа Шредер о том, как пресса отреагировала на нее.
«Можно было подумать, что Kleenex был моим корпоративным спонсором.
Я все еще думала: что же они напишут на моем памятнике?
“Она без конца рыдала”?»
Каким образом торговая война с Америкой может быть полезна для Пекина
Эксперты считают, что первые залпы торговой войны между США и Китаем были оглушительны, и, хотя битва еще далека от завершения, раскол между странами может принести пользу Пекину в долгосрочной перспективе.
Дональд Трамп, президент США, сделал первое предупреждение в начале этого года, облагая налогом основные китайские экспортные товары, включая солнечные батареи, сталь и алюминий.
Самая значительная эскалация имела место на этой неделе, когда новые тарифы повлияли на товары на сумму 200 млрд долларов (150 млрд фунтов), фактически обложив налогом половину всех товаров, поступающих в США из Китая.
Пекин каждый раз наносил равносильные ответные удары, в последнее время устанавливая пошлины на американские товары на сумму 60 миллиардов долларов в размере от пяти до десяти процентов.
Китай пообещал, что ответные меры против США будут каждый раз равносильны, и вторая по величине экономика мира вряд ли начнет испытывать хотя бы малейшие сложности в ближайшее время.
Заставить Вашингтон отступить означает уступить требованиям, но публично уступить США было бы слишком позорным для Си Цзиньпина, президента Китая.
Тем не менее, по мнению экспертов, если Пекин сможет правильно разыграть свои карты, давление торговой войны, оказываемое США, может оказать долгосрочную поддержку Китаю, снизив взаимозависимость двух экономик.
«Тот факт, что скороспелое политическое решение в Вашингтоне или Пекине может создать условия, которые приведут к экономическому штопору в любой из этих стран, на самом деле намного более опасен, чем это признавали ранее наблюдатели», — говорит Эбигейл Грейс, научный сотрудник Аналитического центра новой американской безопасности (Center for New American Security), специализирующийся на Азии.
Министр иностранных дел заявил, что Сирия «готова» к возвращению беженцев
Сирия заявляет, что готова к добровольному возвращению беженцев, и обращается за помощью в восстановлении страны, которая была опустошена войной, продолжавшейся более семи лет.
Выступая на Генеральной Ассамблее ООН, министр иностранных дел Валид аль-Муалем сообщил, что условия в стране улучшаются.
«Сегодня ситуация на местах стала более стабильной и безопасной благодаря успехам в борьбе с терроризмом», — сказал он.
Правительство продолжает восстанавливать разрушенные террористами районы, чтобы люди смогли спокойно жить там.
В настоящее время созданы все условия для добровольного возвращения беженцев в страну, которую им пришлось покинуть из-за террористических атак и односторонних экономических мер, повлиявших на их повседневную жизнь.
По оценкам ООН, более 5,5 миллионов сирийцев покинули страну с начала войны в 2011 году.
Еще шесть миллионов человек, все еще живущих в стране, нуждаются в гуманитарной помощи.
Аль-Муалем сказал, что сирийский режим будет благодарен за помощь в восстановлении разрушенной страны.
Но он подчеркнул, что страна не примет помощь на каких-либо условиях или помощь от стран, спонсирующих терроризм.
Европа закрепляет победу на Кубке Райдера в Париже
Команда Европы выиграла Кубок Райдера 2018, победив команду США с итоговым счетом от 16,5 — 10,5 на Le Golf National в пригороде Парижа, Франция.
США уже шесть раз подряд проигрывали на европейской земле, а европейский Кубок Райдера не выигрывали с 1993 года.
Европа вернула себе корону благодаря команде датского капитана Томаса Бьорна, которая набрала 14,5 очков, необходимые им для победы над Соединенными Штатами.
Американская звезда Фил Микельсон, который упорно сражался большую часть турнира, сделал свой первый дальний удар в воду на 16-й лунке пар-3, уступив свой матч Франческо Молинари.
Итальянский гольфист Молинари побеждал во всех своих раундах, став 1-х-4-х игроков, которые когда-либо шли 5-0-0, так как текущий формат турнира начался в 1979 году.
Американец Джордан Спит потерпел поражение 5:4 игроком с самым низким рейтингом в европейской команде, Турбьёрном Олесеном из Дании.
Один из лучших в мире игроков, Дастин Джонсон, уступил 2:1 Яну Полтеру из Англии, который, возможно, участвовал в Кубке Райдера последний раз.
Испанец Серхио Гарсиа, ветеран восьми Кубков Райдера, стал победителем турнира за всю историю Европы с 25,5 очками за карьеру.
«Обычно я не плачу, но сегодня не могу удержаться.
Это был сложный год.
Я очень благодарен Томасу за то, что он выбрал меня и поверил в меня.
Я очень счастлив снова получить кубок.
Все дело в команде, и я рад, что смог помочь», — говорит эмоциональный Гарсиа после европейской победы.
Он передает факел своему соотечественнику Джону Рэму, который в воскресенье одержал победу над американской легендой гольфа Тайгером Вудсом со счетом 2:1 в одиночной игре.
«Я испытываю невероятную гордость за эту победу — я вырос, наблюдая за игрой Тайгера Вудса», — говорит 23-летний Рэм.
Вудс проиграл все четыре своих матча во Франции и теперь рекорд его карьеры составляет 13-21-3.
Эти показатели являются довольно странными для одного из величайших игроков всех времен, выигравшего 14 главных титулов, уступив только Джеку Никлаусу.
Сборная США боролась в течение всех выходных, тщетно пытаясь преуспеть. Исключение составили Патрик Рид, Джастин Томас и Тони Финау, которые показывали гольф высочайшего класса на протяжении всего турнира.
Капитан США Джим Фьюрик сказал после неутешительного выступления своей команды: «Я горжусь этими парнями, они боролись.
Сегодня утром нам удалось слегка потрепать Европу.
Не получилось.
Снимаем шляпы перед Томасом.
Он великолепный капитан.
Все его 12 игроков играли превосходно.
Мы перегруппируемся, я буду работать с PGA Америки и нашим Комитетом Кубка Райдера, и мы будем двигаться вперед, добиваясь успеха.
Я обожаю всех 12 ребят, и горд, что являюсь их капитаном.
Надо уметь проигрывать.
Мы проиграли».
Красный прилив: новости Концентрация микроорганизмов снизилась в Пинеллас, Манати и Сарасоте
В последнем отчете Комиссии Флориды по рыбам и дикой природе отражено общее снижение концентрации красного прилива в некоторых частях района залива Тампа.
По данным FWC, в районах округов Пинеллас, Манати, Сарасота, Шарлотта и Кольер сообщается об обильном цветении, что говорит о снижении концентрации микроорганизмов.
Красный Прилив простирается приблизительно на 130 миль береговой линии от северных Пинелл до южных округов Ли.
Очаги можно наблюдать примерно в 10 милях от берега округа Хиллсборо, но по сравнению с прошлой неделей их количество существенно снизилось.
Красный прилив также наблюдается в округе Паско.
На прошлой неделе сообщалось о среднией концентрации в округе Пинеллас и вблизи него, от низкой до высокой концентрации в прибрежной зоне округа Хиллсборо, высокой концентрации в округах Манати и Сарасота и в прибрежных зонах, о средней концентрации в округе Шарлотте, о высокой концентрации на побережье округа Ли, и низкой концентрации в округе Кольер.
В округах Пинеллас, Манати, Сарасота, Ли и Кольер по-прежнему наблюдается вероятность раздражения дыхательных путей.
По северозападной Флориде о такой вероятности на прошлой неделе не сообщалось.
